[
  {
    "title": "Senior QC Engineer",
    "company": "Kegmil",
    "detail_link": "https://aniday.com/en/job/senior-qc-engineer-11639",
    "image": "https://static.aniday.com/uploads/images/size70/9fbe2be29a4f4e7097cb2d02b2eef64e_20240819015818.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>About us<br>Kegmil is a holistic solution provider of mission-critical Enterprise Systems, with a spike in Field Service Management software-as-a-service. We are a global team serving international clients, and strongly backed by Mitsubishi Electric (world-leading manufacturer of products ranging from home electronics to satellite systems, headquartered in Japan)<br>Our cloud-based, AI-enabled Field Service Management solution is #1 amongst B2B clients in Southeast Asia and is adopted across various industries such as Elevator &amp; Escalator, Data Center, Medical Equipment, Defence &amp; Aerospace, Marine Offshore, etc.<br>Our offerings expand to Enterprise Resource Planning (ERP) systems integration and deployment - including Inventory Management Systems (IMS), HR Information Systems (HRIS), Customer Relationship Management (CRM), Procurement Systems and others<br><br>Job Description:<br>Kegmil is in search of a QC Engineer with 5 years of experience, adept at both manual and automated testing, and possessing a positive attitude with a willingness to learn. As a valued member of the product-core development team, your role will involve contributing your insights and efforts to ensure the successful launch of our product, meeting and exceeding clients' expectations.<br><br>Responsibilities<br>Review requirements, specifications, and technical design documents to provide timely and insightful feedback.<br>Create detailed, comprehensive, and well-structured test cases.<br>Estimate and prioritize testing activities effectively.<br>Identify, record, meticulously document, and track bugs.<br>Conduct thorough regression testing once bugs are resolved.<br>Collaborate with internal teams, including developers and product managers, to identify system requirements and address issues.<br>Design, develop, and execute automation scripts using open-source tools (experience in this area is a plus).</p><h3>Required Skills and Experience</h3><p>Requirements<br><br>Demonstrated work experience in software quality assurance (minimum of 5 YOE).<br>Profound knowledge of software QA methodologies, tools, and processes.<br>Proven ability to craft clear, concise, and comprehensive test cases.<br>Experience with Test Management and Bug Tracking tools.<br>Hands-on experience with both white box and black box testing.<br>Familiarity with Agile/Scrum development processes.<br>Ability to work independently or collaboratively with other QC team members.<br>Strong problem-solving and decision-making skills.<br>Proficiency in using automated testing tools (experience in this area is a plus).<br>Exposure to performance and/or security testing (experience in these areas is a plus)<br>Able to work independently and ability to control quality in a development group<br>Product mindset</p><h3>Why Candidate should apply this position</h3><p>Collaborate with seasoned and highly skilled technical experts, including software architects with over a decade of experience.<br>Benefit from a flexible work schedule tailored to your needs.<br>Experience a friendly and dynamic workplace environment.<br>Access annual health check-ups and premium healthcare coverage.<br>Receive annual salary reviews based on your demonstrated abilities and contributions.</p>",
    "techStacks": [
      "Manual testing",
      "Test Plan Writing",
      "Test Automation",
      "Test Strategy Writing"
    ]
  },
  {
    "title": "Quality Control Fresher/ Junior",
    "company": "Kegmil",
    "detail_link": "https://aniday.com/en/job/quality-control-fresher-junior-11638",
    "image": "https://static.aniday.com/uploads/images/size70/9fbe2be29a4f4e7097cb2d02b2eef64e_20240819015818.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>About Kegmil: Kegmil is a holistic solution provider of mission-critical Enterprise Systems, with a spike in Field Service Management software-as-a-service. We are a global team serving international clients, and strongly backed by Mitsubishi Electric (a world-leading manufacturer of products ranging from home electronics to satellite systems, headquartered in Japan)<br>Our cloud-based, AI-enabled Field Service Management solution is #1 amongst B2B clients in Southeast Asia and is adopted across various industries such as Elevator &amp; Escalator, Data Center, Medical Equipment, Defence &amp; Aerospace, Marine Offshore, etc. Our offerings expand to Enterprise Resource Planning (ERP) systems integration and deployment - including Inventory Management Systems (IMS), HR Information Systems (HRIS), Customer Relationship Management (CRM), Procurement Systems and others<br><br>Location: HCMC or Remote<br>Job Type: Full-time<br>Responsibilities:<br><br>Develop, maintain and execute test cases.<br>Help design and create test scripts using JavaScript, Selenium.<br>Create detailed, comprehensive, and well-structured test cases.<br>Identify, record, meticulously document, and track bugs.<br>Collaborate with internal teams, including developers, product owners, and business stakeholders, to identify system requirements and address issues.</p><h3>Required Skills and Experience</h3><p>Requirements:<br>A final year student or recent graduate majoring in Computer Science, Information Technology, or a related field.<br>Understanding or knowledge of testing technologies (e.g. Selenium, TestNG, JUnit).<br>Willingness to learn and adapt to new technologies.<br>Experience with performance testing tools.<br>Excellent verbal and written communication skills.<br>Excellent problem-solving and analytical skills.<br>Cope well under pressure.</p><h3>Why Candidate should apply this position</h3><p>What We Offer:<br>Competitive salary and comprehensive benefits package.<br>Dynamic and innovative work environment with opportunities for personal and professional growth.<br>Access to cutting-edge tools and technologies.</p>",
    "techStacks": [
      "Selenium",
      "Logical Thinking",
      "Testing / QA"
    ]
  },
  {
    "title": "Full Stack Web Developer",
    "company": "VSee Health",
    "detail_link": "https://aniday.com/en/job/full-stack-web-developer-11569",
    "image": "https://static.aniday.com/uploads/images/size70/2d48925905f642af825022fceadec48b_20241127083307.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>We're in search of a seasoned Senior Full Stack Developer who excels in both frontend development using ReactJS and backend development with PHP.<br><br>In this role, you'll be pivotal in shaping and enhancing our VSee Clinic Platform, taking charge of its design, development, and upkeep. Working hand in hand with our frontend developers, product managers, and various stakeholders, you'll craft bespoke software solutions that align precisely with our operational requirements.<br><br>RESPONSIBILITIES<br>- Collaborate with cross-functional teams to design, develop, and deploy scalable web applications.<br>- Led the front-end development efforts, focusing strongly on ReactJS to create responsive, intuitive user interfaces.<br>- Design and implement backend solutions using PHP to ensure the performance, reliability, and security of our applications.<br>- Develop RESTful APIs and integrate third-party services as needed.<br>- Work closely with DevOps engineers to deploy and maintain microservices on EKS.<br>- Stay up-to-date with the latest technologies and best practices in web development.</p><h3>Required Skills and Experience</h3><p>- Bachelor's degree in Computer Science, Engineering, or a related field.<br>- 8+ years of experience in full-stack web development, with a focus on ReactJS for frontend and PHP for backend.<br>- Solid understanding of JavaScript, HTML, CSS, and related web technologies.<br>- Experience with modern frontend frameworks/libraries such as Redux, Vue.js, or AngularJS is a plus.<br>- Proficiency in PHP frameworks such as Laravel or Symfony.<br>- Experience with containerization and orchestration tools like Docker and Kubernetes.<br>- Strong knowledge of RESTful API design and implementation.<br>- Familiarity with cloud services, particularly AWS, is preferred.<br>- Excellent problem-solving skills and attention to detail.<br>- Strong communication and collaboration skills.<br>- Strong \"get things done\" work ethic. <br>- English: Good communication. <br><br>Note:<br>This role may involve accessing Protected Health Information (PHI) as defined by the Health Insurance Portability and Accountability Act (HIPAA). Security awareness training and compliance with strict security policies are required.</p><h3>Why Candidate should apply this position</h3><p>- Remote full-time<br>- Performance bonus.<br>- Working time: Mon - Fri<br>- Global and collaborative working environment<br>- Flexibility in your time management<br>- 12 days off allowance per year (not including Vietnam national holiday)<br>- Health insurance <br>- A chance to improve yourself in tech and business<br>- Room to grow professionally, sponsorship for learning &amp; development of related skills</p>",
    "techStacks": [
      "ReactJS",
      "PHP"
    ]
  },
  {
    "title": "Software Developer (Full Stack)",
    "company": "Anonymous",
    "detail_link": null,
    "description": "No detail link provided",
    "techStacks": "No detail link provided"
  },
  {
    "title": "Senior Oracle EBS",
    "company": "HIPTECH SOLUTION",
    "detail_link": "https://aniday.com/en/job/senior-oracle-ebs-11244",
    "image": "https://static.aniday.com/uploads/images/size70/088c57e996614a57ae1b993a1e058352_20241028024223.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Our customer is a big computer peripheral manufacturer in the US. They have B2B and B2C business with clients all over the world with their factories in US, China, Taiwan and their warehouses in US, UK, China and Taiwan.<br>We are looking for senior Oracle EBS engineers/consultant to join the team for long-term jobs working on our customer Oracle EBS (12.2) system.<br><br>Job Responsibilities: <br> Perform the work of a Senior Oracle EBS with 80% on technical development and 20% on consulting and support.<br> Join project development to expand Oracle EBS operation by integrating with other systems via EDI / API or add new/customize existing business logic for OM, INV, PO, WIP modules.<br> Monitor and resolve operation issues related to orders, shipment, invoice, MES orders, working directly with business users.<br> Implement the integration with 3PL warehouses.<br> Collaborate with customer’s VN, US and Taiwan team for requirement clarification, technical design and discussion.<br> Create technical design documentation, test cases, perform unit testing and support end-to-end testing.</p><h3>Required Skills and Experience</h3><p> At least 5 years of experience working with Oracle EBS.<br> Strong in technical using PL/SQL to create package, procedure, trigger interact with EBS standard APIs.<br> Having business knowledge of modules OM, INV, PO, WIP.<br> Familiar with Oracle Form and can customize Oracle Form.<br> Strong in debugging, error handling and performance optimization.<br> Good at English Communication.</p><h3>Why Candidate should apply this position</h3><p> Be able to work on projects for worldwide customer with complicated business models.<br> Work with Oracle EBS experts from both company and customer sides.<br> Competitive salary package based on your competence plus Annual Bonus and Project Performance Bonus.<br> “HIPTECH care” health insurance which is exclusive for HIPTECH employees.<br> 18 Leave days (12 Annual leave, 6 Sick Leave).<br> Annual health check-up.<br> 13th-month Salary.</p>",
    "techStacks": [
      "Backend",
      "APIs",
      "Debugging",
      "SQL",
      "Oracle"
    ]
  },
  {
    "title": "Web Developer (Linux/BASH/PHP/SQL)",
    "company": "PGT Solutions",
    "detail_link": "https://aniday.com/en/job/web-developer-linux-bash-php-sql-11191",
    "image": "https://static.aniday.com/uploads/images/size70/39e38e12d6b44af19fc1f46f6ffd21e8_20241023083021.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Repair and new development support for core systems for distribution and retail.</p><h3>Required Skills and Experience</h3><p>Web development experience and proactive communication skills.<br>More than 3 years of practical experience in Linux/BASH/PHP/SQL.<br>Design skills to incorporate requirements into basic and detailed designs.<br>Reverse engineering skills to read design intent from existing implementations.<br>Japanese from N2 and above.</p><h3>Why Candidate should apply this position</h3><p>Competitive salary and performance-based bonuses.<br>More discussion at the interview.<br>Work location: Remote.<br>Working time: 10:00 – 19:00.</p>",
    "techStacks": [
      "Developer",
      "PHP",
      "Web Development",
      "Linux",
      "Design",
      "SQL",
      "Bash"
    ]
  },
  {
    "title": "Java Developer",
    "company": "PGT Solutions",
    "detail_link": "https://aniday.com/en/job/java-developer-11189",
    "image": "https://static.aniday.com/uploads/images/size70/39e38e12d6b44af19fc1f46f6ffd21e8_20241023083021.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Expanded functionality related to the UGC platform.<br>Design, development and testing work to develop new functionality and extend existing functionality.<br>Prepare and store documents related to the above content.</p><h3>Required Skills and Experience</h3><p>Experience developing Java, Springboot (over 3 years).<br>MySQL development experience.<br>Experience developing with Scrum.<br>Japanese from N2 and above.</p><h3>Why Candidate should apply this position</h3><p>Competitive salary and performance-based bonuses.<br>More discussion at the interview.<br>Work location: Remote.<br>Working time: 10:00 – 19:00.</p>",
    "techStacks": [
      "Developer",
      "Scrum",
      "Spring Boot",
      "Java",
      "MySQL"
    ]
  },
  {
    "title": "IOS Developer (Swift)",
    "company": "PGT Solutions",
    "detail_link": "https://aniday.com/en/job/ios-developer-swift-11188",
    "image": "https://static.aniday.com/uploads/images/size70/39e38e12d6b44af19fc1f46f6ffd21e8_20241023083021.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>iOS development support for email application development team.<br>Develop additional functions, modify functions, and perform operation and maintenance.<br>Support iOS application development for user email services.</p><h3>Required Skills and Experience</h3><p>More than 2 years of Swift development experience, experience creating unit tests with XCTest.<br>Experience in creating basic design documents and detailed iOS application design.<br>Experience using Git.<br>Ability to communicate fluently with team members and customers, such as adjusting specifications and sharing progress.<br>Japanese from N2 and above.</p><h3>Why Candidate should apply this position</h3><p>Competitive salary and performance-based bonuses.<br>More discussion at the interview.<br>Work location: Remote.<br>Working time: 10:00 – 19:00.</p>",
    "techStacks": [
      "Developer",
      "iOS Development",
      "Swift",
      "Git"
    ]
  },
  {
    "title": "Senior iOS Native Engineer (Swift)",
    "company": "Reeracoen Vietnam",
    "detail_link": "https://aniday.com/en/job/senior-ios-native-engineer-swift-11130",
    "image": "https://static.aniday.com/uploads/images/size70/41efcae289ef4498960059274d8fa8ac_20241018023032.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>【Job Summary】<br>- Responsible for developing the application in cooperation with the product manager. Working in the form of Squad, a small team can quickly and consistently engage in everything from design to development, testing, and operation.<br><br>【Main responsibilities】<br>1. Job Scope<br>- Development of applications using Swift<br>- API design/implementation linked with the backend<br>- Propose and implement new features and improvements<br>- Team development in collaboration with project managers, designers, and QA<br>- Refactoring of existing applications, enhancements Cost reduction of regression testing by implementing appropriate test code<br>- Continuously learn about technical trends and industry best practices and apply them to the product<br><br>Note: The assigned product will be determined based on the candidate's skills and preferences, as well as the internal structure of the company.</p><h3>Required Skills and Experience</h3><p>- University graduate in the related majors<br>- 6+ years of experience in developing native applications for iOS using Swift<br>- Experience as a technical lead throughout the full project development lifecycle<br>- Experience in developing and operating native applications linked to Web applications<br>- Experience in developing functions with writing unit tests<br>- Experience in architecture design and framework selection based on application requirements<br>- Creating high-quality code for security, performance, scalability, etc.<br>- Skills in code review, bug analysis, error troubleshooting<br>- Understanding of the software development lifecycle<br>- Knowledge of Web application security<br>- Programming, debugging, and testing skills<br>- Ability to deliver high-performance and scalable solutions<br>- Experience working in a team development environment.<br>- Good at English communication (Intermediate)</p><h3>Why Candidate should apply this position</h3><p>- Good benefits package (Flexible working time, Insurance in full gross salary, Attractive salary, Macbook Pro, monitors,...)<br>- 12 days annual leaves, + New Year holiday according to the Japanese calendar<br>- Good career advancement opportunities</p>",
    "techStacks": []
  },
  {
    "title": "Full Stack Engineer",
    "company": "Momos",
    "detail_link": "https://aniday.com/en/job/full-stack-engineer-11084",
    "image": "https://static.aniday.com/uploads/images/size70/fafad1f0137847f09a399f5cd6ba4e82_20241017050717.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>The Role:<br>The Product Engineering team is looking for a full-stack engineer to drive meaningful impact for our customers. As a full-stack engineer, you will own design, implementation, and operation of key platform features. We are looking for self motivated individuals from all backgrounds, who are prepared to take on the challenges and opportunities that come from working in a fast paced, early stage startup. Success in this role will lead to increased responsibility and leadership opportunities as Momos continues to scale.<br><br>Primary Role &amp; Responsibilities:<br>Build powerful web applications using ReactJS and NodeJS<br>Contribute to technical architecture design for our new products and enhancements to current products<br>Collaborate closely with other software engineers, product managers, and designers<br>Help other engineers on the team via mentorship, code pairs and code reviews<br>Hustle - plain and simple</p><h3>Required Skills and Experience</h3><p>B.S. and/or M.S. in Computer Science or a related technical field, or equivalent experience<br>3-5 years of experience building applications on a modern web technology stack<br>A strong technical background anchored around modern backend web development, we use NodeJS here, but other languages such as Express, Django, Flask, Spring, Play, etc. are also welcome.<br>Proficiency with modern frontend web technologies - big plus for ES6+, React, and Redux<br>Well-versed with both relational and NoSQL database technologies<br>Hands on experience with public cloud infrastructure (AWS, Azure, GCP) including serverless application model</p><h3>Why Candidate should apply this position</h3><p>Benefits:<br>Competitive salary and bonus scheme<br>Private medical insurance<br>Paid time off and a flexible working culture<br>Opportunities for rapid career advancement<br>A dynamic and inclusive company culture<br>Access to the latest technology and tools for personal development<br>Comprehensive onboarding program for new employees<br>Employee recognition programs for outstanding performance<br>Participation in industry conferences and events<br>A supportive environment that encourages innovation and creativity<br><br>Cultural Values:<br>Mission-driven and fast-paced, entrepreneurial environment.<br>A collaborative and flat company culture.<br>Comprehensive private health insurance.<br>Discretionary trips to our offices across the globe, with global travel medical insurance (when it’s safe to travel!).<br>Cross-cultural team bonding/networking.<br>Love Food? Join our Team!<br><br>Equal Opportunity:<br>Momos is an equal opportunity workplace where we embrace diversity and different cultures. We started as an international Company, and know that building an organization with different experiences, thoughts and opinions allows our team to grow and excel.</p>",
    "techStacks": [
      "Enginering",
      "Software Development",
      "Applications",
      "Web Development",
      "Azure",
      "AWS",
      "Cloud",
      "NoSQL",
      "FrontEnd",
      "NodeJS",
      "Backend",
      "GCP"
    ]
  },
  {
    "title": "Senior/ Mid Backend Engineer (Hanoi | Remote)",
    "company": "Breadstack",
    "detail_link": "https://aniday.com/en/job/senior-mid-backend-engineer-hanoi-remote-11068",
    "image": "https://static.aniday.com/uploads/images/size70/201eda78952b478c9423f17c929ca701_20241011072535.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>- Design, develop, and maintain backend services and APIs using Python.  <br>- Collaborate with frontend developers to integrate user-facing elements with server-side logic.  <br>- Optimize performance and scalability of the backend systems to handle large volumes of data and high traffic.  <br>- Implement security best practices to protect sensitive data and ensure compliance with industry standards.  <br>- Write clean, maintainable, and well-documented code, following best practices in software development.  <br>- Participate in code reviews, providing constructive feedback to peers and junior developers.  <br>- Work closely with the DevOps team to ensure smooth deployment and operation of services.  <br>- Troubleshoot and debug complex issues, identifying root causes and implementing effective solutions.  <br>- Contribute to the architecture and design of new features and enhancements to the platform.  <br>- Stay up-to-date with the latest industry trends and technologies, and apply them to improve our systems.</p><h3>Required Skills and Experience</h3><p>- Bachelor's degree in Computer Science, Engineering, or a related field, or equivalent experience  <br>- Strong knowledge of data structures and algorithms  <br>- Solid understanding of software architecture principles and design patterns  <br>- Experience in backend development  <br>- Experience with Python, Django, and Celery  <br>- Experience with relational databases (e.g., PostgreSQL, MySQL) and NoSQL databases (e.g., MongoDB, Redis)  <br>- Familiarity with cloud platforms (e.g., AWS, Azure, GCP) and containerization technologies (e.g., Docker, Kubernetes)  <br>- Excellent problem-solving skills and the ability to work independently or as part of a team  <br>- Strong communication skills and the ability to collaborate effectively with cross-functional teams</p><h3>Why Candidate should apply this position</h3><p>- Chance to work in an international team and professional working environment  <br>- Training and career development opportunities  <br>- Performance review every 6 months  <br>- Open, supportive, and collaborative culture  <br>- Flexible working hours with 40 hours per week (Monday – Friday)  <br>- Lunch allowance and free drinks (coffee, tea, snacks)  <br>- Premium health insurance package  <br>- Vacation leave up to 22 days per year  <br>- Free English classes for everyone (2 lessons per week)  <br>- Sponsorship for certification fees for each team  <br>- 13 months salary bonus</p>",
    "techStacks": []
  },
  {
    "title": "Data Engineer (Talend) - Remote",
    "company": "Aperia Vietnam",
    "detail_link": "https://aniday.com/en/job/data-engineer-talend-remote-11058",
    "image": "https://static.aniday.com/uploads/images/size70/1a4163f969ed4976894581f38a18e93a_20191021140254.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>At Aperia, we rely on a dynamic team of developers. We’re seeking a Data Engineer (Talend) who possesses strong experience using Talend and is ready to work with new technologies and architectures in a forward-thinking organization that’s always pushing boundaries. <br><br>Core Responsibilities<br>Key Responsibilities:<br>Design, develop, test, and deploy new ETL pipelines or enhancements to existing pipelines using Talend.<br>Perform application software development, which includes new development, maintenance and support of applications and provide production support<br>Translate functional requirements into technical designs<br>Perform end to end automation of ETL process for various datasets that are being ingested into the big data platform<br>Develop and integrate software applications using suitable development methodologies and standards, applying standard architectural patterns, considering critical performance characteristics and security measures<br>Resolve customer complaints with data and respond to suggestions for improvements and enhancements<br>Recommend strategies for technical aspects of projects as well as broad system improvements<br>Ensures adherence to established standards and may consult with senior managers on technology solutions.<br><br>This job description is not intended to be all-inclusive. An employee may also perform other reasonable related business duties as assigned by their immediate supervisor or management. Principals only.</p><h3>Required Skills and Experience</h3><p>5+ years of related IT experience<br>1+ years development experience with Talend Data Integration module<br>1+ years of Experience with Talend Administration Center, Data Quality, API Designer and Services.<br>1+ years of experience with Hadoop, Hive, HDFS and Oracle RDBMS<br>Experience with database schema, object management, data modeling &amp; architecture, and data warehouse design<br>Strong knowledge of Java programming and PL- SQL<br>Experience with API integration (REST)<br>Working knowledge of Unix/Linux and Shell script<br>Working knowledge of source-code control using a tool such as GitLab<br>Experience with CI/CD and DevOps development using secure coding practices<br>Performs additional job duties as required</p><h3>Why Candidate should apply this position</h3><p>Health insurance <br>Dental insurance<br>Paid time off<br>Parental leave<br>Childcare assistance</p>",
    "techStacks": [
      "Enginering",
      "Linux",
      "CI/CD",
      "Hive",
      "REST",
      "SQL",
      "Java",
      "Data Modeling",
      "DevOps",
      "Oracle",
      "GitLab",
      "API",
      "Hadoop",
      "Talend Administration Center",
      "Talend Data Integration",
      "Information Technology",
      "Data Architecture",
      "Unix shell",
      "API",
      "Shell Script"
    ]
  },
  {
    "title": "Senior Full Stack Developer (Java/ReactJS) - Remote",
    "company": "Aperia Vietnam",
    "detail_link": "https://aniday.com/en/job/senior-full-stack-developer-java-reactjs-remote-11057",
    "image": "https://static.aniday.com/uploads/images/size70/1a4163f969ed4976894581f38a18e93a_20191021140254.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>At Aperia, we rely on a dynamic team of developers. We’re seeking a Senior Java Developer (Spring Boot, ReactJS) who is ready to work with new technologies and architectures in a forward-thinking organization that’s always pushing boundaries. <br><br>- Full lifecycle management of middleware (micro) services, including analysis, design, development, testing, and implementation of new features or enhancements.<br>- Ensure middleware modules and services adhere to code quality standards.<br>- Maintain applications free from security vulnerabilities in alignment with the organization's security policies.<br>- Assist in troubleshooting and resolving production issues, providing recommendations for preventive measures.<br>- Incorporate suggestions for improvements and enhancements where applicable.<br>- Assist or lead the development and maintenance of technical documentation, storing it in accessible locations (e.g., Confluence, SharePoint).<br>- Perform other reasonable related business duties as assigned by management or supervisors.</p><h3>Required Skills and Experience</h3><p>- Good English communication in both verbal and written<br>- Minimum 6+ years of Java/J2EE development experience<br>- Experience with Spring, Spring Boot, Spring Cloud, Spring Security, Rest API, and Spring Data<br>- Experience with unit testing framework (JUnit)<br>- Worked on Java build &amp; dependency management using tools like Maven and Nexus<br>- Experience developing Restful services and associated testing using Postman<br>- Experience with React<br>- Knowledge and experience with PCF (Pivotal Cloud Foundry)<br>- Hands-on experience fixing security vulnerabilities and keeping open-source components up to date<br>- Maintain code quality with static code analysis using SonarQube<br>- Good knowledge of Oracle PL-SQL, RabbitMQ, or similar message broker<br>- Working knowledge of code repository and management with tools like GitLab<br>- Working knowledge of Linux and Atlassian tools like Jira and Confluence</p><h3>Why Candidate should apply this position</h3><p>- Health insurance  <br>- Dental insurance  <br>- Paid time off  <br>- Parental leave  <br>- Childcare assistance</p>",
    "techStacks": [
      "Developer",
      "React",
      "Spring",
      "Atlassian Confluence",
      "Linux",
      "GitLab",
      "PCF",
      "RESTful API",
      "Spring Boot",
      "Jira",
      "Java",
      "J2EE",
      "Oracle"
    ]
  },
  {
    "title": "Back End Developer",
    "company": "Uride",
    "detail_link": "https://aniday.com/en/job/back-end-developer-10997",
    "image": "https://static.aniday.com/uploads/images/size70/2d291855e44f4045ba636503f275bd2b_20241009171125.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Company: Uride<br>Website: https://www.uride.co<br>Headquarters: Canada<br><br>At Uride, we’re on a mission to empower underserved communities globally by building a marketplace that connects people in rural areas to essential services, starting with ridesharing. <br>Currently operating in 20 cities across Canada, Uride is the nation’s fastest-growing rideshare company, providing over a million rides annually. As we prepare for international expansion, our vision goes beyond ridesharing—we aim to be the top platform for local entrepreneurs to launch service-based businesses, creating a mutually beneficial ecosystem.<br>Our team is diverse, collaborative, and innovation-driven. We believe in solving challenges together with positivity and integrity, fostering an environment where everyone feels free to be themselves. With a startup mindset, we highly value proactivity and a solutions-oriented approach.<br> If you’re passionate about creating impact, driving change, and seeking continuous growth, you’ll thrive at Uride.<br><br>Position Overview<br>Position: Backend Developer (Node.js)<br>Working Location: Full-time hybrid. The role requires working within the Toronto, Canada time zone and attending the office in Ho Chi Minh City twice a week. <br>Salary range: 2000 - 3000 USD (negotiable, full-time service contract).<br>Requirements: Fluent in English, 2+ YoE in backend or full-stack (Golang, Node.js)<br>Interview process: Screening call with Recruiter &gt; Online initial talk with Uride technology team &gt; Offline interview in HCM with VP of Technology.<br>As the Backend Developer, you’ll play a pivotal role in shaping our platform’s architecture, ensuring smooth server-side development, and managing databases. <br><br>What You’ll Do<br>Collaborate with front-end developers and stakeholders to gather project requirements.<br>Design and develop server-side applications and APIs.<br>Optimize application logic and database queries for performance and scalability.<br>Troubleshoot and resolve backend issues, conducting regular maintenance and updates.<br>Develop and maintain backend components of web applications.<br>Ensure high performance, quality, and responsiveness of applications.<br>Identify and correct bottlenecks, bugs, and system inefficiencies.<br>Maintain code quality and participate in code reviews.<br>Stay current with the latest technology trends and bring innovative solutions to the team.</p><h3>Required Skills and Experience</h3><p>2+ years of backend (or full-stack) development experience, with deep expertise in Golang, Node.js, JavaScript, or TypeScript. Functional programming knowledge is a plus.<br>Familiar with GraphQL, Websockets, Kubernetes, Kafka, ElasticSearch, Kibana, DynamoDB, and PostgreSQL.<br>Strong understanding of distributed systems architecture (e.g., load balancing, data consistency, efficiency).<br>Experienced in designing scalable APIs with a focus on performance and maintainability.<br>Able to identify and resolve performance/scalability issues in systems serving millions of users.<br>Excellent documentation and written communication skills to simplify complex technical ideas.<br>Collaborative and communicative, knowing when to lead and when to step back.<br>Skilled in code reviews, sprint planning, and team discussions (RFCs).<br>High emotional intelligence, great listener, and strong collaborator.<br>Always eager to learn, adapt, and grow.<br>Passionate about solving complex technical problems.</p><h3>Why Candidate should apply this position</h3><p>A remote, international team fluent in Spanish and English.<br>A dynamic environment that encourages learning and growth, with ample opportunities to contribute your ideas.<br>A collaborative team ready to share knowledge and tackle challenges together.<br>Flexibility and autonomy to define your approach with your team.<br>An inclusive, accessible workplace where all employees are valued, respected, and supported. Uride is an equal opportunity employer that welcomes applicants of all backgrounds.</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "English",
      "APIs",
      "Functional Programming",
      "Database",
      "Golang",
      "Node.js",
      "Elastic Search"
    ]
  },
  {
    "title": "Senior Full-Stack Developer (Remote full time) Open for Indo, Malaysia, and Philippines",
    "company": "TD Consulting",
    "detail_link": "https://aniday.com/en/job/senior-full-stack-developer-remote-full-time-open-for-indo-malaysia-and-philippines-10944",
    "image": "https://static.aniday.com/uploads/images/size70/2083cec006f44b629e9924d94fa7d9e6_20241008100024.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>This is a Senior Engineer position with a mission to lead product development. This position is responsible for the growth of the product and the success of the project based on a high level of expertise.<br><br>A wide range of skills are required at a high level, not only in engineering, but also in project management and communication, which will greatly expand your career possibilities!<br><br>Tech-stacks:<br>Programming Languages Used:<br>Mainly Used: TypeScript<br>Others: Python, Dart<br>Frontend: Next.js<br>Backend: Supabase, AWS, GCP</p><h3>Required Skills and Experience</h3><p>More than 4 years experience in React/Next.js using TypeScript<br>More than 4 years experience in server-side development using Node.js<br>Experience in using Supabase/AWS/GCP in projects<br>Has responsibility<br>Has passion for removing unnecessary coding and creating innovation<br>Has honesty and a good heart<br>Has the ability to actively grow and expand their role<br>Has a sincere attitude and can wholeheartedly engage with the product<br>Has the proactiveness to bridge the gap between expectations and reality<br>We would ask for trial work for 1 month which is 100% paid. Let us know about this confirmation.</p><h3>Why Candidate should apply this position</h3><p>Full remote and you can work from all over the world<br>Distributed team<br>Result-oriented environment<br>HQ is in Tokyo but professionals can have great collaboration with all remote conditions</p>",
    "techStacks": [
      "Backend",
      "Developer",
      "NextJS",
      "AWS",
      "Product Management",
      "Python",
      "Dart",
      "GCP",
      "Node.js",
      "TypeScript",
      "React"
    ]
  },
  {
    "title": "Senior Data Engineer",
    "company": "what3words",
    "detail_link": "https://aniday.com/en/job/senior-data-engineer-10892",
    "image": "https://static.aniday.com/uploads/images/size70/ad32446da84c47068219dac84a119a80_20241003072454.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Based in Vietnam out of our centrally located Ho Chi Minh City office, you'll be joining our Data team within our fast-growing tech team. Reporting to the Head of Data &amp; Analytics, the senior data engineer will own the design, building, and maintenance of key parts of the data architecture and will have the opportunity to lead strategic projects that look to deliver value to the business in the future.<br><br>As a Senior Data Engineer, you will have hands-on experience of the different elements of the data engineering process and you will be great at building the business context needed to inform technical decision making.<br>To be the technical leader / decision maker on data architectural tools and technologies<br><br>Ownership of the Data Warehouse from ingestion of data sources to storage and serving<br>Own the ideation and execution of architectural principles, guidelines and technology standards of ETL and data pipelines<br>Work with analytics to ensure the data modeling is suitable for reporting needs<br>Managing our GCP and Airflow instances<br>Working with Analytics, Back-end, Front-end, DevOps &amp; QA engineers to ensure that the data events are well-designed and correctly integrated to the data pipeline services<br>Conducts/leads and implements proof of concepts to demonstrate new technologies in support of architecture vision and guiding principles<br>Collaborate with Data Engineers and Analysts to develop views, sources and aggregations of data<br>Review SQL and Python code from across the Data team to help maintain data and code integrity</p><h3>Required Skills and Experience</h3><p>Undergraduate degree in any quantitative field (physics, data science, computer science, engineering, business science - anything with a maths or analysis focus).<br>5+ years in Data Engineering roles<br>Excellent English communication skills<br>Strong knowledge and experience of ETL and other aspects of data processing pipelines and the data architecture.<br>Strong knowledge and experience of BigQuery, REST APIs, data and model storage formats<br>Strong experience with modular Python and Airflow<br>Experience implementing event streaming with any of the platforms eg Kafka, Kinesis, SQS/SNS<br>Experience building analyst-ready data models. <br>Solid SQL/query optimization skills<br>Unit and integration testing<br>Experience of distributed/automated workflows and technologies (Docker, K8S, Spark)</p><h3>Why Candidate should apply this position</h3><p>Competitive salary<br>Flexible working<br>6 weeks remote working (work from anywhere) policy<br>25 days holiday: plus the option to buy more!<br>Share options<br>Private health insurance<br>Wellbeing Days<br>Generous parental leave policies<br>Family friendly policies<br>Employee Assistance Program (EAP)<br>Lunch &amp; learn sessions<br>Team social budget</p>",
    "techStacks": [
      "Enginering",
      "Backend",
      "Airflow",
      "SQL",
      "Python",
      "Data Modeling",
      "ETL",
      "Data Architecture",
      "Database"
    ]
  },
  {
    "title": "Product Intern/ Frehser",
    "company": "Kegmil",
    "detail_link": "https://aniday.com/en/job/product-intern-frehser-10869",
    "image": "https://static.aniday.com/uploads/images/size70/9fbe2be29a4f4e7097cb2d02b2eef64e_20240819015818.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>About Kegmil<br>Kegmil is a holistic solution provider of mission-critical Enterprise Systems, with a spike in Field Service Management software-as-a-service. We are a global team serving international clients, and strongly backed by Mitsubishi Electric (a world-leading manufacturer of products ranging from home electronics to satellite systems, headquartered in Japan)<br>Our cloud-based, AI-enabled Field Service Management solution is #1 amongst B2B clients in Southeast Asia and is adopted across various industries such as Elevator &amp; Escalator, Data Center, Medical Equipment, Defence &amp; Aerospace, Marine Offshore, etc.<br>Our offerings expand to Enterprise Resource Planning (ERP) systems integration and deployment - including Inventory Management Systems (IMS), HR Information Systems (HRIS), Customer Relationship Management (CRM), Procurement Systems and others<br>We are looking for a dynamic, energetic intern who is eager to learn about our company by assisting various departments. You will be working closely with our team to conduct research, capture data, write documents and attend meetings where you will be asked to take minutes.<br><br>To be successful as an Intern, you should be willing to help with any tasks assigned by a supervisor. You will be involved in upcoming projects as well as assisting with current ones.</p><h3>Required Skills and Experience</h3><p>Responsibilities:<br><br>Fulfilling tasks set out by supervisors from several departments.<br>Attending meetings and taking minutes.<br>Performing research at a supervisor's request.<br>Writing/Updating product documents.<br>Working with engineering to ensure successful delivery of products and solutions on schedule.<br>Troubleshooting data issues, identify and perform corrective actions as required<br>Documenting internal processes as required.<br>Partner with members of product management, engineers and data operations to ensure quality of audience data</p><h3>Why Candidate should apply this position</h3><p>At Kegmil, you’ll lead a team that values innovation and collaboration. We offer competitive salaries, comprehensive benefits, and opportunities for growth and development. Join us to transform and lead the field service industry into a new era.</p>",
    "techStacks": [
      "Market Research",
      "Software Development",
      "Data Analysis",
      "Computer Science"
    ]
  },
  {
    "title": "IIoT Solution Engineer",
    "company": "Yokogawa Vietnam",
    "detail_link": "https://aniday.com/en/job/iiot-solution-engineer-10798",
    "image": "https://static.aniday.com/uploads/images/size70/f5efc51ddbd442d5a9b4fa47fc255741_20240909095538.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>IIoT Solution Engineer is responsible on planning, organize, identify technical risk, pre-sales support to regional sales and project engineering such as solutioning site integration, connectivity on premises data and gateway to the cloud. They are required to have hands-on experience with the OT and IT Data integration<br><br>Responsibilities:<br>   •   Develop IIoT solution material and propose integration recommendation<br>   •   Develop solution for OT/IT data integration. Integration between Edge Gateway and on premises server or Cloud (bi-directional).<br>   •   Conduct evaluation/site survey and testing with users for the data integration and demonstration. This will include site study, front end engineering design, implementation and maintenance/services with the remote support from Product Team<br>   •   Support on technical/solution pre-sales, design innovation and realization plan include coordination with customer<br>   •   Prepare technical presentation for the recommended solution to customer and Yokogawa Business Development Manager</p><h3>Required Skills and Experience</h3><p>5+ years of experience <br>Key focus area:<br>   •   Software as Services<br>   •   IT/OT Integration and IT/IT Integration<br>Essential Skill:<br>   •   Strong Communication and Presentation skill<br>   •   Hands-on complex data integration from various OEM Equipment. This include OT protocol such as serial, ASCII, RS485/RS232, modbus, profibus, telnet, ethernet, TCP/IP, etc…<br>   •   Hands-on with LoraWan, MQTT, REST<br>   •   Networking: L3/L4 OT network structure and connectivity with Cloud including the security measure e.g DMZ, firewall<br>   •   Hands-on OSI PI System, PI Historian, MQTT<br>   •   Familiar with various IoT gateway<br>   •   Hands-on with edge connectivity from OT device to extract the required data to on premises server or cloud. Well verse with edge devices.<br>   •   Hands-on with various sensor connectivity<br>   •   Hands-on with Edge device include data buffering mechanism<br><br>Personal Attributes:<br>   •   Innovative and Creative thinking<br>   •   Effective Communication skill<br>   •   Enjoy with dynamic change</p><h3>Why Candidate should apply this position</h3><p>•\tAttractive compensation package<br>•\t13th month salary warranted<br>•\tRemote working from Vietnam (or hybrid if located in Ho Chi Minh)<br>•\tProvided with laptop and necessary working equipments<br>•\tExposure to international projects and teams<br>•\t2 extra holidays per year<br>•\tAnnual health check</p>",
    "techStacks": [
      "Communications",
      "OEM Sales",
      "IoT"
    ]
  },
  {
    "title": "QC Lead (IoT Platform)",
    "company": "Yokogawa Vietnam",
    "detail_link": "https://aniday.com/en/job/qc-lead-iot-platform-10771",
    "image": "https://static.aniday.com/uploads/images/size70/f5efc51ddbd442d5a9b4fa47fc255741_20240909095538.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>About the role:<br>The QC Lead/QC Manager for our IoT platform will play a pivotal role in ensuring the highest quality standards across all our products and services. As a key leader in the Quality Control team, this person will define, implement, and maintain quality assurance processes in alignment with PMs and POs. The primary objectives for this role include ensuring the consistent quality of IoT products, defining and standardizing quality processes, and managing the QC team.<br><br>Key Responsibilities:<br>Product Quality<br>   • Oversee end-to-end quality testing across company’s projects with focus on IoT platform.<br>   • Study the end to end system and create a comprehensive test scenario from business perspective to prevent reopen bugs on system features<br>   • Conduct root cause analysis for quality issues, implementing corrective actions to prevent recurrence.<br>   • Collaborate with product teams to identify and mitigate quality risks throughout the development lifecycle.<br>Quality Assurance Processes &amp; Performance Monitoring<br>   • Define, implement, and monitor quality control processes for IoT platform development and operations.<br>   • Ensure compliance with industry standards and best practices, aligning quality strategies with business objectives.<br>   • Document and standardize quality control procedures to support onboarding and on-the-job training for new team members.<br>   • Collaborate with external and internal stakeholders to implement automation testing framework.<br>   • Establish metrics and KPIs to measure product quality, efficiency, and continuous improvement.<br>   • Report quality issues and trends to senior management.<br>Team Management<br>   • Lead, mentor, and manage a team of QC engineers.<br>   • Assign tasks, monitor progress, and ensure the team meets quality objectives.<br>   • Ensure team alignment with quality objectives, providing ongoing training and performance evaluations.<br>   • Collaborate cross-functionally with development, operations, and product teams to ensure a holistic approach to quality control.</p><h3>Required Skills and Experience</h3><p>Requirements:<br>   • A Bachelor’s or equivalent degree in Engineering, Computer Science, or a related field.<br>   • 5+ years of experience in quality assurance, with at least 2 years with IoT or technology platforms.<br>   • Solid understanding of IoT platforms and software integration.<br>   • Proficient in quality management systems (QMS), testing tools, and methodologies for software applications.<br>   • Familiarity with automation testing frameworks and tools, as well as manual testing techniques.<br>   • Proven experience of leading, mentoring, and developing a team.<br>   • Good business acumen.<br>   • Ability to manage multiple priorities in a fast-paced, dynamic environment.<br>   • Good command of English<br>   • Good interpersonal skills</p><h3>Why Candidate should apply this position</h3><p>Benefits:<br>   • Attractive compensation package<br>   • 13th month salary warranted<br>   • Remote working from Vietnam (or hybrid if located in Ho Chi Minh)<br>   • Provided with laptop and necessary working equipments<br>   • Exposure to international projects and teams<br>   • 2 extra holidays per year<br>   • Annual health check</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Manual testing",
      "Test Plan Writing",
      "IoT",
      "Automation Tools"
    ]
  },
  {
    "title": "Senior Software Engineer",
    "company": "ELSA SPEAK",
    "detail_link": "https://aniday.com/en/job/senior-software-engineer-10757",
    "image": "https://static.aniday.com/uploads/images/size70/60b015055bd445a899b27490d102f2a1_20190220140506.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>As a Senior Software Engineer, you will play a key role in developing and deploying software that solves critical business needs. You will not only be a skilled developer but also a leader and mentor, guiding your team to deliver high-quality, reliable, and maintainable software. You will have the opportunity to shape the development pipeline, influence technical decisions, and collaborate with stakeholders across the organization.<br><br>Key Responsibilities:<br>Technical Leadership:<br>  - Demonstrate thought leadership by contributing to technical design decisions that span vertically through the team’s ownership.<br>  - Overcome obstacles and setbacks, adapting to ambiguity, and communicating changes to plans effectively and in a timely manner.<br><br>Infrastructure and Operations:<br>  - Keep the CICD pipelines in good health, adjusting them as needed.<br>  - Actively set availability and failure rate goals for services your team owns, and pursue them.<br>  - Identify and influence the resolution of infrastructure issues to maintain a reliable and efficient software environment.<br><br>Team Collaboration and Growth:<br>  - Force multiply for your team by finding ways to enable them to do more each day.<br>  - Foster an environment of knowledge sharing and collaboration within the team.<br>  - Focus on enabling colleagues to solve problems independently rather than providing instant solutions.<br><br>Code and Quality:<br>  - Maintain exemplary code quality.<br>  - Advocate for automating repetitive tasks to reduce errors, save time, and improve efficiency.<br>  - Demonstrate a deep understanding of design patterns and architectural principles.<br><br>Continuous Improvement:<br>  - Stay up-to-date on industry trends and technologies relevant to the team’s work.<br>  - Embrace experimentation and data-driven decision making for continuous improvement.<br><br>Customer Focus:<br>  - Empathize with customer needs and translate them into technical solutions.<br>  - Gather and analyze customer feedback to inform product development and improvement.</p><h3>Required Skills and Experience</h3><p>- Bachelor’s degree in Computer Science, Software Engineering, or related field.<br>- 6+ years of experience in software engineering in a high speed setting using cloud computing<br>- High proficiency in English with ability to discuss technical issues in English<br>- Product mindset with prior experience in large scale and high impact products is required<br>- Experience with AWS and Microservices<br>- Experience with Flutter app development<br>- Strong interpersonal and communication skills, enabling effective collaboration and stakeholder engagement.<br>- Data-driven mindset with the ability to leverage data for strategic decision-making.<br>- In-depth understanding of software development best practices, methodologies, and SDLC in a high-speed setting using cloud computing.<br>- Strong problem-solving abilities and a commitment to delivering high-quality solutions.<br>- Proficiency in technical decision-making and trade-offs, considering both short-term and long-term impacts.<br>- Demonstrated ability to mentor and develop team members.</p><h3>Why Candidate should apply this position</h3><p>- Working time: Mon-Fri (9am – 6pm), flexible working hour, hybrid working<br>- Up to 16 days Annual leave, 1 Birthday leave, 1 Christmas leave<br>- Premium health insurance for you and family member (after 2 years of working) and annual health check-up to keep you in top shape<br>- Full social insurance<br>- Free ELSA Premium courses to polish your language skills<br>- Macbook Pro provided<br>- Stock options and performance bonus<br>- Sponsorship for online or external courses – learn and grow on us!<br>- Annual company trips and monthly happy hours – work hard, play hard!</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Enginering"
    ]
  }
]