[
  {
    "title": "Data Scientist (Full-time remote)",
    "company": "SensorFlow",
    "detail_link": "https://aniday.com/en/job/data-scientist-full-time-remote-11792",
    "image": "https://static.aniday.com/uploads/images/size70/883ddd4bf1db430bbba26a09013cba64_20230928092614.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>SensorFlow is a leader in IoT-driven energy management, committed to helping buildings achieve sustainable energy savings. We’re seeking a Senior Data Scientist who combines strong technical ability with exceptional communication skills. In this role, you will not only analyze complex data and build predictive models but also transform technical findings into insights that are easily understood by customers and non-technical teams like Customer Success. This position is ideal for a data scientist who enjoys translating technical concepts into clear, actionable insights for diverse audiences.<br><br>Responsibilities:<br>- Develop, analyze, and interpret data models that help measure and forecast energy savings for clients, focusing on results that are clear and actionable for a wide audience.<br>- Work closely with the Customer Success and Operations teams to ensure data insights are presented in a customer-friendly format, facilitating understanding and engagement.<br>- Communicate complex analytical findings to non-technical stakeholders, creating visualizations, reports, and presentations that simplify technical information for end-users.<br>- Collaborate with cross-functional teams (e.g., Product, Engineering, Operations) to deliver insights aligned with business needs, keeping customer experience at the forefront.<br>- Partner with the data science and data engineering teams to ensure the accuracy, scalability, and usability of data models and reporting tools.<br>- Continuously research and apply industry best practices and emerging technologies to improve data interpretation and presentation methods.</p><h3>Required Skills and Experience</h3><p>- Master’s or PhD in a relevant field such as Data Science, Applied Mathematics, Statistics, Computer Science, or a related field.<br>- 5+ years of hands-on experience in data science, with a strong foundation in machine learning, statistical analysis, and data visualization.<br>- Background in energy management or building automation<br>- Proven ability to produce customer-centric reports and presentations, with experience tailoring insights for non-technical audiences.<br>- Expertise in Python and SQL, with proficiency in data visualization tools (e.g., Tableau, Looker).<br>- Experience working with time-series data and building predictive models focused on energy consumption, occupancy, and other building performance metrics.<br>- Strong collaboration skills, with experience working closely with cross-functional teams to translate data insights into business actions.<br>- Exceptional written and verbal communication skills, with the ability to clearly explain complex data processes and findings.</p><h3>Why Candidate should apply this position</h3><p>At SensorFlow, we’re made up of dreamers, achievers, and visionaries whose passion and belief in a greater cause drive us to do more and push the boundaries of innovation every day. If you want to work with fun-loving and diverse personalities in an environment that prioritizes your learning, development, and autonomy, then SensorFlow is the perfect place for you. We also have amazing benefits that include a generous annual leaves, medical coverage, birthday leave, fitness benefits, and Flexi benefits.<br>*Total compensation package will include fixed salary + incentive (according to company's performance)</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Data Analyst",
      "Enginering",
      "Data Science"
    ]
  },
  {
    "title": "Data Engineer (Full-time remote)",
    "company": "SensorFlow",
    "detail_link": "https://aniday.com/en/job/data-engineer-full-time-remote-11791",
    "image": "https://static.aniday.com/uploads/images/size70/883ddd4bf1db430bbba26a09013cba64_20230928092614.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>SensorFlow is leading the charge in smart building automation, using IoT solutions to optimize energy usage and building efficiency. As we grow, we’re seeking a Data Engineer to elevate our data infrastructure, building scalable pipelines for real-time and historical data analytics. This role works closely with the CTO and cross-functional teams across Product, Engineering, and Operations to enable data-driven insights for sustainability and operational efficiency.<br><br>Responsibilities:<br>- Design, build, and maintain scalable data pipelines for real-time and historical data processing.<br>- Set up and optimize databases, data warehouses, and ETL processes to manage large-scale time-series data from sensors (energy consumption, temperature, humidity, occupancy) and external sources (weather, utility data).<br>- Experience in handling and processing large data input volumes (1000s of rows per second)<br>- Collaborate across Product, Customer Success, Installation, and Tech Support to align data architecture with business needs and ensure data quality.<br>- Implement monitoring and logging systems to ensure pipeline reliability and quickly troubleshoot issues.<br>- Work with data scientists to streamline data access, facilitate experimentation, and support predictive model deployment.</p><h3>Required Skills and Experience</h3><p>- Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field.<br>- 5+ years of experience as a Data Engineer, with a proven track record in building and scaling data infrastructure.<br>- Fluent English<br>- Experience managing time-series data is a must.<br>- Expert knowledge in SQL (Postgres), PL/pgSQL, DBT.<br>- Ability to read and optimize query plans<br>- Strong skills in data pipeline and ETL design, with experience in tools like Metaflow, Airflow, and TimescaleDB.<br>- Proficiency in Python, and familiarity with data manipulation frameworks.<br>- Familiarity with data warehousing principles<br>- Strong problem-solving skills and a proactive, fast-learning mindset.</p><h3>Why Candidate should apply this position</h3><p>At SensorFlow, we’re made up of dreamers, achievers, and visionaries whose passion and belief in a greater cause drive us to do more and push the boundaries of innovation every day. If you want to work with fun-loving and diverse personalities in an environment that prioritizes your learning, development, and autonomy, then SensorFlow is the perfect place for you. We also have amazing benefits that include a generous annual leaves, medical coverage, birthday leave, fitness benefits, and Flexi benefits.<br>*Total compensation package will include fixed salary + incentive (according to company's performance)</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Data Analyst",
      "Enginering",
      "SQL",
      "ETL",
      "Data Processing"
    ]
  },
  {
    "title": "DevOps Engineer (Full-time remote)",
    "company": "SensorFlow",
    "detail_link": "https://aniday.com/en/job/devops-engineer-full-time-remote-11789",
    "image": "https://static.aniday.com/uploads/images/size70/883ddd4bf1db430bbba26a09013cba64_20230928092614.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>SensorFlow is at the forefront of IoT-driven building automation, optimizing energy usage across a global fleet of sensors and gateways.<br><br>We’re seeking a DevOps Engineer with expertise in monitoring, logging, and observability to ensure our cloud infrastructure and worldwide fleet operate with high reliability. In this role, you’ll set up and maintain the infrastructure needed to proactively catch and resolve issues, enabling quick response and maintaining uptime across all our services and devices.<br><br>Responsibilities:<br>- Design, implement, and manage monitoring, logging, and observability systems to ensure high uptime for our cloud infrastructure and global fleet of IoT devices.<br>- Set up automatic alerting systems to notify the tech support and customer success teams of issues requiring action, focusing on minimizing downtime and optimizing fleet performance.<br>- Collaborate with engineering and support teams to troubleshoot sensor and gateway issues, lead incident response, and drive post-incident analysis to prevent recurrences.<br>- Monitor network health and uptime across all deployed gateways and sensors to ensure consistent performance for customers worldwide.<br>- Extend and enhance existing monitoring and observability tools (currently using New Relic and Grafana) with additional tools like ELK, Prometheus, or Datadog, as needed, to improve visibility and response times.<br>- Develop and maintain documentation for monitoring and incident management processes.</p><h3>Required Skills and Experience</h3><p>- Bachelor’s degree in Computer Science, Engineering, or a related field.<br>- 5+ years of experience in DevOps, with a focus on monitoring, logging, and observability.<br>- Fluent English<br>- Proficiency with monitoring tools such as New Relic, Grafana, ELK, Prometheus, and Datadog.<br>- Strong understanding of cloud infrastructure and experience setting up and managing alerting and logging systems.<br>- Hands-on experience with incident management, including setting up automated alerts and troubleshooting network and device issues.<br>- Excellent collaboration skills, with the ability to work cross-functionally with engineering, tech support, and customer success teams.<br>- Strong problem-solving skills and a proactive, detail-oriented mindset.</p><h3>Why Candidate should apply this position</h3><p>At SensorFlow, we’re made up of dreamers, achievers, and visionaries whose passion and belief in a greater cause drive us to do more and push the boundaries of innovation every day. If you want to work with fun-loving and diverse personalities in an environment that prioritizes your learning, development, and autonomy, then SensorFlow is the perfect place for you. We also have amazing benefits that include a generous annual leaves, medical coverage, birthday leave, fitness benefits, and Flexi benefits.<br>*Total compensation package will include fixed salary + incentive (according to company's performance)</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "DevOps",
      "ELK Stack",
      "Grafana",
      "IoT",
      "DevOps",
      "New Relic"
    ]
  },
  {
    "title": "Senior Firmware Engineer (Full-time remote)",
    "company": "SensorFlow",
    "detail_link": "https://aniday.com/en/job/senior-firmware-engineer-full-time-remote-11788",
    "image": "https://static.aniday.com/uploads/images/size70/883ddd4bf1db430bbba26a09013cba64_20230928092614.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>About us:<br>SensorFlow makes smart buildings a reality, we are on a mission to retrofit every building to automate decision making and get actionable insights from data, starting with hotels. SensorFlow has helped brands like Accor and RedDoorz save up to 30% on their energy costs while improving their operational productivity through actionable insights from real time data. We are currently in 7 markets across South East Asia and expanding rapidly.<br><br>Job Responsibilities<br>- To design, develop, maintain our IOT product suite in partnership with the team lead.<br>- Drive architectural decisions across various aspects of the system including firmware design in edge nodes, gateway, communication and data flow between edge nodes to gateway and gateway to cloud.<br>- Programming ARM based Microcontrollers and Edge Gateways<br>- Evaluate technical risks and provide necessary resolution<br>- Investigate firmware related incidents and mitigate them<br>- Create and maintain software documentation<br>- Take ownership, there are lots of opportunities to take up an existing or new section of the product and make it your own<br>- Monitor and analyze the fleet performance in production to detect issues, suggest improvements and make recommendations.</p><h3>Required Skills and Experience</h3><p>- Fluent English<br>- 5+ years of experience in developing real time embedded software in RTOS environment (preferably FreeRTOS)<br>- Experience in developing for and managing a medium to large scale fleet of IoT devices in production.<br>- Good understanding of wireless networking principles and end-to-end IOT architecture<br>- Experience engaging with senior stakeholders<br>- Solid experience in the C programming language. <br>- Experience in device protocols like I2C, SPI, UART and communication protocols (LORA,Zibgee)<br>- Experience in unit test framework such as Ceedling, JUnit .<br>- Good understanding of SDLC (Agile) and basic electronics hardware <br>- Familiar with embedded development tools (emulators, debuggers, analysers, oscilloscopes, etc) <br>- You know how to use CI/CD processes to deploy into production<br>- You know  how to use GIT for version control</p><h3>Why Candidate should apply this position</h3><p>At SensorFlow, we’re made up of dreamers, achievers, and visionaries whose passion and belief in a greater cause drive us to do more and push the boundaries of innovation every day. If you want to work with fun-loving and diverse personalities in an environment that prioritizes your learning, development, and autonomy, then SensorFlow is the perfect place for you. We also have amazing benefits that include a generous annual leaves, medical coverage, birthday leave, fitness benefits, and Flexi benefits.<br><br>*Total compensation package will include fixed salary + incentive (according to company's performance)</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Enginering",
      "Firmware",
      "C Programming",
      "IoT",
      "Real-time Operating System"
    ]
  },
  {
    "title": "Senior QC Engineer",
    "company": "Kegmil",
    "detail_link": "https://aniday.com/en/job/senior-qc-engineer-11639",
    "image": "https://static.aniday.com/uploads/images/size70/9fbe2be29a4f4e7097cb2d02b2eef64e_20240819015818.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>About us<br>Kegmil is a holistic solution provider of mission-critical Enterprise Systems, with a spike in Field Service Management software-as-a-service. We are a global team serving international clients, and strongly backed by Mitsubishi Electric (world-leading manufacturer of products ranging from home electronics to satellite systems, headquartered in Japan)<br>Our cloud-based, AI-enabled Field Service Management solution is #1 amongst B2B clients in Southeast Asia and is adopted across various industries such as Elevator &amp; Escalator, Data Center, Medical Equipment, Defence &amp; Aerospace, Marine Offshore, etc.<br>Our offerings expand to Enterprise Resource Planning (ERP) systems integration and deployment - including Inventory Management Systems (IMS), HR Information Systems (HRIS), Customer Relationship Management (CRM), Procurement Systems and others<br><br>Job Description:<br>Kegmil is in search of a QC Engineer with 5 years of experience, adept at both manual and automated testing, and possessing a positive attitude with a willingness to learn. As a valued member of the product-core development team, your role will involve contributing your insights and efforts to ensure the successful launch of our product, meeting and exceeding clients' expectations.<br><br>Responsibilities<br>Review requirements, specifications, and technical design documents to provide timely and insightful feedback.<br>Create detailed, comprehensive, and well-structured test cases.<br>Estimate and prioritize testing activities effectively.<br>Identify, record, meticulously document, and track bugs.<br>Conduct thorough regression testing once bugs are resolved.<br>Collaborate with internal teams, including developers and product managers, to identify system requirements and address issues.<br>Design, develop, and execute automation scripts using open-source tools (experience in this area is a plus).</p><h3>Required Skills and Experience</h3><p>Requirements<br><br>Demonstrated work experience in software quality assurance (minimum of 5 YOE).<br>Profound knowledge of software QA methodologies, tools, and processes.<br>Proven ability to craft clear, concise, and comprehensive test cases.<br>Experience with Test Management and Bug Tracking tools.<br>Hands-on experience with both white box and black box testing.<br>Familiarity with Agile/Scrum development processes.<br>Ability to work independently or collaboratively with other QC team members.<br>Strong problem-solving and decision-making skills.<br>Proficiency in using automated testing tools (experience in this area is a plus).<br>Exposure to performance and/or security testing (experience in these areas is a plus)<br>Able to work independently and ability to control quality in a development group<br>Product mindset</p><h3>Why Candidate should apply this position</h3><p>Collaborate with seasoned and highly skilled technical experts, including software architects with over a decade of experience.<br>Benefit from a flexible work schedule tailored to your needs.<br>Experience a friendly and dynamic workplace environment.<br>Access annual health check-ups and premium healthcare coverage.<br>Receive annual salary reviews based on your demonstrated abilities and contributions.</p>",
    "techStacks": [
      "Manual testing",
      "Test Plan Writing",
      "Test Automation",
      "Test Strategy Writing"
    ]
  },
  {
    "title": "Quality Control Fresher/ Junior",
    "company": "Kegmil",
    "detail_link": "https://aniday.com/en/job/quality-control-fresher-junior-11638",
    "image": "https://static.aniday.com/uploads/images/size70/9fbe2be29a4f4e7097cb2d02b2eef64e_20240819015818.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>About Kegmil: Kegmil is a holistic solution provider of mission-critical Enterprise Systems, with a spike in Field Service Management software-as-a-service. We are a global team serving international clients, and strongly backed by Mitsubishi Electric (a world-leading manufacturer of products ranging from home electronics to satellite systems, headquartered in Japan)<br>Our cloud-based, AI-enabled Field Service Management solution is #1 amongst B2B clients in Southeast Asia and is adopted across various industries such as Elevator &amp; Escalator, Data Center, Medical Equipment, Defence &amp; Aerospace, Marine Offshore, etc. Our offerings expand to Enterprise Resource Planning (ERP) systems integration and deployment - including Inventory Management Systems (IMS), HR Information Systems (HRIS), Customer Relationship Management (CRM), Procurement Systems and others<br><br>Location: HCMC or Remote<br>Job Type: Full-time<br>Responsibilities:<br><br>Develop, maintain and execute test cases.<br>Help design and create test scripts using JavaScript, Selenium.<br>Create detailed, comprehensive, and well-structured test cases.<br>Identify, record, meticulously document, and track bugs.<br>Collaborate with internal teams, including developers, product owners, and business stakeholders, to identify system requirements and address issues.</p><h3>Required Skills and Experience</h3><p>Requirements:<br>A final year student or recent graduate majoring in Computer Science, Information Technology, or a related field.<br>Understanding or knowledge of testing technologies (e.g. Selenium, TestNG, JUnit).<br>Willingness to learn and adapt to new technologies.<br>Experience with performance testing tools.<br>Excellent verbal and written communication skills.<br>Excellent problem-solving and analytical skills.<br>Cope well under pressure.</p><h3>Why Candidate should apply this position</h3><p>What We Offer:<br>Competitive salary and comprehensive benefits package.<br>Dynamic and innovative work environment with opportunities for personal and professional growth.<br>Access to cutting-edge tools and technologies.</p>",
    "techStacks": [
      "Selenium",
      "Logical Thinking",
      "Testing / QA"
    ]
  },
  {
    "title": "Full Stack Web Developer",
    "company": "VSee Health",
    "detail_link": "https://aniday.com/en/job/full-stack-web-developer-11569",
    "image": "https://static.aniday.com/uploads/images/size70/2d48925905f642af825022fceadec48b_20241127083307.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>We're in search of a seasoned Senior Full Stack Developer who excels in both frontend development using ReactJS and backend development with PHP.<br><br>In this role, you'll be pivotal in shaping and enhancing our VSee Clinic Platform, taking charge of its design, development, and upkeep. Working hand in hand with our frontend developers, product managers, and various stakeholders, you'll craft bespoke software solutions that align precisely with our operational requirements.<br><br>RESPONSIBILITIES<br>- Collaborate with cross-functional teams to design, develop, and deploy scalable web applications.<br>- Led the front-end development efforts, focusing strongly on ReactJS to create responsive, intuitive user interfaces.<br>- Design and implement backend solutions using PHP to ensure the performance, reliability, and security of our applications.<br>- Develop RESTful APIs and integrate third-party services as needed.<br>- Work closely with DevOps engineers to deploy and maintain microservices on EKS.<br>- Stay up-to-date with the latest technologies and best practices in web development.</p><h3>Required Skills and Experience</h3><p>- Bachelor's degree in Computer Science, Engineering, or a related field.<br>- 8+ years of experience in full-stack web development, with a focus on ReactJS for frontend and PHP for backend.<br>- Solid understanding of JavaScript, HTML, CSS, and related web technologies.<br>- Experience with modern frontend frameworks/libraries such as Redux, Vue.js, or AngularJS is a plus.<br>- Proficiency in PHP frameworks such as Laravel or Symfony.<br>- Experience with containerization and orchestration tools like Docker and Kubernetes.<br>- Strong knowledge of RESTful API design and implementation.<br>- Familiarity with cloud services, particularly AWS, is preferred.<br>- Excellent problem-solving skills and attention to detail.<br>- Strong communication and collaboration skills.<br>- Strong \"get things done\" work ethic. <br>- English: Good communication. <br><br>Note:<br>This role may involve accessing Protected Health Information (PHI) as defined by the Health Insurance Portability and Accountability Act (HIPAA). Security awareness training and compliance with strict security policies are required.</p><h3>Why Candidate should apply this position</h3><p>- Remote full-time<br>- Performance bonus.<br>- Working time: Mon - Fri<br>- Global and collaborative working environment<br>- Flexibility in your time management<br>- 12 days off allowance per year (not including Vietnam national holiday)<br>- Health insurance <br>- A chance to improve yourself in tech and business<br>- Room to grow professionally, sponsorship for learning &amp; development of related skills</p>",
    "techStacks": [
      "PHP",
      "ReactJS"
    ]
  },
  {
    "title": "Software Developer (Full Stack)",
    "company": "Anonymous",
    "detail_link": null,
    "description": "No detail link provided",
    "techStacks": "No detail link provided"
  },
  {
    "title": "Senior Oracle EBS",
    "company": "HIPTECH SOLUTION",
    "detail_link": "https://aniday.com/en/job/senior-oracle-ebs-11244",
    "image": "https://static.aniday.com/uploads/images/size70/088c57e996614a57ae1b993a1e058352_20241028024223.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Our customer is a big computer peripheral manufacturer in the US. They have B2B and B2C business with clients all over the world with their factories in US, China, Taiwan and their warehouses in US, UK, China and Taiwan.<br>We are looking for senior Oracle EBS engineers/consultant to join the team for long-term jobs working on our customer Oracle EBS (12.2) system.<br><br>Job Responsibilities: <br> Perform the work of a Senior Oracle EBS with 80% on technical development and 20% on consulting and support.<br> Join project development to expand Oracle EBS operation by integrating with other systems via EDI / API or add new/customize existing business logic for OM, INV, PO, WIP modules.<br> Monitor and resolve operation issues related to orders, shipment, invoice, MES orders, working directly with business users.<br> Implement the integration with 3PL warehouses.<br> Collaborate with customer’s VN, US and Taiwan team for requirement clarification, technical design and discussion.<br> Create technical design documentation, test cases, perform unit testing and support end-to-end testing.</p><h3>Required Skills and Experience</h3><p> At least 5 years of experience working with Oracle EBS.<br> Strong in technical using PL/SQL to create package, procedure, trigger interact with EBS standard APIs.<br> Having business knowledge of modules OM, INV, PO, WIP.<br> Familiar with Oracle Form and can customize Oracle Form.<br> Strong in debugging, error handling and performance optimization.<br> Good at English Communication.</p><h3>Why Candidate should apply this position</h3><p> Be able to work on projects for worldwide customer with complicated business models.<br> Work with Oracle EBS experts from both company and customer sides.<br> Competitive salary package based on your competence plus Annual Bonus and Project Performance Bonus.<br> “HIPTECH care” health insurance which is exclusive for HIPTECH employees.<br> 18 Leave days (12 Annual leave, 6 Sick Leave).<br> Annual health check-up.<br> 13th-month Salary.</p>",
    "techStacks": [
      "Backend",
      "APIs",
      "Debugging",
      "SQL",
      "Oracle"
    ]
  },
  {
    "title": "Senior iOS Native Engineer (Swift)",
    "company": "Reeracoen Vietnam",
    "detail_link": "https://aniday.com/en/job/senior-ios-native-engineer-swift-11130",
    "image": "https://static.aniday.com/uploads/images/size70/41efcae289ef4498960059274d8fa8ac_20241018023032.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>【Job Summary】<br>- Responsible for developing the application in cooperation with the product manager. Working in the form of Squad, a small team can quickly and consistently engage in everything from design to development, testing, and operation.<br><br>【Main responsibilities】<br>1. Job Scope<br>- Development of applications using Swift<br>- API design/implementation linked with the backend<br>- Propose and implement new features and improvements<br>- Team development in collaboration with project managers, designers, and QA<br>- Refactoring of existing applications, enhancements Cost reduction of regression testing by implementing appropriate test code<br>- Continuously learn about technical trends and industry best practices and apply them to the product<br><br>Note: The assigned product will be determined based on the candidate's skills and preferences, as well as the internal structure of the company.</p><h3>Required Skills and Experience</h3><p>- University graduate in the related majors<br>- 6+ years of experience in developing native applications for iOS using Swift<br>- Experience as a technical lead throughout the full project development lifecycle<br>- Experience in developing and operating native applications linked to Web applications<br>- Experience in developing functions with writing unit tests<br>- Experience in architecture design and framework selection based on application requirements<br>- Creating high-quality code for security, performance, scalability, etc.<br>- Skills in code review, bug analysis, error troubleshooting<br>- Understanding of the software development lifecycle<br>- Knowledge of Web application security<br>- Programming, debugging, and testing skills<br>- Ability to deliver high-performance and scalable solutions<br>- Experience working in a team development environment.<br>- Good at English communication (Intermediate)</p><h3>Why Candidate should apply this position</h3><p>- Good benefits package (Flexible working time, Insurance in full gross salary, Attractive salary, Macbook Pro, monitors,...)<br>- 12 days annual leaves, + New Year holiday according to the Japanese calendar<br>- Good career advancement opportunities</p>",
    "techStacks": []
  },
  {
    "title": "Back End Developer",
    "company": "Uride",
    "detail_link": "https://aniday.com/en/job/back-end-developer-10997",
    "image": "https://static.aniday.com/uploads/images/size70/2d291855e44f4045ba636503f275bd2b_20241009171125.webp",
    "description": "<h3>Job Overview And Responsibility</h3><p>Company: Uride<br>Website: https://www.uride.co<br>Headquarters: Canada<br><br>At Uride, we’re on a mission to empower underserved communities globally by building a marketplace that connects people in rural areas to essential services, starting with ridesharing. <br>Currently operating in 20 cities across Canada, Uride is the nation’s fastest-growing rideshare company, providing over a million rides annually. As we prepare for international expansion, our vision goes beyond ridesharing—we aim to be the top platform for local entrepreneurs to launch service-based businesses, creating a mutually beneficial ecosystem.<br>Our team is diverse, collaborative, and innovation-driven. We believe in solving challenges together with positivity and integrity, fostering an environment where everyone feels free to be themselves. With a startup mindset, we highly value proactivity and a solutions-oriented approach.<br> If you’re passionate about creating impact, driving change, and seeking continuous growth, you’ll thrive at Uride.<br><br>Position Overview<br>Position: Backend Developer (Node.js)<br>Working Location: Full-time hybrid. The role requires working within the Toronto, Canada time zone and attending the office in Ho Chi Minh City twice a week. <br>Salary range: 2000 - 3000 USD (negotiable, full-time service contract).<br>Requirements: Fluent in English, 2+ YoE in backend or full-stack (Golang, Node.js)<br>Interview process: Screening call with Recruiter &gt; Online initial talk with Uride technology team &gt; Offline interview in HCM with VP of Technology.<br>As the Backend Developer, you’ll play a pivotal role in shaping our platform’s architecture, ensuring smooth server-side development, and managing databases. <br><br>What You’ll Do<br>Collaborate with front-end developers and stakeholders to gather project requirements.<br>Design and develop server-side applications and APIs.<br>Optimize application logic and database queries for performance and scalability.<br>Troubleshoot and resolve backend issues, conducting regular maintenance and updates.<br>Develop and maintain backend components of web applications.<br>Ensure high performance, quality, and responsiveness of applications.<br>Identify and correct bottlenecks, bugs, and system inefficiencies.<br>Maintain code quality and participate in code reviews.<br>Stay current with the latest technology trends and bring innovative solutions to the team.</p><h3>Required Skills and Experience</h3><p>2+ years of backend (or full-stack) development experience, with deep expertise in Golang, Node.js, JavaScript, or TypeScript. Functional programming knowledge is a plus.<br>Familiar with GraphQL, Websockets, Kubernetes, Kafka, ElasticSearch, Kibana, DynamoDB, and PostgreSQL.<br>Strong understanding of distributed systems architecture (e.g., load balancing, data consistency, efficiency).<br>Experienced in designing scalable APIs with a focus on performance and maintainability.<br>Able to identify and resolve performance/scalability issues in systems serving millions of users.<br>Excellent documentation and written communication skills to simplify complex technical ideas.<br>Collaborative and communicative, knowing when to lead and when to step back.<br>Skilled in code reviews, sprint planning, and team discussions (RFCs).<br>High emotional intelligence, great listener, and strong collaborator.<br>Always eager to learn, adapt, and grow.<br>Passionate about solving complex technical problems.</p><h3>Why Candidate should apply this position</h3><p>A remote, international team fluent in Spanish and English.<br>A dynamic environment that encourages learning and growth, with ample opportunities to contribute your ideas.<br>A collaborative team ready to share knowledge and tackle challenges together.<br>Flexibility and autonomy to define your approach with your team.<br>An inclusive, accessible workplace where all employees are valued, respected, and supported. Uride is an equal opportunity employer that welcomes applicants of all backgrounds.</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Node.js",
      "Golang",
      "Database",
      "Functional Programming",
      "APIs",
      "English",
      "Elastic Search"
    ]
  },
  {
    "title": "IIoT Solution Engineer",
    "company": "Yokogawa Vietnam",
    "detail_link": "https://aniday.com/en/job/iiot-solution-engineer-10798",
    "image": "https://static.aniday.com/uploads/images/size70/f5efc51ddbd442d5a9b4fa47fc255741_20240909095538.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>IIoT Solution Engineer is responsible on planning, organize, identify technical risk, pre-sales support to regional sales and project engineering such as solutioning site integration, connectivity on premises data and gateway to the cloud. They are required to have hands-on experience with the OT and IT Data integration<br><br>Responsibilities:<br>   •   Develop IIoT solution material and propose integration recommendation<br>   •   Develop solution for OT/IT data integration. Integration between Edge Gateway and on premises server or Cloud (bi-directional).<br>   •   Conduct evaluation/site survey and testing with users for the data integration and demonstration. This will include site study, front end engineering design, implementation and maintenance/services with the remote support from Product Team<br>   •   Support on technical/solution pre-sales, design innovation and realization plan include coordination with customer<br>   •   Prepare technical presentation for the recommended solution to customer and Yokogawa Business Development Manager</p><h3>Required Skills and Experience</h3><p>5+ years of experience <br>Key focus area:<br>   •   Software as Services<br>   •   IT/OT Integration and IT/IT Integration<br>Essential Skill:<br>   •   Strong Communication and Presentation skill<br>   •   Hands-on complex data integration from various OEM Equipment. This include OT protocol such as serial, ASCII, RS485/RS232, modbus, profibus, telnet, ethernet, TCP/IP, etc…<br>   •   Hands-on with LoraWan, MQTT, REST<br>   •   Networking: L3/L4 OT network structure and connectivity with Cloud including the security measure e.g DMZ, firewall<br>   •   Hands-on OSI PI System, PI Historian, MQTT<br>   •   Familiar with various IoT gateway<br>   •   Hands-on with edge connectivity from OT device to extract the required data to on premises server or cloud. Well verse with edge devices.<br>   •   Hands-on with various sensor connectivity<br>   •   Hands-on with Edge device include data buffering mechanism<br><br>Personal Attributes:<br>   •   Innovative and Creative thinking<br>   •   Effective Communication skill<br>   •   Enjoy with dynamic change</p><h3>Why Candidate should apply this position</h3><p>•\tAttractive compensation package<br>•\t13th month salary warranted<br>•\tRemote working from Vietnam (or hybrid if located in Ho Chi Minh)<br>•\tProvided with laptop and necessary working equipments<br>•\tExposure to international projects and teams<br>•\t2 extra holidays per year<br>•\tAnnual health check</p>",
    "techStacks": [
      "Communications",
      "OEM Sales",
      "IoT"
    ]
  },
  {
    "title": "Senior Software Engineer",
    "company": "ELSA SPEAK",
    "detail_link": "https://aniday.com/en/job/senior-software-engineer-10757",
    "image": "https://static.aniday.com/uploads/images/size70/60b015055bd445a899b27490d102f2a1_20190220140506.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>As a Senior Software Engineer, you will play a key role in developing and deploying software that solves critical business needs. You will not only be a skilled developer but also a leader and mentor, guiding your team to deliver high-quality, reliable, and maintainable software. You will have the opportunity to shape the development pipeline, influence technical decisions, and collaborate with stakeholders across the organization.<br><br>Key Responsibilities:<br>Technical Leadership:<br>  - Demonstrate thought leadership by contributing to technical design decisions that span vertically through the team’s ownership.<br>  - Overcome obstacles and setbacks, adapting to ambiguity, and communicating changes to plans effectively and in a timely manner.<br><br>Infrastructure and Operations:<br>  - Keep the CICD pipelines in good health, adjusting them as needed.<br>  - Actively set availability and failure rate goals for services your team owns, and pursue them.<br>  - Identify and influence the resolution of infrastructure issues to maintain a reliable and efficient software environment.<br><br>Team Collaboration and Growth:<br>  - Force multiply for your team by finding ways to enable them to do more each day.<br>  - Foster an environment of knowledge sharing and collaboration within the team.<br>  - Focus on enabling colleagues to solve problems independently rather than providing instant solutions.<br><br>Code and Quality:<br>  - Maintain exemplary code quality.<br>  - Advocate for automating repetitive tasks to reduce errors, save time, and improve efficiency.<br>  - Demonstrate a deep understanding of design patterns and architectural principles.<br><br>Continuous Improvement:<br>  - Stay up-to-date on industry trends and technologies relevant to the team’s work.<br>  - Embrace experimentation and data-driven decision making for continuous improvement.<br><br>Customer Focus:<br>  - Empathize with customer needs and translate them into technical solutions.<br>  - Gather and analyze customer feedback to inform product development and improvement.</p><h3>Required Skills and Experience</h3><p>- Bachelor’s degree in Computer Science, Software Engineering, or related field.<br>- 6+ years of experience in software engineering in a high speed setting using cloud computing<br>- High proficiency in English with ability to discuss technical issues in English<br>- Product mindset with prior experience in large scale and high impact products is required<br>- Experience with AWS and Microservices<br>- Experience with Flutter app development<br>- Strong interpersonal and communication skills, enabling effective collaboration and stakeholder engagement.<br>- Data-driven mindset with the ability to leverage data for strategic decision-making.<br>- In-depth understanding of software development best practices, methodologies, and SDLC in a high-speed setting using cloud computing.<br>- Strong problem-solving abilities and a commitment to delivering high-quality solutions.<br>- Proficiency in technical decision-making and trade-offs, considering both short-term and long-term impacts.<br>- Demonstrated ability to mentor and develop team members.</p><h3>Why Candidate should apply this position</h3><p>- Working time: Mon-Fri (9am – 6pm), flexible working hour, hybrid working<br>- Up to 16 days Annual leave, 1 Birthday leave, 1 Christmas leave<br>- Premium health insurance for you and family member (after 2 years of working) and annual health check-up to keep you in top shape<br>- Full social insurance<br>- Free ELSA Premium courses to polish your language skills<br>- Macbook Pro provided<br>- Stock options and performance bonus<br>- Sponsorship for online or external courses – learn and grow on us!<br>- Annual company trips and monthly happy hours – work hard, play hard!</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Enginering"
    ]
  },
  {
    "title": "Automation engineer",
    "company": "Aniday",
    "detail_link": "https://aniday.com/en/job/automation-engineer-10711",
    "image": "https://static.aniday.com/uploads/images/size70/187358e1468a4a92af8a6b438fc598eb_20240307084806.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>The Workflow Automation engineer will be responsible for integrating multiple platforms such as Discord, Telegram, Google Sheets, Google Docs, and email alerts. This role will focus on streamlining and automating our internal workflow as well as optimizing processes involving our users and customers. The ideal candidate will have a strong technical background and excellent problem-solving skills.<br><br>Key Responsibilities:<br>- Platform Integration: Seamlessly integrate multiple platforms (e.g., Discord, Telegram, Google Sheets, Google Docs) to ensure smooth data flow and communication.<br>- Automation Development: Design, implement, and maintain automated workflows to enhance operational efficiency.<br>- User and Customer Processes: Develop automation solutions to improve interactions and communication with users and customers, ensuring a smooth and seamless experience.<br>- Monitoring and Maintenance: Regularly monitor automation systems and workflows, making adjustments and improvements as needed.<br>- Collaborate with Teams: Work closely with various teams including customer support, IT, and product development to understand requirements and deliver high-quality automation solutions.<br>- Documentation and Training: Create detailed documentation for automated processes and provide training to team members as needed.</p><h3>Required Skills and Experience</h3><p>- Technical Expertise: Proficient in integration tools (e.g., Zapier, Integromat, Gsuites) and scripting languages (e.g., Python, JavaScript).<br>- Experience in Automation: Proven experience in developing and maintaining automated workflows across different platforms.<br>- Problem-Solving Skills: Strong analytical and problem-solving abilities with a keen eye for detail.<br>- Communication: Excellent verbal and written communication skills to articulate complex technical concepts clearly.<br>- Team Player: Ability to work collaboratively with different teams to understand their needs and deliver effective automation solutions.<br>- Self-Motivated: Highly self-driven with the ability to manage multiple tasks and projects simultaneously.<br>- Experience with APIs: Knowledge and experience working with APIs to integrate various platforms.<br>- Educational Background: Bachelor’s degree in Computer Science, Information Technology, or a related field is preferred but not mandatory with relevant experience.</p><h3>Why Candidate should apply this position</h3><p>- Innovative Environment: Work in a fast-paced, innovative environment where your contributions make a significant impact.<br>- Growth Opportunities: Opportunities for professional growth and advancement within the company.<br>- Collaborative Culture: Join a supportive team that values collaboration and fresh ideas.<br>- Competitive Compensation: Attractive salary and benefits package.</p>",
    "techStacks": [
      "JavaScript",
      "Python"
    ]
  },
  {
    "title": "QA Automation Lead",
    "company": "Sales Marker",
    "detail_link": "https://aniday.com/en/job/qa-automation-lead-10507",
    "image": "https://static.aniday.com/uploads/images/size70/b994f3b4d87140f391395df225bf12fa_20240708025030.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>弊社プロダクトのQA活動全般を担っていただきます。使用通りの挙動確認のみならず、仕様レビューや仕様改善、UI/UX検証、開発プロセスの改善など、プロダクト品質に関わること全てに関わっていただきます。<br><br>You will be responsible for the overall QA activities of our products. You will be involved in all aspects of product quality, including specification reviews, specification improvements, UI/UX verification and development process improvements, as well as checking the behavior of the product as used.<br><br>- 開発プロセス上流での仕様レビュー及び仕様改善<br>- テスト計画・設計・実施・管理及びバグ報告 - エンジニアとの交渉及び調整業務<br>- Web・バックエンドに対するテスト効率化及び自動化の推進<br>- あらゆるテスト（API・E2E・UI・レグレッション）の設計と実装、運用保守<br>- アジャイルを前提に、開発プロセス全体に関連する改善業務<br><br>- Specification review and specification improvement in the upstream of the development process<br>- Test planning, design, implementation, management and bug reporting<br>- Negotiation and coordination with engineers<br>- Promoting test efficiency and automation for web and back-end testing<br>- Design and implementation of all tests (API, E2E, UI, regression), operation and maintenance<br>- Improvement work related to the entire development process, based on the premise of Agile.<br><br>また、リードQAエンジニアとして、以下の業務を実行していただきます。<br>- QAチームのメンタリングおよび育成（定期的なメンバーとの1 on 1を含む）<br>- チームメンバーへの技術的な支援とレビューの提供<br>- 開発チーム、PdM、他部門との率先的な連携<br><br>As a Lead QA Engineer, you will be responsible for performing the following tasks:<br>- Mentoring and developing the QA team (including regular 1 on 1s with members)<br>- Providing technical support and reviews to team members<br>- Proactively liaising with the development team, PdM, and other departments</p><h3>Required Skills and Experience</h3><p>- 事業会社での開発もしくはQA経験3年以上<br>- Webアプリ又はモバイルアプリのQA経験<br>- QAチームのマネジメント経験<br>- ソフトウェアテストの知識や経験<br>- ネイティブレベルの日本語（細かい文言のチェックなどもお願いします）<br>- 日常会話レベルの英語<br><br>- At least 3 years' experience in development or QA in a business company.<br>- QA experience in web or mobile apps<br>- Experience of managing a QA team<br>- Knowledge and experience of software testing<br>- Native level of Japanese (also required to check detailed wording)<br>- Daily conversation level English</p><h3>Why Candidate should apply this position</h3><p>●リモートワーク<br>現在は、リモートで業務を進めています。<br>ZoomやMeetを始め、直近Gatherのバーチャルオフィスも導入しまして、リモートでもコミュニーケーションの質・量ともに落とすことなく、開発・運用をしています。<br>また、WeWorkのオフィスを借りているので、毎日出社も可能です。<br><br>●フレックスワーク<br>1日の労働時間を自由にカスタマイズ可能です。<br>社内やチームの状況に鑑みて、常識の範囲内でご自身でスケジューリングしながら業務遂行していただきます。<br>（月の所定労働日数×8時間分の稼働を各自でご調整いただいております。）<br><br>●ワークライフバランス<br>ワークライフバランスを大切に仕事をして頂いています。<br>ガッツリ仕事したい方、自分の時間を大切にしたい方どちらも馴染める環境だと思います。<br><br>●Remote Working:<br>Currently, we work remotely. We have introduced Zoom, Meet, and most recently Gather's virtual office, so we can develop and operate remotely without compromising the quality and quantity of communication. We also rent office space at WeWork, so we can come to work every day.<br><br>●Flexible Working:<br>You can customize your working hours per day as you wish. You carry out your work while scheduling your own work within the limits of common sense, taking into account the situation within the company and your team. (You are responsible for adjusting your own working hours to the prescribed number of working days per month x 8 hours).<br><br>●Work-life Balance:<br>We encourage a good work-life balance. We believe that both people who want to work hard and people who value their own time will be able to get used to the environment.</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "QA/QC",
      "UI / UX"
    ]
  },
  {
    "title": "QA Automation Engineer",
    "company": "Sales Marker",
    "detail_link": "https://aniday.com/en/job/qa-automation-engineer-10506",
    "image": "https://static.aniday.com/uploads/images/size70/b994f3b4d87140f391395df225bf12fa_20240708025030.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>弊社プロダクトのQA活動全般を担っていただきます。使用通りの挙動確認のみならず、仕様レビューや仕様改善、UI/UX検証、開発プロセスの改善など、プロダクト品質に関わること全てに関わっていただきます。<br><br>You will be responsible for the overall QA activities of our products. You will be involved in all aspects of product quality, including specification reviews, specification improvements, UI/UX verification and development process improvements, as well as checking the behavior of the product as used.<br><br>- 開発プロセス上流での仕様レビュー及び仕様改善<br>- テスト計画・設計・実施・管理及びバグ報告 - エンジニアとの交渉及び調整業務<br>- Web・バックエンドに対するテスト効率化及び自動化の推進<br>- あらゆるテスト（API・E2E・UI・レグレッション）の設計と実装、運用保守<br>- アジャイルを前提に、開発プロセス全体に関連する改善業務<br><br>- Specification review and specification improvement in the upstream of the development process<br>- Test planning, design, implementation, management and bug reporting<br>- Negotiation and coordination with engineers<br>- Promoting test efficiency and automation for web and back-end testing<br>- Design and implementation of all tests (API, E2E, UI, regression), operation and maintenance<br>- Improvement work related to the entire development process, based on the premise of Agile.</p><h3>Required Skills and Experience</h3><p>- 事業会社での開発もしくはQA経験2年以上<br>- Webアプリ又はモバイルアプリのQA経験<br>- ソフトウェアテストの知識や経験<br>- ネイティブレベルの日本語（細かい文言のチェックなどもお願いします）<br>- 日常会話レベルの英語<br><br>- At least 2 years' experience in development or QA in a business company.<br>- QA experience in web or mobile apps<br>- Knowledge and experience of software testing<br>- Native level of Japanese (also required to check detailed wording)<br>- Daily conversation level English</p><h3>Why Candidate should apply this position</h3><p>●リモートワーク<br>現在は、リモートで業務を進めています。<br>ZoomやMeetを始め、直近Gatherのバーチャルオフィスも導入しまして、リモートでもコミュニーケーションの質・量ともに落とすことなく、開発・運用をしています。<br>また、WeWorkのオフィスを借りているので、毎日出社も可能です。<br><br>●フレックスワーク<br>1日の労働時間を自由にカスタマイズ可能です。<br>社内やチームの状況に鑑みて、常識の範囲内でご自身でスケジューリングしながら業務遂行していただきます。<br>（月の所定労働日数×8時間分の稼働を各自でご調整いただいております。）<br><br>●ワークライフバランス<br>ワークライフバランスを大切に仕事をして頂いています。<br>ガッツリ仕事したい方、自分の時間を大切にしたい方どちらも馴染める環境だと思います。<br><br>●Remote Working:<br>Currently, we work remotely. We have introduced Zoom, Meet, and most recently Gather's virtual office, so we can develop and operate remotely without compromising the quality and quantity of communication. We also rent office space at WeWork, so we can come to work every day.<br><br>●Flexible Working:<br>You can customize your working hours per day as you wish. You carry out your work while scheduling your own work within the limits of common sense, taking into account the situation within the company and your team. (You are responsible for adjusting your own working hours to the prescribed number of working days per month x 8 hours).<br><br>●Work-life Balance:<br>We encourage a good work-life balance. We believe that both people who want to work hard and people who value their own time will be able to get used to the environment.</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "QA/QC",
      "QA",
      "Automation Tools"
    ]
  },
  {
    "title": "C++ Developer (Remote)",
    "company": "think-cell",
    "detail_link": "https://aniday.com/en/job/c-developer-contract-10467",
    "image": "https://static.aniday.com/uploads/images/size70/03776e58faa14eeb830243b8af29aef7_20240628065827.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>1. Software Development: Design, implement, and maintain software components using C++.<br>2. Problem Solving: Identify and resolve software issues and improve performance.<br>3. Collaboration: Work closely with team members and other departments to understand requirements and deliver high-quality solutions.<br>4. Code Review: Participate in code reviews to ensure code quality and adherence to best practices.<br>5. Testing: Develop and execute unit tests to ensure software reliability and robustness.<br>6. Documentation: Create and maintain documentation for software components and processes.<br>7. Continuous Improvement: Stay updated with the latest industry trends and continuously improve skills and knowledge.</p><h3>Required Skills and Experience</h3><p>We are looking for bright, creative Developers with a solid theoretical background. Our team of Developers consists of a wide range of people, from recent graduates in Computer Science, Physics and Mathematics to developers with 10+ years of experience. A university degree or work experience with C++, together with a fresh and creative problem-solving approach would be an excellent combination for the role. <br><br>1. A degree in Computer Science, Mathematics, Engineering, or a related field.<br>2. Experience: 8+ years of proven experience in C++ software development, no need for latest standards C++17<br>3. Technical Skills: <br>   - Proficiency in C++ programming.<br>   - Familiarity with algorithms and data structures.<br>   - Understanding of software design and architecture principles.<br>4. Strong analytical and problem-solving skills.<br>5. Excellent verbal and written communication skills in English.<br>6. Ability to work effectively in a collaborative team environment.<br>7. Willingness to learn new technologies and adapt to changing requirements.</p><h3>Why Candidate should apply this position</h3><p>- A wide array of extremely challenging C++ development tasks<br>- An international team of brilliant minds<br>- A working environment that makes this team stay and grow<br>- Enough time to make sure that every detail of your solution is perfect<br>- A flat organization and plenty of room for your ideas<br>- No scheduled meetings<br>- Lifestyle-friendly working hours, no deadlines, no overtime<br>- Support for relocation<br>- A highly competitive annual salary from the start, with a raise to EUR 130,000 after your first year<br>- Daily breakfast with fresh bakery products, fruits and vegetables, drinks and snacks available at the office, a shower to use in case someone does sports in between (several of us run or bike to work), a summer and a winter party, support for German language courses and welcome small dogs to the office.</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Enginering",
      "C++"
    ]
  },
  {
    "title": "Full Stack Software Engineer (Full-time remote)",
    "company": "SensorFlow",
    "detail_link": "https://aniday.com/en/job/senior-full-stack-software-engineer-9995",
    "image": "https://static.aniday.com/uploads/images/size70/883ddd4bf1db430bbba26a09013cba64_20230928092614.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>SensorFlow is at the forefront of IoT-driven building automation, leveraging real-time data and smart solutions to make buildings more efficient, sustainable, and productive.<br><br>As a Full Stack Software Engineer, you will play a key role in designing and building scalable systems that drive our mission. Working across our dashboard– both on web and on mobile, IoT gateways, and more. You will deliver impactful solutions that create real-world value for our customers.<br><br>Join us, as we work towards making every building more productive, energy efficient, and sustainable!<br><br>Responsibilities:<br><br>- Participate in the design and development of scalable systems and services to support SensorFlow’s platform, including web, mobile, and IoT components.<br>- Participate in the full software development lifecycle, from requirements gathering and solution design to deployment and maintenance.<br>- Take ownership of key product areas, enhancing, or creating features to improve performance and usability.<br>- Write clean, maintainable, and efficient code while adhering to industry best practices.<br>- Conduct code reviews and provide constructive feedback to team members to maintain high code quality.<br>- Implement unit tests and automation tools to ensure robustness and reliability.<br>- Collaborate with cross-functional teams, including Product, Operations, and Infra, to deliver solutions aligned with business needs.<br>- Contribute to creating and maintaining detailed software documentation.<br>- Design and build secure web applications, leveraging CI/CD pipelines to streamline deployment.</p><h3>Required Skills and Experience</h3><p>- Fluent English<br>- 5+ years of experience building production applications with ReactJS and TypeScript.<br>- Strong server-side development experience, preferably using NestJS, Hasura, and Pacts with GraphQL.<br>- Experience in distributed systems for IoT devices or similar high-throughput applications.<br>- Proficiency in relational databases like PostgreSQL and time-series extensions such as TimeScaleDB.<br>- Solid knowledge of secure web application architecture and development practices.<br>- Familiarity with CI/CD pipelines and deploying applications to production environments.<br>- Experience collaborating with Infra Teams to operate infrastructure on AWS.<br>- Strong understanding of the software development lifecycle and version control using Git.<br>- Excellent communication skills with the ability to collaborate effectively across teams and stakeholders.</p><h3>Why Candidate should apply this position</h3><p>At SensorFlow, we’re made up of dreamers, achievers, and visionaries whose passion and belief in a greater cause drive us to do more and push the boundaries of innovation every day. If you want to work with fun-loving and diverse personalities in an environment that prioritizes your learning, development, and autonomy, then SensorFlow is the perfect place for you. We also have amazing benefits that include a generous annual leaves, medical coverage, birthday leave, fitness benefits, and Flexi benefits.<br>*Total compensation package will include fixed salary + incentive (according to company's performance)</p><h3>Job Q&A</h3><p></p>",
    "techStacks": [
      "Fullstack",
      "Enginering",
      "NestJS",
      "PostgreSQL",
      "IoT",
      "TypeScript",
      "ReactJS"
    ]
  },
  {
    "title": "Technical Designer - Pattern Maker (Intimate/Outerwear) (US/HongKong/China remote)",
    "company": "Crossian",
    "detail_link": "https://aniday.com/en/job/technical-designer-pattern-maker-intimate-outerwear-us-hongkong-china-remote-11472",
    "image": "https://static.aniday.com/uploads/images/size70/db52883ce66c426b8cf1874f74aa8857_20241122030050.webp",
    "description": "<h3>Benefit</h3><p></p><h3>Job Overview And Responsibility</h3><p>We are now seeking a Technical designer to uphold our standards for excellence and drive customer satisfaction through your technical expertise, attention to detail, and leadership abilities. You will report directly to the Manager of Supply Chain Management and work closely with our fulfillment team and partnership factories.<br><br><br>We are seeking a skilled Technical Designer specializing in Intimate or outerwear fashion to join our dynamic team. The ideal candidate will have a strong background in designing patterns, sizing grading, and construction methods adhering to US standards. Experience in direct-to-consumer (D2C) fashion retail is highly preferred. Strong communication, interpersonal, and leadership skills will allow you to connect with and provide training across teams as our bra technical expert.<br><br>Location: US / Hongkong / China based<br><br>Working Type: Remote<br><br>WHAT YOU WILL DO<br>The Technical Designer is responsible for ensuring high standards of quality, fit, and technical accuracy for all intimate/outerwear styles. Primary duties include:<br><br>Design and develop technical packages including flat sketches, pattern specs, and construction details for intimate/outerwear garments.<br>Execute pattern-making, grading, and fit evaluations ensuring adherence to brand aesthetic and quality standards.<br>Collaborate closely with Design, Production, and Quality Assurance teams to achieve desired product outcomes.<br>Conduct fittings and make necessary adjustments to ensure garments meet fit and comfort requirements.<br>Stay updated with industry trends, materials, and construction techniques to enhance product innovation and quality.</p><h3>Required Skills and Experience</h3><p>WHAT WE ARE LOOKING FOR<br>Bachelor's degree in Fashion Design, Apparel Manufacturing, or related field.<br>Proven experience (3-4 years) as a pattern maker focused on Intimate or outerwear, preferably in D2C fashion retail.<br>Experience working in well-known brands in the US.<br>Proficiency in pattern-making software (e.g., Adobe Illustrator, Gerber Technology).<br>Strong understanding of sizing grading principles and US fit standards.<br>Excellent communication skills and ability to collaborate effectively with cross-functional teams.<br>Detail-oriented with a keen eye for craftsmanship and garment construction.</p><h3>Why Candidate should apply this position</h3><p>At Crossian, our people are the key to our success. We believe in creating an attractive total compensation package (TCP) that not only retains employees but allows them to excel in their profession. These include:<br><br> Competitive salary (negotiable depending on what you bring to the table) <br>Full salary during probation<br>Guaranteed 13th-month salary<br>Quarterly bonus and year-end bonus as part of our profit-sharing program<br> Lots of other company benefits including a 5-star annual Summer Summit, budget for frequent team building activities, and other monthly/quarterly/annual company events<br>General company T&amp;D Program</p>",
    "techStacks": [
      "Designer",
      "Adobe Illustrator",
      "Pattern Making",
      "Communications"
    ]
  },
  {
    "title": "Data Scientist -Manager and Director",
    "company": "Aniday",
    "detail_link": "./job-detail.html",
    "description": "Error fetching description",
    "techStacks": "Error fetching tech stacks"
  },
  {
    "title": "Data Scientist -Manager and Director",
    "company": "Aniday",
    "detail_link": "./job-detail.html",
    "description": "Error fetching description",
    "techStacks": "Error fetching tech stacks"
  },
  {
    "title": "Data Scientist -Manager and Director",
    "company": "Aniday",
    "detail_link": "./job-detail.html",
    "description": "Error fetching description",
    "techStacks": "Error fetching tech stacks"
  }
]