{
  "description": "Front-End Engineer<br>Location:  United States – Remote<br>Job Description:<br>Simply put: Nebo’s engineering team gets things done. That usually looks like using the art of code to solve problems and build solutions for clients and coworkers alike. We don’t get hung up on what hasn’t been done – we’re all about what we can do. We’re looking for driven teammates who are ready to jump in and do the same.<br>About Nebo<br>Nebo is a human-centered agency built on a culture of respect, professional growth and care for every employee. With numerous perks, including hybrid in-office/remote work or fully remote work options designed to fit your needs, unlimited PTO, and free attendance to local marketing events, join this fun-loving team that occasionally talks Slack Smack.<br>About the position<br>As a front-end engineer at Nebo, you will bring well-designed website and interfaces to life with carefully crafted HTML, CSS, and JavaScript.<br>Be prepared to work with our back-end, design, content and UX teams to maintain and develop features for existing web applications and websites and to build complex user interactions either from scratch or within existing frameworks.<br>We’re looking for someone with 2-5 years of professional coding experience and strong examples of previous work.<br>Here are some of the technologies we use on a daily basis<br>Skills Required<br>The things that will set you apart (AKA Bonus Skills)<br>Nebo’s Commitment to Diversity & Inclusion<br>As a human-centered agency, we believe in uplifting our community and advancing society through inclusive business practices. We’re dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran’s status.",
  "stack": [
    "JavaScript / JQuery",
    "CSS / Sass",
    "Git / GitLab",
    "Nebo CMS (our in-house Content Management System built and maintained by our team!)",
    "Proficient in HTML, CSS, SCSS, JavaScript, and JQuery",
    "Portfolio of designed and coded work",
    "Familiar with Adobe creative tools",
    "Able to translate user experience and design into clean, modular, and scalable code that follows web standards",
    "Attention to detail",
    "Good communication skills",
    "Familiar with using Git and version control",
    "Experienced in React and Next.js",
    "Agency or fast-paced work environment experience"
  ]
}