[
  {
    "title": "Senior Software Engineer, Backend",
    "company": "Human Interest",
    "dateCreated": "2024-12-01",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2021/01/26171329/human_interest-150x150.jpg",
    "descriptionLink": "https://remote.co/job/senior-software-engineer-backend-30-3/",
    "description": "Title: Senior Software Engineer, Backend (Financial Engines)\n\nLocation: United States, Remote\n\nJob Description:\n\nHuman Interest is on a mission to ensure that people in all lines of work have access to retirement benefits.\n\nNearly half of all working Americans are not saving enough for their future. Too often it’s because they are employed by a company that doesn’t offer a retirement plan. Human Interest is changing that by making it affordable and accessible for small and medium-sized businesses to offer employees a path to financial independence through retirement savings.\n\nWe’rea high-growth tech company changing the retirement industry. We’ve raised more than $700M in primary and secondary financings and are backed by a number of investors. Most recently, this includes funding from Marshall Wace and Baillie Gifford, as well as top investors such as BlackRock, TPG (The Rise Fund), SoftBank, Glynn Capital, NewView Capital, USVP, Wing, Uncork, and more.\n\nAre you ready to join our amazing engineering team?\n\nAs an engineering organization, we seek to redefine the retirement services space with software that drives toward an effortless, efficient, scalable and highly reliable cloud based experience. Joining our team requires passion for ownership – after all, this is what enables our users’ success.\n\nHow we do it:\n\nWe value continuous improvement – we care about documentation, security, durability, not just throwing features over the wall. We help each other be better engineers – we leave things better than we found it. We aspire to collaborate seamlessly – we ensure our software is improving the customer experience.\n\nAbout the Financial Engines team\n\nThe Financial Engines team enables the entire investment and retirement journey for a participant.\n\nOur software systems provide the core functionality for participants to invest money efficiently and accurately, thus enabling them to achieve their target savings with financial security. Additionally our systems provide the core functionality to borrow or withdraw their money when they need it most.\n\nThe Financial Engines team is responsible for the software systems that manage core workflows responsible for investing into funds, managing cash and loans and moving money between accounts. Our goal is to provide participants an effortless experience while ensuring all operations are handled at high scale with accuracy. The Financial Engines transactions encompass the highest volume and most critical workflows in the entire company. Our products provide an investment experience that is highly scalable, accurate, timely and secure.\n\nOur team regularly undertakes projects that are critical to the company’s success, often ranking as a top company initiative. We are excited to be growing our team in 2024 to seize new and exciting business opportunities. In 2024 and beyond we will develop new features and services from scratch that cater to the most critical actors in our system including administrators, participants and service partners. These features will enable the success of the company by unlocking new revenue, time savings and cost optimizations. We are one of the teams contributing to offerings that will provide significant new growth for the company.\n\nAbout You\n\nYou are passionate about building highly scalable transaction processing and automation engines. You thrive on building efficient and horizontally scalable software platforms. You are knowledgeable about backend software development, cloud infrastructure, performance analysis and scalable database technologies (both SQL and Nosql). You thrive under pressure and are committed to delivering high quality software under deadlines. You are adaptable and embrace working in a quickly changing environment. You demonstrate a strong sense of responsibility and possess the capability to successfully lead projects characterized by unclear requirements. You are a highly collaborative team player who is willing to both learn from as well as coach your teammates. You are committed to continuous learning and improvement.\n\nAbout the Role\n\nAs a highly impactful, hands-on, senior engineer, you will lead challenging technical projects within the framework of an agile team. You will help build out our next generation horizontally scalable financial engine. You will collaborate with domain experts to design, build, test, and own systems and processes for servicing 401(k) plans and making our customers happy. As reliability and performance are key to earning our customers’ trust, you will build robust systems that are observable, maintainable, and scalable\n\nWhat you get to do every day\n\nBuild and maintain business-critical software to process and record customers’ retirement savings\nImprove complex processes and systems to make them more robust, higher performance and require less human intervention\nCollaborate with other engineers and stakeholders to share knowledge and build expertise\nWrite clean, high-quality code and tests while keeping the system fast and reliable\nDevelop and analyze monitors and tests to assess performance, scalability and reliability\nDevelop ownership over critical retirement workflows and domains\nMake informed engineering tradeoff decisions\nDelight internal and external stakeholders\nParticipate in development life cycle activities like analysis, design, coding, testing and production release\n\nWhat you bring to the role\n\nMinimum 7 years of professional experience building and maintaining backend software\nExperience building scalable backend technologies\nYou enjoy mentoring other engineers and helping them grow technically.\nYou often have become a key go-to person in your company, even on projects outside your project area.\nExperience scaling database platforms (Nosql, SQL)\nStrong desire to learn, exchange feedback and grow – from our internal legacy and futuristic technical designs, to retirement domains and workflows that are critical for our business.\nAbility to think creatively, and share knowledge with others\nAbility to write understandable, testable code with an eye towards maintainability\nProactive and empathetic mindset – you love to roll up your sleeves to fix problems for our customers\nCompleted formal training in computer science related discipline (Bachelors or Masters preferred)\n\nWhy you will love working at Human Interest\n\nMission – Highly collaborative startup dedicated to supporting employee engagement and growth. It’s an opportunity to help solve one of the biggest unsolved problems in America: saving for retirement.\n\nCulture – Our operating principles define how we come together as a team to do our work. They reflect Human Interest’s unique view on what’s important and what’s right. Documenting this core aspect of our culture helps employees make good decisions on their own. It also helps candidates considering career opportunities critically evaluate whether they will thrive at Human Interest.\n\nCustomer obsession\nLong-term orientation\nAutonomous and accountable teams\nAn escalating bar for talent and performance\nFundamental optimism\n\nCompensation – At Human Interest, there are a number of factors that are used to determine the appropriate pay range for each position. We take into account the cost of labor for each position in various markets across the US. The base salary for this position spans $185,000 – $220,000 and represents the minimum in our lowest geographic region to a maximum in our highest geographic region. The salary that we offer to a new employee within this range is based on their location within the US, their relevant job-related skills, and experience. At Human Interest, base salary is one component of the overall Total Rewards package. Depending on the position, additional compensation components such as bonus, commission, and equity may be offered. All of our employees are offered a robust suite of physical, financial and mental wellness benefits.\n\nBenefits –\n\nA great 401(k) plan: Our own! Our 401(k) includes a dollar-for-dollar employer match up to 4% of compensation (immediately vested) and $0 plan fees\nTop-of-the-line health plans, as well as dental and vision insurance\nGenerous PTO and parental leave policies\nAddition Wealth – Unlimited access to digital tools, financial professionals, and a knowledge center to help you understand your equity and support your financial wellness\nLyra – Enhanced Mental Health Support for Employees and dependents\nCarrot – Fertility healthcare and family forming benefits\nCandidly – Student loan resource to help you and your family plan, borrow, and repay student debt\nMonthly work-from-home stipend; quarterly lifestyle stipend\nEmployee Resource Groups including Veterans, Lift Ev’ry Voice, Pride, LatinX, Families, and Women in Tech\nFun online and regional events and celebrations and department and company offsites\nThe vast majority of our positions can be 100% remote\n\nWe’re a great place to work (but don’t take our word for it)\n\nHere’s a list of our awards and accolades:\n\nCertified as a Great Place To Work (2023-2024)\nFortune Best Place to Work in the Bay Area (2024)\nBest Places to Work by Built In (2023-2024)\nAmerica’s Best Startup Employers by Forbes (2020-2022, 2024)\nA Top Company by Y Combinator (2020-2023)\nInc. Fastest Growing Companies (2021)\n\nHuman Interest is an equal opportunity employer. All applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran or military status, pregnancy, or any other characteristics protected under federal, state, or local laws.\n\nWe are committed to making every stage of our application process fully accessible to all individuals. If you need a reasonable accommodation at any point in the process, please let us know at applicantaccommodations@humaninterest.com.\n\nPlease note Human Interest does not accept unsolicited resumes from any source other than directly from candidates. We will not consider resumes from vendors including and without limitation search firms, staffing agencies, fee-based referral services, and recruiting agencies.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider employment-qualified applicants with arrest and conviction records. We comply with CCPA guidelines.\n\nSee more: https://humaninterest.com/disclosures",
    "stack": []
  },
  {
    "title": "Backend Typescript Developer (AWS Serverless)",
    "company": "Insight Global",
    "dateCreated": "2024-12-01",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/05/30175426/insight_global_logo.jpeg",
    "descriptionLink": "https://remote.co/job/backend-typescript-developer-aws-serverless-30/",
    "description": "Title: REMOTE – Backend Typescript Developer (AWS Serverless)\n\nZIP/Postal Code\n\n92618\n\nJob Type\n\n—\n\nCategory\n\nProgrammer / Developer\n\nReq #\n\nOCC-747764\n\nPay Rate\n\n$70 – $88 (hourly estimate)\n\nJob Description\n\nA client located in Irvine, CA is seeking an AWS Serverless Developer to work 100% remote. This is a brand new and exciting project for a large quick service restaurant company. You will be working on other sub projects and with other teams but primarily working on this new initiative. The main technologies used will be AWS serverless, Lambda, API gateway and Dynamo DB. This role is 100% remote (ideally working PST hours) and will be at least 6 months long (potentially 12 months).\n\nWe are a company committed to creating diverse and inclusive environments where people can bring their full, authentic selves to work every day. We are an equal opportunity/affirmative action employer that believes everyone matters. Qualified candidates will receive consideration for employment regardless of their race, color, ethnicity, religion, sex (including pregnancy), sexual orientation, gender identity and expression, marital status, national origin, ancestry, genetic factors, age, disability, protected veteran status, military or uniformed service member status, or any other status or characteristic protected by applicable laws, regulations, and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please send a request to HR@insightglobal.com.\n\nTo learn more about how we collect, keep, and process your private information, please review Insight Global’s Workforce Privacy Policy: https://insightglobal.com/workforce-privacy-policy/ .\n\nRequired Skills & Experience\n\n2+ years of experience doing backend AWS serverless development\n\n2+ years of backend development with Typescript\n\nExperience with AWS Lambda, API Gateway, DynamoDB and SQS\n\nFamiliarity with the Serverless Framework (for infra as code) and GitLab for repo and CI/CD\n\nNice to Have Skills & Experience\n\nExperience with Eventbridge (buses), step functions, CDK, Rout53, SES, Cloudwatch dashboards and Retool\n\nExperience working in smaller teams\n\nBenefit packages for this role will start on the 31st day of employment and include medical, dental, and vision insurance, as well as HSA, FSA, and DCFSA account options, and 401k retirement account access with employer matching. Employees in this role are also entitled to paid sick leave and/or other paid time off as provided by applicable law.",
    "stack": []
  },
  {
    "title": "Staff Software Engineer (Backend) - Growth",
    "company": "Bill.com",
    "dateCreated": "2024-12-01",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/27203646/bill_com_logo.jpeg",
    "descriptionLink": "https://remote.co/job/staff-software-engineer-backend-growth-30/",
    "description": "Title: Staff Software Engineer (Backend) – Growth\n\nLocation: United States\n\nJob Description:\n\nAt BILL, we believe in empowering the businesses that drive our economy. By replacing outdated financial processes with innovative tools, we help businesses—from startups to established brands—make smarter decisions and gain control of their operations. And we don’t stop there: we’re creating the future of financial automation so businesses can spend more time on what matters.\n\nWorking here means you become part of a vision-driven team that’s ready to tackle challenges and build cutting-edge solutions. We value purpose, drive, and curiosity—and we thrive in a fast-paced, ever-changing environment. Whether in one of our offices in San Jose, CA, Draper, UT, or working remotely, BILLders collaborate to deliver real impact for businesses that need more time in their busy weeks.\n\nAt BILL, we listen, learn, and lead—fostering collaboration and a drive for continuous growth. We’re committed to building a diverse and inclusive workplace that values each person’s unique skills and experiences. Even if you don’t meet every requirement, we’d love to hear from you—you might be just what we’re looking for, whether in this role or another.\n\nLet’s give businesses more time for what matters.\n\nMake your impact within a rapidly growing Fintech Company\n\nThe Growth Engineering team focuses on the Signup, Onboarding, Retention experiences for new BILL customers, as well as pricing, product packaging and monetization. The team works closely with the Sales and Marketing teams and optimize the first time experiences for our customers and drive towards directly impacting revenue, unit growth and feature engagement within the product. The team uses Angular/React and Java in their day to day development and are heavily focused on building and deploying high quality, high performance features that improve experiences for BILL customers.\n\nWe’d love to chat if you have:\n\n8+ years of development experience with a bachelors, or 5+ years of experience with masters in relevant field\nExperience working on large scale, complex applications using Java, AWS and modern JS frameworks\nExperience working with REST API development\nFamiliarity with databases (ElasticSearch, MySQL, Oracle or any Cloud DB)\nExpertise with using AWS services to build microservices\nExcellent teamwork and communication\nAbility to gain alignment across cross-functional boundaries\nAbility to challenge the norm and develop microservices from a monolith\nPassion for great products and building great experiences, proven ability to take the product through all stages of development from concept to launch at scale\nBS/MS in Computer Science or a related field\n\nNice to Have:\n\nKnowledge of best practices & patterns for large scale applications in JavaScript\nTest Driven Development (TDD) methodology, functional programming style. Playwright or Cypress testing experience a bonus.\nExperience with dev tools like Splunk, Datadog, Mixpanel, LaunchDarkly etc.\nSome experience in Angular, React, etc.\n\nWhat’s in it for you?\n\nRedefining how businesses automate their work is a fast-paced, exciting, and fun environment. But we also have benefits and perks to ensure the magic isn’t only experienced by our customers, but by our employees as well.\n\nHere is a preview of some of the amazing benefits here at BILL:\n\n100% paid employee health, dental, and vision plans (choose HMO, PPO, or HDHP)\nHSA & FSA accounts\nLife Insurance, Long & Short-term disability coverage\nEmployee Assistance Program (EAP)\n11+ Observed holidays and wellness days and flexible time off\nEmployee Stock Purchase Program with employee discounts\nWellness & Fitness initiatives\nEmployee recognition and referral programs\nAnd much more\n\nBILL is an Equal Opportunity Employer that values diversity and inclusion. We believe our best ideas come from the unique stories, perspectives, and experiences of our team members. We welcome people of all backgrounds, abilities, and identities to bring their authentic selves and contribute to our culture.\n\nOur Applicant Privacy Notice describes how BILL treats the personal information it receives from applicants.",
    "stack": []
  },
  {
    "title": "Front End Engineer",
    "company": "NerdWallet",
    "dateCreated": "2024-12-01",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/31185204/Nerdwallet-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/front-end-engineer-30-2/",
    "description": "Title: Front End Engineer (Contract)\n\nLocation: United States\n\nJob Description:\n\nAt NerdWallet, we empower consumers to make smart financial decisions. Our Brand Studio team is dedicated to creating compelling digital experiences that resonate with our audience. We’re looking for a talented Front End Engineer to help us contribute to NerdWallet’s brand and business results via your technical expertise. Projects include but are not limited to building an internal landing page publishing tool, enhancing our homepage surface, and supporting custom marketing initiatives with both static and dynamic web/mobile web experiences. If you’re excited to build user-centric tools and enhance our digital presence, we’d love to hear from you!\n\nAs a Front End Engineer on the Brand Studio team, you will play a crucial role in developing and optimizing user-facing features. You will collaborate closely with designers, copywriters, product managers, and other engineers to create responsive, accessible, and visually appealing landing pages and highly performant, user-centric web applications. Your expertise will directly contribute to enhancing our marketing efforts and improving our overall user experience.\n\nWhere you can make an impact:\nDevelop and Maintain Features: Build and maintain the internal landing page publishing tool, ensuring it is user friendly and efficient for the creative and marketing teams.\nHomepage Optimization: Collaborate with stakeholders to enhance the homepage surface, focusing on performance, accessibility, analytics reporting, and responsive design.\nCustom Marketing Initiatives: Work on various marketing projects, implementing custom features and optimizing front end performance.\nCode Quality & Best Practices: Ensure high quality code through best practices in coding standards, testing, and documentation.\nCollaboration: Work closely with designers and product managers to translate wireframes and design prototypes into functional, performant, high-quality code.\nStay Current: Keep up-to-date with emerging front end technologies and trends to continuously improve our tools and processes.\nYour experience:\n\nWe recognize not everyone will meet all of the criteria. If you meet most of the criteria below and you’re excited about the opportunity and willing to learn, we’d love to hear from you.\n\nExperience: 3-5 years of experience in front-end development, with a strong portfolio of web applications and projects.\nTechnical Skills: Proficiency in HTML, CSS, JavaScript, and modern frameworks (e.g., React, Vue.js, Angular). Experience with Next.js is highly preferred.\nResponsive Design: Solid understanding of responsive design principles and experience with CSS preprocessors (e.g., SASS, LESS).\nPerformance Optimization: Knowledge of performance optimization techniques and tools for web applications.\nTeam Player: Excellent communication skills and the ability to collaborate effectively within a remote team via tools like Slack.\nProblem Solver: Strong analytical and problem-solving skills with attention to detail.\nWhere:\nThis role will be remote (based in the U.S.) or Canada.\nPay Transparency & Contract Details:\nThe hourly rate for this position is $48.50/hour\nThis is a W2 contract role hired by Magnit\nThe estimated schedule for this engagement would be 40 hours per week from January-December\n\n#LI-Remote\n\n#LI-4",
    "stack": []
  },
  {
    "title": "UI Frontend Developer",
    "company": "FSA Store",
    "dateCreated": "2024-12-01",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/30194733/FSA-Store-Logo-150x150.jpg",
    "descriptionLink": "https://remote.co/job/ui-frontend-developer-30/",
    "description": "Title: UI Frontend Developer\n\nLocation: United States\n\nJob Description:\n\nAbout the Role:\n\nWe are seeking a highly skilled and experienced UI Frontend Developer to join our dynamic team. The ideal candidate will have a strong background in web development, with extensive experience in HTML and JavaScript. As a UI Frontend Developer, you will play a crucial role in designing and implementing user interfaces that are both visually appealing and highly functional.\n\nSpecific responsibilities:\nDevelop and maintain high-quality web applications using HTML, CSS, and JavaScript.\nPartner closely with business peers in the implementation of new landing pages, content assets, and A/B tests\nCollaborate with designers and backend developers to create seamless and responsive user interfaces.\nOptimize web applications for maximum speed and scalability.\nEnsure the technical feasibility of UI/UX designs.\nConduct code reviews and provide mentorship to junior developers.\nStay up-to-date with the latest industry trends and technologies to ensure our applications remain cutting-edge.\nWhat you’ll need:\nProven experience as a web developer with a strong focus on frontend development.\nProficiency in HTML, CSS, and JavaScript.\nExperience with CMS platforms such as Contentful, Builder.oi, or Sitecore\nExperience with modern JavaScript frameworks and libraries (e.g., React, Angular, Vue.js).\nStrong understanding of responsive design principles and cross-browser compatibility.\nExcellent problem-solving skills and attention to detail.\nAbility to work independently and as part of a team.\nStrong communication and collaboration skills.\nCompensation, Benefits, & Additional Details\n\nAt Health-E Commerce, our goal is to provide an offer that supports growth potential within the role and allows for future salary progression. Final compensation is evaluated on various factors which include but aren’t limited to experience, skills, internal equity among peers, and geographic location.\n\nCompensation: $90,000 – $110,000\nDiscretionary Annual Bonus Eligibility: Up to 10%\nMedical, Dental, Vision, and 401K with a company match\nDependent Care, FSA & HSA accounts\nPaid Parental & Bonding Leave\nFlexible PTO & office closure on all major holidays\nMonthly wellness & internet reimbursements\nProfessional development including certification support & leadership coaching\nMental Health resources\n100% remote within the United States\nMust be able to work EST hours",
    "stack": []
  },
  {
    "title": "Senior Software Engineer, Big Data",
    "company": "ZipRecruiter",
    "dateCreated": "2024-11-28",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/27203308/ziprecruiter_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-software-engineer-big-data-27/",
    "description": "Title: Senior Software Engineer, Big Data\n\nLocation: Palo Alto United States\n\nJob Description:\n\nWe offer a hybrid work environment. Most US-based positions can also be performed remotely (any exceptions will be noted in the Minimum Qualifications below.)\n\nWho We Are:\n\nZipRecruiter is a leading online employment marketplace. Powered by AI-driven smart matching technology, the company actively connects millions of all-sized businesses and job seekers through innovative mobile, web, and email services, as well as through partnerships with the best job boards on the web. ZipRecruiter has the #1 rated job search app on iOS & Android.\n\nAbout the Team:\n\nWere looking for software engineers who can handle the volume of data created by billions of interactions within our ecosystem. This enables the machine learning and analysis capabilities required of a growing distributed system.\n\nAt ZipRecruiter, were looking for software engineers who are passionate about building an intuitive experience for our marketplace of job seekers and employers. Our stack is complex and we prioritize cutting-edge smart match technology, innovation, and cross functional collaboration. Our teams have a unique opportunity to work at scale – build effective, data driven applications, stream and batch data processing, and develop ML infrastructure – all to help connect people to their next great opportunity.\n\nAbout the Job:\n\nBuild data processing and exploration pipelines along with ML infrastructure to power our intelligence using tools like Spark and Flink\nTake part in the full life cycle of user-facing applications at scale, from design to implementation, testing and production\nDevelop a strong understanding of the business, industry, codebase, and/or systems\n\nMinimum Qualifications:\n\n3+ year of professional software development experience with a focus on big data technologies\nExperience with Hadoop, Spark, Hive, and/or other big data technologies\nComprehensive computer science fundamentals in coding, object-oriented programming, data structures, and algorithms\nExperience with containerization technologies like Docker and/or Kubernetes\n\nPreferred Qualifications:\n\n5+ year of professional software development experience, with a focus on big data technologies\nBS/MS/PhD in Mathematics, Computer Science, Physics, related technical field or equivalent practical experience\nExperience with data integration tools like Apache Kafka, Flume, and NiFi\nFamiliarity with data storage technologies such as Delta Lake, HBase, Cassandra, and MongoDB\nFamiliarity with Apache Hudi, Apache Beam, Apache Flink, Google Cloud Dataflow, Amazon Kinesis Data Analytics, and/or Azure Databricks\n\nAs part of our team youll enjoy:\n\nCompetitive compensation\nExceptional benefits package\nFlexible Vacation & Paid Time Off\nEmployer-matched 401(k) plan\n\n#LI-Remote\n\nThe US base salary range for this full-time position is $105,000-$145,000. Our salary ranges are determined by role, level, and location, and the range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location, role-related knowledge and skills, depth of experience, relevant education or training, and additional role-related considerations.\n\nDepending on the position offered, equity, bonuses, commission, or other forms of compensation may also be provided as part of a total compensation package, in addition to a full range of medical, financial, and other benefits.\n\nZipRecruiter is proud to be an equal opportunity employer and provides equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or genetics.\n\nCompany Description\n\nZipRecruiter is the fastest growing employment marketplace. We have helped over 1 million businesses and 100 million job seekers find their next perfect match through partnerships with the best job boards on the web, curated email alerts, award-winning mobile apps, and the world’s best search algorithm for jobs.",
    "stack": []
  },
  {
    "title": "Senior Front-End Web Developer",
    "company": "Grafana Labs",
    "dateCreated": "2024-11-27",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/02/16125130/grafana_labs_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-front-end-web-developer-26/",
    "description": "Title: Senior Front-End Web Developer (Remote, US & Canada)\n\nLocation: United States (Remote)\n\nJob Description:\n\nThis is a remote position. We are looking for candidates in the US and Canada only.\n\nAbout the Role\n\nGrafana Labs is seeking a creative and passionate (Senior) Front-End Web Developer to join our small, dynamic marketing web team. In this role, you’ll collaborate with designers, content creators, marketers, and other developers to craft engaging, high-performance web experiences that delight and inform our global audience. Leverage your technical and artistic expertise to make an immediate impact as we build a new Grafana Labs marketing website from the ground up.\n\nKey Responsibilities\nBuild and maintain the Grafana Labs marketing website and custom tools using Next.js, TypeScript, Tailwind CSS, and other modern web technologies.\nIntegrate a new headless CMS and design scalable API architecture.\nDemonstrate component-based development best practices and optimize our UI library for ISR (Incremental Static Regeneration) and SSR (Server-Side Rendering).\nBe a creative thought leader in crafting captivating user experiences through interactivity and animation.\nWrite and maintain automated tests using frameworks such as Jest, React Testing Library, Cypress, or Enzyme.\nCollaborate with cross-functional teams to define and implement new features and enhancements.\nOptimize the website for performance, scalability, and SEO.\nWho You Are\nA developer-artist whose medium is code.\nAn excellent communicator with a knack for sharing ideas clearly.\nSelf-driven and accountable, taking ownership of your work.\nEnthusiastic about collaboration and mentorship.\nDetail-oriented, with a passion for crafting clean, maintainable code.\nPositively impactful-your energy lifts the team.\nTechnical Considerations\n\nIdeal Experience:\n\nExpertise in developing and maintaining React component libraries, ideally using TypeScript and a utility class-based CSS framework like Tailwind CSS.\nExperience building websites or web applications using a React-based framework such as Next.js or Gatsby.\nA strong understanding of headless CMS integration, including API- and GraphQL-based architectures.\nFamiliarity with cloud-based Git version control systems like GitHub or Bitbucket.\nAbility to write unit and end-to-end tests with frameworks such as Jest, React Testing Library, Cypress, or Enzyme.\nComfort with front-end design systems such as Figma or Adobe XD.\nExperience using a UI component library tool like Storybook or React Cosmos.\nFamiliarity with JavaScript animation libraries, such as Framer, GSAP, or Three.js.\n\nBonus Points:\n\nExperience with GitHub Actions, CI/CD, Docker, NGINX, Kubernetes, Go, Alpine.js, and/or Hugo.\n\nWe understand that you may not have experience with all of the aforementioned technologies. Or maybe you do! Either way, if you think you’d be a great fit for our team-even if your experience doesn’t check all the boxes-we encourage you to apply. We believe in shooting for the moon, and we hope you do too.\n\nWhy Join Us\n\nBe part of a remote-only, globally distributed team.\nCollaborate with passionate professionals across Grafana Labs.\nParticipate in company-wide hack-a-thons that help drive the direction of real-world innovation.\nAttend cross-functional team off-sites\nContribute to open-source projects and make a real impact.\nEnjoy a culture that values work-life balance, personal growth, and professional development.\n\nAbout Grafana Labs\n\nGrafana Labs is an open-source SaaS company specializing in observability and monitoring solutions. We help organizations make sense of their data through open, composable, and enterprise-ready monitoring and analytics tools. As a remote-only company, we embrace a global team culture that values collaboration, innovation, and personal growth.\n\nIn the US, the Base compensation range for this role is USD 135,507 – USD 169,384. Actual compensation may vary based on level, experience, and skillset as assessed in the interview process. Benefits include equity, bonus (if applicable) and other benefits listed here.\n\n*Compensation ranges are country specific. If you are applying for this role from a different location than listed above, your recruiter will discuss your specific market’s defined pay range & benefits at the beginning of the process\n\nAbout Grafana Labs: There are more than 20M users of Grafana, the open source visualization tool, around the globe, monitoring everything from beehives to climate change in the Alps. The instantly recognizable dashboards have been spotted everywhere from a NASA launch and Minecraft HQ to Wimbledon and the Tour de France. Grafana Labs also helps more than 3,000 companies — including Bloomberg, JPMorgan Chase, and eBay — manage their observability strategies with the Grafana LGTM Stack, which can be run fully managed with Grafana Cloud or self-managed with the Grafana Enterprise Stack, both featuring scalable metrics (Grafana Mimir), logs (Grafana Loki), and traces (Grafana Tempo).\n\nBenefits: For more information about the perks and benefits of working at Grafana, please check out our careers page.\nEqual Opportunity Employer: At Grafana Labs we’re building a company where a diverse mix of talented people want to come, stay, and do their best work. We know that our company runs on the hard work and the dedication of our passionate and creative employees. If you’re excited about this role but your experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways.\n\nWe will recruit, train, compensate and promote regardless of race, religion, color, national origin, gender, disability, age, veteran status, and all the other fascinating characteristics that make us different and unique. We believe that equality and diversity builds a strong organization and we’re working hard to make sure that’s the foundation of our organization as we grow.\n\nFor information about how your personal data is used once you’ve applied to a job, check out our privacy policy.",
    "stack": []
  },
  {
    "title": "Senior Backend Engineer",
    "company": "SpreeAI Corporation",
    "dateCreated": "2024-11-27",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/08/02190052/spreeai_logo-1.jpeg",
    "descriptionLink": "https://remote.co/job/senior-backend-engineer-26-7/",
    "description": "Title: Senior Backend Engineer\n\nLocation: Remote Remote US\n\nType: Full-time\n\nWorkplace: Fully remote\n\nJob Description:\n\nOverview\n\nSpreeAI is a fast-growing, innovative AI technology company with a core focus on revolutionizing the ecommerce and fashion landscapes. We thrive in a dynamic, fast-paced environment where creativity meets technology. Our mission is to revolutionize the fashion industry by creating cutting-edge technology solutions that drive real impact. If you are passionate about technology, fashion, shaping the future, and have a knack for social media, your spot is here with us! We are proud to announce that the iconic Naomi Campbell has recently joined our board, marking a significant milestone in our journey.\n\nWe are seeking a talented Senior Backend Engineer to join our dynamic team. This candidate will be responsible for writing backend Microservices to facilitate AI/ML pipelines. The ideal candidate will have a strong background in backend development, with proficiency in Go (Golang) programming language. In addition, we are looking for someone who can build out the infrastructure for business intelligence and data analytics, so we can create a robust and broadly encompassing dashboard that constantly displays and updates metrics about Try-On performance, revenue generation, GPU usage / optimization, support response times, etc. This candidate should also possess a solid understanding of Docker and Kubernetes services, API and backend integration, and be committed to following best practices in back end development.\n\nResponsibilities\n\nDesign, develop, and maintain scalable, responsive web applications using Go (Golang).\nWork closely with product and design teams to translate requirements and mock-ups into fully functioning features.\nImplement robust backend services and APIs to power web applications, ensuring high performance, security, and scalability.\nApply best practices for continuous integration and continuous deployment (CI/CD) with a focus on automation and infrastructure as code.\nMonitor, troubleshoot, and optimize application performance and reliability.\nStay up-to-date with emerging trends and technologies in web development, cloud computing, and DevOps practices.\nContribute to a culture of technical excellence, teamwork, and continuous learning within the engineering team.\n\nRequirements\n\nBachelor’s degree in Computer Science, Engineering, or related field, or equivalent practical experience.\nProven experience of 5+ years as a Backend Developer or similar role with a strong portfolio of projects.\nProficient Go (Golang) for backend development.\nExperience with microservices architecture and Distributed Systems\nStrong understanding of AWS cloud services and experience with deployment and management of applications in a cloud environment.\nFamiliarity with databases (SQL and NoSQL), web servers, and UI/UX design.\nExperience with Docker, Kubernetes, and CI/CD tools is highly desirable.\nExperience with Python, JS, SQL, ETL processes, and experience with PowerBI, Snowflake or others (i.e., Amazon Redshift, Google BigQuery).\nKnowledge of code versioning tools, such as Git.\nProficient in React.js is a nice-to-have\nExcellent problem-solving skills, attention to detail, and the ability to work in a fast-paced, deadline-driven environment.\nStrong communication and collaboration skills, with the ability to work effectively in a remote or onsite team setting.\nMust provide link to github account.\n\nBenefits\n\nCompetitive salary and performance-based incentives.\nComprehensive health and wellness benefits.\nOpportunities for professional development and growth.\nFully remote work environment.\nBe at the forefront of revolutionizing the fashion and tech industries.\nWork alongside industry leaders and influencers.",
    "stack": []
  },
  {
    "title": "Senior Backend Engineer",
    "company": "Customer.io",
    "dateCreated": "2024-11-27",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/06/19203828/customer_io_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-backend-engineer-26-6/",
    "description": "Senior Backend Engineer\n\nLocation: Americas Remote\n\nJob Description:\n\nWe are seeking Senior Backend Engineers to join our growing Engineering team!\n\nCustomer.io is looking for collaborative senior scaling developers who love solving interesting puzzles and are excited to help us build a scalable platform that our customers love. Our small, remote-first team is fun-loving, passionate, and highly effective. We offer many opportunities to grow and refine your skills while having a significant impact. Our team members have backgrounds in various industries, from AdTech to Gaming. We believe embracing our unique perspectives and expertise is the key to our success as a collaborative team.\n\nAs a distributed company, we value diversity and are committed to giving you the flexibility and freedom to work from anywhere in the world on a schedule that fits your family and your life.\n\nSome things you’ll do…\n\nBe a model and mentor for writing well-architected, well-tested, and easy-to-understand services in Go that help our customers easily send timely & relevant messages at scale.\nApply your unique perspective to help us define and build the next generation of features and infrastructure needed to help our customers and company flourish.\nWork with our tech support teams to diagnose operational issues and help our customers achieve their goals with our product.\nTake an active role in a friendly, supportive team that encourages you and the company to grow as individuals, professionals, and teams.\nMentor your coworkers through code review, pair programming, team collaboration, and training to help improve our collective knowledge and best practices.\n\nWhat we’re looking for…\n\nWorks in North/South American time zones\n7+ years in relevant roles, demonstrating increasing levels of responsibility and impact.\nStrong skills in Golang, cloud infrastructure, and UNIX environments.\nDeep understanding of and experience with building scalable and performant distributed applications.\nProficiency with relational database systems, particularly MySQL.\nExcellent communication skills and a collaborative approach to decision-making.\nAbility to understand customer needs and translate them into effective solutions.\nDesire and capability to mentor team members through code reviews, pair programming, and training.\nAbility to quickly and independently solve complex technical challenges.\nExperience and comfort with working in a distributed, remote-first environment.\n\nAbout Customer.io\n\nOur mission at Customer.io is to power automated communication that people like to receive. Today over 7,400 internet businesses use Customer.io to manage, send, and track the performance of emails, SMS, push notifications, and in-app messages. Unlike typical marketing platforms, Customer.io helps businesses increase relevance by using behavioral data: what people do or don’t do when logged in to a web or mobile app.\n\nWe are offering a starting salary of $160,000 – $184,000 USD (or equivalent in local currency) depending on experience and subject to market rate adjustment.\n\nBenefits at Customer.io include:\n\nUnlimited PTO – we encourage at least 20 vacation days (in addition to holidays and sick days) so that you can unwind, unplug, and recharge\n16 weeks paid parental leave (including adoption and foster care)\n100% paid insurance premiums for you and your dependents\n401k retirement matching – up to 5% dollar-for-dollar match to retirement contributions\n$1,500 annual healthy lifestyle budget (for gym memberships, classes, fitness equipment)\n$250/monthly Remote Work Stipend to be used for home internet, cell phone, and other miscellaneous remote work costs\n$300/month co-working space rental reimbursement\n$2,000/yearly professional education budget for conferences, courses, workshops, books, etc.\n$1,500 home office budget to make sure your working space is ergonomic and just what you need to do your best work!\nOne month sabbatical after five years at Customer.io\nWe also have opportunities to meet in person with your peers throughout the year\n\nAll final candidates will be asked to complete a background check and employment verifications as part of our pre-employment process.\n\nCustomer.io recognizes the stifling impact of systemic injustice on diverse communities. We commit to using our influence to increase inclusion and equity within the tech industry. We strive to build an inclusive team culture, implement bias-free hiring practices, and develop community partnerships to expand our global impact.\n\nJoin us!\n\nCheck out our careers page for more information about why you should come work with us! We are passionate about our core values of Empathy, Transparency, Responsibility, and Awkwardness and are looking for new coworkers to share and build that passion!\n\nHow to apply\n\nApply at the link below and tell us why you’re interested in the position! ****We aim to respond to all applicants with a status update about your application, provided no technical issues or other limitations prevent us from doing so. Please keep an eye on your email for updates.\n\nAt Customer.io, we prioritize authentic interest and applications in our hiring process. To ensure fairness and integrity, the use of AI or automation during interviews or assessments is prohibited. Candidates who do not adhere to this will be removed from consideration.\n\nHere’s what you can expect from our hiring process:\n\n30 minute video call with a Recruiter\n60 minute Technical Interview with two members of our engineering team\nTake Home Assignment\n60 minute Assignment Review Call with two members of our engineering team\n60-minute Interview with Hiring Manager",
    "stack": []
  },
  {
    "title": "Software Engineer, Backend",
    "company": "StackAdapt",
    "dateCreated": "2024-11-27",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2023/07/24210111/StackAdapt-Logo-150x150.jpeg",
    "descriptionLink": "https://remote.co/job/software-engineer-backend-26/",
    "description": "Title: Software Engineer, Backend\n\nLocation: United States\n\nType: Full-Time\n\nWorkplace: remote\n\nCategory: Engineering – Backend Infrastructure\n\nJob Description:\n\nStackAdapt is a self-serve advertising platform that specializes in multi-channel solutions including native, display, video, connected TV, audio, in-game, and digital out-of-home ads. We empower hundreds of digitally-focused companies to deliver outcomes and exceptional campaign performance everyday. StackAdapt was founded with a vision to be more than an advertising platform, it’s a hub of innovation, imagination and creativity.\n\nStackAdapt is the no. 1 performing programmatic advertising platform helping brands accelerate customer engagement and acquisition. This state-of-the-art platform is where some of the most progressive work in machine learning meets cutting-edge user experience.\n\nRanking the highest in performance by G2 Crowd for the fourth time, we’re one of the fastest growing companies in Canada and ranks 6th in Deloitte’s Technology Fast 50 ranking and 23rd in Fast 500 in North America.\n\nOur real-time advertising bidding system handles over 3,000,000 requests per second and stores several terabytes of data every day. Our technologies include Go, Ruby on Rails, Aerospike, Redis, Elasticsearch, Kafka, RocksDB, Redshift, ScyllaDB, GraphQL and others. We’re not afraid to test and try new technologies.\n\nStackAdapt is a Remote First company, we are open to candidates located anywhere in North America for this position.\n\nWhat you’ll be doing:\nBuilding highly scalable, distributed real-time micro-services primarily written in Go\nWorking with large data sets and various databases including Aerospike, Elasticsearch, Redis, ScyllaDB, Redshift, TiDB, MariaDB\nBuild software that utilize messaging queues such as Kafka, SQS, and Kinesis\nWrite performance efficient and memory optimized code\nWe’ll be reaching out to candidates that have:\n2+ years of experience as a Backend Software Engineer.\nVery strong problem solving skills in data structures, algorithms, and optimization\nExperience working with relational databases and/or key-value stores\nExperience building scalable micro-services and distributed systems\nStackAdapters Enjoy:\nCompetitive salary\nRRSP/401K matching\n3 weeks vacation + 3 personal care days + 1 Culture & Belief day + birthdays off\nAccess to a comprehensive mental health care platform\nFull benefits from day one of employment\nWork from home reimbursements\nOptional global WeWork membership for those who want a change from their home office\nRobust training and onboarding program\nCoverage and support of personal development initiatives (conferences, courses, etc)\nAccess to StackAdapt programmatic courses and certifications to support continuous learning\nMentorship opportunities with industry leaders\nAn awesome parental leave policy\nA friendly, welcoming, and supportive culture\nOur social and team events!\n\n#LI-LN1\n\nStackAdapt is a diverse and inclusive team of collaborative, hardworking individuals trying to make a dent in the universe. No matter who you are, where you are from, who you love, follow in faith, disability (or superpower) status, ethnicity, or the gender you identify with (if you’re comfortable, let us know your pronouns), you are welcome at StackAdapt. If you have any requests or requirements to support you throughout any part of the interview process, please let our Talent team know.\n\nAbout StackAdapt\n\nWe’ve been recognized for our diverse and supportive workplace, high performing campaigns, award-winning customer service, and innovation. We’ve been awarded:\n\nAd Age Best Places to Work 2024\n\nG2 Top Software and Top Marketing and Advertising Product for 2024\n\nCampaign’s Best Places to Work 2023 for the UK\n\n2024 Best Workplaces for Women and in Canada by Great Place to Work\n\n#1 DSP on G2 and leader in a number of categories including Cross-Channel Advertising\n\n#LI-Remote",
    "stack": []
  },
  {
    "title": "Senior Backend Engineer-MetaMask",
    "company": "Consensys",
    "dateCreated": "2024-11-26",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/02/15205748/consensys_software_inc_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-backend-engineer-metamask-25/",
    "description": "Title: Senior Backend Engineer – MetaMask\n\nLocation: UNITED STATES – Remote\n\nJob Description:\n\nUS or Remote (non-EU*, non-Australia, non-Canada)\n\nConsensys is the leading blockchain and web3 software company founded by Joe Lubin, CEO of Consensys and Co-Founder of Ethereum. Since 2014, Consensys has been at the forefront of innovation, pioneering technological developments within the web3 ecosystem.\n\nThrough our product suite, including the MetaMask platform, Infura, Linea, Diligence, and our NFT toolkit Phosphor, we have become the trusted collaborator for users, creators, and developers on their path to build and belong in the world they want to see.\n\nWhether building a dapp, an NFT collection, a portfolio, or a better future, the instinct to build is universal. Consensys inspires and champions the builder instinct in everyone by making web3 universally easy to use and develop on.\n\nOur mission is to unlock the collaborative power of communities by making the decentralized web universally easy to access, use, and build on.\n\nYou’ll get to work on the tools, infrastructure, and apps that scale these platforms to onboard one billion participants and 5 million developers. You’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects – challenging you to stay at the top of your game. You’ll join a network of builders that reaches the edge of our ecosystem. Consensys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nAbout MetaMask\n\nWe’re building for a future where the internet and world economy empowers people through interactions based on consent, privacy, and free association, where both communities and individuals flourish. To accomplish that, we’re working hard to make web3 accessible for everyone.\n\nMetaMask is both a crypto wallet and a gateway to the decentralized web. Our tools help people create communities, play video games, access financial services, make payments, invest in assets, protect against economic turmoil, and more. Our browser extension and mobile platforms meet the needs of millions of users and developers across the world.\n\nThe MetaMask Wallet API Platform Team\n\nEmpowering developers to deliver great decentralized user experiences is at the heart of MetaMask’s purpose. From the beginning, we have done so by providing the web with an API that allows any developer to turn their site or web-app into a decentralized app connected to the blockchain.\n\nCurrently the MetaMask Wallet API allows dApps to do things like: propose transactions to users, access the address of the users current account, use keys in MetaMask to help users encrypt and decrypt messages, propose to users that they sign specific messages, access the connected node/provider and call all methods on the Ethereum RPC API, and to propose that users add and switch to a specific network. We enhance and expand this list of capabilities and build tools to help other teams build new capabilities themselves.\n\nBy improving and expanding this API, we can make entirely new types of decentralized user experiences possible. There is also much work to do to make this API accessible for the many new developers joining our space.\n\nWe are hiring engineers to join our Wallet API Platform team and help us build the platform on which the world’s most exciting dapps will be built.\n\nWhat you’ll do\n\nBuild and maintain Wallet API infrastructure and tooling.\nHelp to manage and govern a pipeline of proposed new APIs.\nWork with partners and standards bodies across the Web3 ecosystem to shape wallet API standards.\n\nWould be great if you brought this to the role\n\nWe are looking for a senior software engineer who is:\n\nGrowth-minded and collaborative, and who thrives in an environment with some ambiguity, autonomy, and the freedom to experiment.\nProficient and thoughtful with asynchronous and synchronous communication and with giving and receiving feedback\nSupportive of their team’s collective performance and growth\nSuccessfully working in a fully remote environment, individually and within a team\nRespectful, patient, and empathic in every interaction and relationship with their coworkers and the community\nAble to work towards technical clarity amidst competing viewpoints\nEnthusiastic and unwavering on shipping high-quality code\nInterested in working with partners across the Web3 ecosystem on shared Wallet API standards\n\nThe Wallet API Platform team carries an important mission to craft and maintain the best API for developers so that MetaMask can continue to grow with the wider Web3 ecosystem.\n\nThe senior software engineer role is a critical part of this team. They would be responsible for creating and managing the API that all MetaMask developers are using. As web3 evolves, the API needs to evolve with the larger ecosystem. This requires a team of highly dynamic and agile software engineers to serve MetaMask’s developer community.\n\nBecause of the complexity and nascency of web3, most of our API have a very long lifecycle after being made publicly available. The engineer who takes on this role will be the guardian of a high-quality API with a long lifecycle in a rapidly evolving ecosystem. This engineer must have a long-term mindset when planning and designing the API as well as introducing any new major change.\n\nTechnical requirements:\n\n4 years of JavaScript, TypeScript, and Node.js experience\n2 years of experience working on a team of at least 3 other engineers with a strong focus on peer reviews\n1 year of working experience with building/deploying dapps and/or web3/ethers.js libraries\n2 years of experience with architecting, implementing, and/or managing externally-facing APIs (used by developers not belonging to the same organization)\n2 years of experience managing an existing codebase\n1 year of experience owning and managing unit, integration, end-to-end tests, and/or testing frameworks/strategies\n1 year of experience with JSON-RPC, Swagger, and/or OpenAPI\n\nBonus points:\n\nMobile development experience\nSecurity engineering\nInvolvement in EIP authoring or review processes\nBrowser APIs\n\nDon’t meet all the requirements? Don’t sweat it. We’re passionate about building a diverse team of humans and as such, if you think you’ve got what it takes for our chaotic-but-fun, remote-friendly, start-up environment-apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we’re ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills.\n\nUS pay range (not including bonus, equity or other benefits)\n\n$100,000—$237,000 USD\n\nIn the rapidly evolving Web3 space, we believe that everyone is a builder. This expansive paradigm requires a range of backgrounds, talents, skills, and experiences to influence and shape the future. At Consensys, this diversity fuels our ability to shift control and redefine the realm of possibility. We are committed to ensuring that our technology empowers people and communities with economic and political agency through decentralized technologies. We welcome the range of perspectives and differences and celebrate them. We’re excited to see how your unique skills as a builder can contribute to our vision, drive innovation, and help us shape a more inclusive Web3.\n\nConsensys is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law.\n\nPlease note that this role is not available to candidates from the European Union, Canada or Australia*",
    "stack": []
  },
  {
    "title": "Senior Backend Software Engineer - Contract Role",
    "company": "CrossFit",
    "dateCreated": "2024-11-26",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2023/08/21214629/Crossfit-Logo-150x150.jpeg",
    "descriptionLink": "https://remote.co/job/senior-backend-software-engineer-contract-role-25/",
    "description": "Senior Backend Software Engineer – Contract Role\n\nRemote\n\nIT\n\nContract\n\nRemote\n\nCrossFit is seeking a talented and motivated Senior Backend Software Engineer for a one-year contract to join our product and technology team. This presents a unique opportunity to play a pivotal role in the development of a new software stack and set of products that will directly impact the lives of millions of CrossFit athletes, trainers, and gym owners. CrossFit fosters a collaborative cross-functional team environment composed of backend engineers, frontend developers, devops, product managers, designers, and stakeholders who relentlessly strive to discover user needs and deliver effective solutions. Above all, we are looking for resourceful individuals who are passionate about software development and are eager to acquire and master the tools needed to accomplish the tasks at hand. While this role will primarily focus on backend systems, experience with full-stack development is an asset.\n\nThis is a contract position for one year.\n\nRESPONSIBILITIES:\n\nDesign, develop, and maintain reliable, scalable, and secure backend systems that power our mobile applications, web applications, and services.\n\nParticipate in cross-functional team discussions, providing ideas, solutions, and feedback to product managers, designers, and other stakeholders.\n\nActively track assigned tasks and effectively communicate progress to all team members, both verbally and in writing.\n\nAuthor software design documents and technical specifications.\n\nProvide support for the existing software stack with new features, bug triage, and fixes.\n\nWrite unit tests and integration tests to ensure code quality and comprehensive coverage.\n\nDesign and implement efficient database schemas, compose complex queries, and ensure data integrity.\n\nContribute to and enhance design and coding conventions.\n\nOffer constructive feedback to fellow engineers through design and code reviews to uphold code quality and consistency across the team.\n\nKNOWLEDGE AND SKILL:\n\nProficiency in Python programming.\n\nExpertise in designing, building, and testing web services.\n\nFamiliarity with Cloud Services (e.g., AWS) and a strong foundation in full-stack development.\n\nExperience working with relational and non-relational databases (e.g., MySQL, Redis, MongoDB), including schema design, query optimization, and data modeling\n\nProficiency in using version control systems (e.g., Git) and collaborative development workflows.\n\nFamiliarity with containerization and orchestration technologies (e.g., Docker, Kubernetes) is a plus.\n\nExcellent problem-solving skills, with the ability to tackle complex technical challenges.\n\nFamiliarity with managing PII (Personally Identifiable Information) and sensitive data is a plus.\n\nA passion for staying updated with the latest industry trends and technologies.\n\nEDUCATION/EXPERIENCE:\n\nBachelor’s or Master’s degree in Computer Science, a related field, or equivalent work experience.\n\nOver 8 years of development experience, including more than 5 years of work on backend systems.\n\nDemonstrated history of successful design and execution in software development.",
    "stack": []
  },
  {
    "title": "Front-End Engineer",
    "company": "Nebo Agency",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/09/17114317/nebo_agency_logo-150x150.png",
    "descriptionLink": "https://remote.co/job/front-end-engineer-24/",
    "description": "Front-End Engineer\n\nLocation:  United States – Remote\n\nJob Description:\n\nSimply put: Nebo’s engineering team gets things done. That usually looks like using the art of code to solve problems and build solutions for clients and coworkers alike. We don’t get hung up on what hasn’t been done – we’re all about what we can do. We’re looking for driven teammates who are ready to jump in and do the same.\n\nAbout Nebo\n\nNebo is a human-centered agency built on a culture of respect, professional growth and care for every employee. With numerous perks, including hybrid in-office/remote work or fully remote work options designed to fit your needs, unlimited PTO, and free attendance to local marketing events, join this fun-loving team that occasionally talks Slack Smack.\n\nAbout the position\n\nAs a front-end engineer at Nebo, you will bring well-designed website and interfaces to life with carefully crafted HTML, CSS, and JavaScript.\n\nBe prepared to work with our back-end, design, content and UX teams to maintain and develop features for existing web applications and websites and to build complex user interactions either from scratch or within existing frameworks.\n\nWe’re looking for someone with 2-5 years of professional coding experience and strong examples of previous work.\n\nHere are some of the technologies we use on a daily basis\n\nJavaScript / JQuery\nCSS / Sass\nGit / GitLab\nNebo CMS (our in-house Content Management System built and maintained by our team!)\n\nSkills Required\n\nProficient in HTML, CSS, SCSS, JavaScript, and JQuery\nPortfolio of designed and coded work\nFamiliar with Adobe creative tools\nAble to translate user experience and design into clean, modular, and scalable code that follows web standards\nAttention to detail\nGood communication skills\n\nThe things that will set you apart (AKA Bonus Skills)\n\nFamiliar with using Git and version control\nExperienced in React and Next.js\nAgency or fast-paced work environment experience\n\nNebo’s Commitment to Diversity & Inclusion\n\nAs a human-centered agency, we believe in uplifting our community and advancing society through inclusive business practices. We’re dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran’s status.",
    "stack": []
  },
  {
    "title": "Frontend Engineer",
    "company": "Rapptr Labs",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/01/01201955/rapptr_logo.jpeg",
    "descriptionLink": "https://remote.co/job/frontend-engineer-24/",
    "description": "Frontend Engineer\n\nLocation: USA\n\nRemote\n\nFull Time\n\nMid Level\n\nJob Description:\n\nRapptr Labs is looking for a talented front-end engineer to join our growing design and development agency, which is passionate about creating robust, pixel-perfect websites. You’ll work with our Clients, Designers, Product Managers, and other Engineers to create cutting-edge codebases for our clients’ diverse applications.\n\nThis is a temporary, three-month engagement, working 40 hours per week as a 1099 contractor. There is potential for a full-time, permanent position at the conclusion of the contract.\n\nThis position aligns with our core values, such as embracing challenges, continuous improvement, and having a genuine care for the work you do. With our remote-first culture, we welcome applicants from across the US.\nResponsibilities\n\nDevelop, maintain, and test high-quality code\nCollaborate with cross-functional teams to define, design, and ship new features.\nIntegrate third-party libraries and services like RevenueCat, Ably, OneSignal, and more.\nContribute to continuous improvement by researching new technologies and sharing knowledge with the team.\nKey Qualifications\n1-3 years experience with modern JavaScript frameworks (React)\nProven history of developing web applications preferably used by the general public\nAbility to pro-actively manage your time to ensure you’re maximizing your productivity for our clients\nAbility to effectively communicate challenges and issues both verbally and written.\nAlignment with Rapptr Labs’ core values, particularly embracing challenges and getting better every day.\nBonus Qualifications\nExperience working with previous development agencies.\nKnowledge of modern React frameworks such as NextJS, Gatsby, etc.\nKnowledge of CSS libraries such as Tailwind and Styled Components.\nUnderstand REST and/or GraphQL.\nKnowledge of additional libraries and tools utilized by our company, such as Launch Darkly, Optimizely, Ably, or Revenue Cat.\nEqual Opportunity Employer\n\nRapptr Labs is proud to be an Equal Opportunity Employer. We stand behind our culture, which values and celebrates diversity, inclusivity, and does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, parental status, disability status, or any other protected group. We believe that we are all better when we encourage, support, and respect the diversity in backgrounds, experiences, and skills that we each bring to the Rapptr team.",
    "stack": []
  },
  {
    "title": "Senior Full-Stack Developer (Angular and Node JS)",
    "company": "Softrams",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/08/01192640/softrams_llc_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-full-stack-developer-angular-and-node-js-23/",
    "description": "Title: Senior Full-Stack Developer (Angular and Node JS)\n\nLocation: Remote USA\n\nType: Full-Time\n\nWorkplace: remote\n\nCategory: Development\n\nJob Description:\n\nSoftrams is one of the fastest growing digital services firms in the Washington Metropolitan regions crafting human-centered solutions and empowering digital services with a focus on HX, AI, cloud, DevOps and cyber security. Our offices are located in Leesburg VA, Baltimore MD, and Plano TX, and our teams are spread across the U.S.\nRecognized as a Top Workplace USA (2024)\nRecognized as one of the Top Workplaces in Technology (2023, 2021)\nINC 5000, Fastest growing companies in America (2023, 2022)\nWashington Business Journal Top 75 Fastest Growing Companies in Greater Washington area\n2020 NXT UP – Top Federal Emerging Technology and consulting firms\n2020 Inaugural DC Metro’s Most Successful Companies\n2020 Washington Technology Fast 50\nNVTC Tech 100 (2020, 2019)\nJob Description:?\nSoftrams, LLC is looking for a full-time Senior Full Stack Developers proficient in Angular, TypeScript, Node JS who will be part of a collaborative and agile team that supports and builds modern, usable, and responsive applications for mission-critical U.S. federal government health IT solutions.\nFederal Requirements:??\nAbility to obtain a U.S. Federal position of Public Trust clearance designation.?\nMust reside in and be able to perform work in the United States.?\nMust have lived in the United States for 3 of the last 5 years.?\nRequired Qualifications:?\nBachelor’s degree in computer science or equivalent\n8 years of application development experience\n3+ years of hands-on experience with Angular, Typescript and NodeJS\n3+ years of Agile cloud development experience required\nHands-on experience with applications supported by Postgres databases\nExperience with development and maintenance using GitHub and Jenkins\nExperience with unit testing and code coverage (SonarQube) frameworks\nExperience working in agile environments using tools like Jira, Confluence, and Slack\nExperience working with AWS ecosystem and related tools and technologies\nAble to obtain a U.S. Federal Position of Trust clearance designation\nPreferred Qualifications:\nExperience with Postgres, Stored Procedures, and limited Python experience\nExperience with Electronic Data Interface (EDI) processing\nExperience with Java and related frameworks, Python is a plus\nExperience with 270/271 transactions and/or other X12 data formats\nExperience with healthcare data, specifically Medicare/Medicaid\nAWS certifications\nResponsibilities:?\nAnalyze and understand complex business and engineering challenges\nUnderstand user needs, and design end-to-end user experience with practical, reliable, and efficient solutions\nDesign modern, scalable, and open-source solutions, and architectures (web app, micro-services-based APIs, data stores) while taking an enterprise view of connected systems, interfaces, downstream impacts\nExplain complex solutions in simple and intuitive manner to different stakeholders.\nCollaborate with multiple small teams to design, develop and deliver product features incremental and iterative manner.\nBe a champion for modern application development practices and mentor team members towards them\nSupport test-driven development using various automated testing tools\nPerform as a great team player and solve challenges as part of a team\nExplore alternatives and quickly build prototyping to validate ideas and help iterate concepts\nBenefits and Perks:\n65%-75% company-sponsored (including dependents) premiums for medical, dental and vision insurance. For eligible plans and tiers, we provide 100% company-paid medical insurance. 100% employer sponsored STD, LTD and life insurance (min $100K). Voluntary life insurance option available.\nRetirement 401(k) plan with employer matching. Immediate vesting.\nVacation and sick leave.\nMaternity and parental leave.\nDiscretionary bonuses, spot awards, gifts, and tenure-based rewards.\nCompany-sponsored role-based training and certifications.\nMonthly DoordashDashPass subscription.\nGroup discounts via LifeMart ADP\nPublic Trust Clearance:\nThis role requires the hired candidate to go through public trust clearance. A minimum of 3 years of stay in the U.S. within the last 5 years is required to be eligible to qualify for public trust clearance sponsorship.\nWork Location:\nWe have open-collaboration offices in Leesburg VA and Baltimore MD for those who may prefer to work on-site. However, Softrams is a 100% remote-first team environment. Softrams works in the eastern time zone and standard work hours are 9am ET to 5pm ET with flexibility around start and end times based on team needs.\nAbout Softrams:\nSoftrams is a Maryland and Virginia-based small business information technology, consulting, and solutions provider specializing in emerging technologies for UX/UI, mobile apps, DevOps, big data analytics, data science, and cyber security. We offer innovative technology implementations and build customer-centric services that are simple, intuitive, scalable, efficient and usable.\nEEO Statement:\nSoftrams, LLC. is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. Softrams is committed to providing access, equal opportunity, and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. To request reasonable accommodation, or to participate in the job application or interview process, contact the Talent Acquisition Team atrecruiting@softrams.com\nKnow your rights poster: https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf",
    "stack": []
  },
  {
    "title": "Manager, Software Engineering (SlideShare Core Team, Full-stack)",
    "company": "Scribd",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/01165508/Scribd-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/manager-software-engineering-slideshare-core-team-full-stack-23/",
    "description": "Title: Manager, Software Engineering (SlideShare Core Team, Full-stack)\n\nLocation: Remote US Canada\n\nType: Full-Time\n\nWorkplace: remote\n\nCategory: Engineering\n\nJob Description:\n\nAt Scribd (pronounced “scribbed”), our mission is to spark human curiosity. Join our team as we create a world of stories and knowledge, democratize the exchange of ideas and information, and empower collective expertise through our three products: Everand, Scribd, and Slideshare.\n\nWe support a culture where our employees can be real and be bold; where we debate and commit as we embrace plot twists; and where every employee is empowered to take action as we prioritize the customer.\n\nOur flexible work benefit – Scribd Flex – enables employees, in partnership with their manager, to choose the daily work-style that best suits their individual needs. As an organization, we prioritize collaboration and intentional in-person moments to build culture and connection. For this reason, occasional in-person attendance is required for all Scribd employees, regardless of their location.\n\nAbout Scribd, Inc and the SlideShare Core Team\n\nScribd, Inc. is a multinational technology company focused on the written and spoken word across three products: Everand, Scribd, and SlideShare. We deliver knowledge, information, and inspiration to billions of people worldwide through a vast library of content, including 200 million documents, 25 million presentations, and 13 million books, audiobooks, podcasts, and magazines.\n\nSlideShare is the leading platform for sharing professional presentations and infographics. It has grown into a global hub for knowledge sharing, with millions of presentations available on virtually every topic. Professionals and learners alike come to SlideShare to get inspired to create their own presentations, accessing an extensive catalog of user-uploaded, high-quality content.\n\nAbout the role\n\nAs the Engineering Manager of SlideShare, you’ll lead a talented team with an entrepreneurial spirit, guiding them to take on new, high-impact challenges. You’ll help foster and maintain the scrappiness that has driven SlideShare’s success, while bringing expertise and process to enable scalable, sustainable growth. In this role, you’ll play a key part in shaping the team’s technical strategy, balancing the need for fast-paced execution with a commitment to long-term excellence and quality.\n\nAs the Engineering Manager for SlideShare, you:\nThrive in dynamic environments and enjoy working on teams that are evolving from a startup mindset.\nHave a proven ability to lead with both hands-on work and a vision for growth, guiding a lean team to achieve significant improvements in product delivery and stability.\nEnjoy partnering with product and design to creatively solve for business needs, and you actively align engineering output with company objectives.\nPartner with GenAI, ML, and Infrastructure teams, as well as other engineering disciplines, to deliver new experiences for SlideShare users.\nAre passionate about creating a culture that supports both individual growth and collaborative achievement, and you inspire your team to take ownership of SlideShare’s mission.\nWe’re looking for someone with:\n5+ years of software engineering experience with previous people management experience, ideally within high-growth environments\nTechnical depth in web engineering with familiarity in technologies relevant to SlideShare’s stack.\nStrong track record of building and upleveling engineering teams, establishing sustainable development practices, and delivering on roadmap goals.\nAbility to balance short-term deliverables with long-term strategic thinking, navigating both daily challenges and big-picture goals.\nProven commitment to mentorship, team growth, and career development for individual contributors.\nExperience with React, Ruby, and/or GraphQL is a plus.\n\nBenefits, Perks, and Wellbeing at Scribd\n\n*Benefits/perks listed may vary depending on the nature of your employment with Scribd and the geographical location where you work.\n\n. Healthcare Insurance Coverage (Medical/Dental/Vision): 100% paid for employees\n\n. 12 weeks paid parental leave\n\n. Short-term/long-term disability plans\n\n. 401k/RSP matching\n\n. Tuition Reimbursement\n\n. Learning & Development programs\n\n. Quarterly stipend for Wellness, Connectivity & Comfort\n\n. Mental Health support & resources\n\n. Free subscription to Scribd + gift memberships for friends & family\n\n. Referral Bonuses\n\n. Book Benefit\n\n. Sabbaticals\n\n. Company wide events\n\n. Team engagement budgets\n\n. Vacation & Personal Days\n\n. Paid Holidays (+ winter break)\n\n. Flexible Sick Time\n\n. Volunteer Day\n\n. Company-wide Diversity, Equity, & Inclusion programs\n\nWant to learn more about life at Scribd? www.linkedin.com/company/scribd/life\n\n—————————————————————————————————————————\n\nWe want our interview process to be accessible to everyone. You can inform us of any reasonable adjustments we can make to better accommodate your needs by emailing accommodations [@] scribd.com about the need for adjustments at any point in the interview process.\n\nScribd is committed to equal employment opportunity regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage people of all backgrounds to apply, and believe that a diversity of perspectives and experiences create a foundation for the best ideas. Come join us in building something meaningful.\n\n—————————————————————————————————————————\n\nRemote employees must have their primary residence in: Arizona, California, Colorado, Connecticut, Delaware, DC, Florida, Georgia, Hawaii, Iowa, Massachusetts, Maryland, Michigan, Minnesota, Missouri, Nevada, New Jersey, New York, Ohio, Oregon, Tennessee, Texas, Utah, Vermont, Washington, Ontario (Canada), British Columbia (Canada), or Mexico.\n\n#LI-Remote",
    "stack": []
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "Deque Systems",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2020/02/12103705/deque_systems-150x150.jpg",
    "descriptionLink": "https://remote.co/job/senior-full-stack-developer-23/",
    "description": "Senior Full Stack Developer\n\nLocation: Remote\n\nType: Full Time\nMin. Experience: Experienced\nCareer Fulfillment & Culture\n\nPeople come to work for Deque because of what we do: enable businesses and organizations to make their sites and apps accessible to everyone, including people with disabilities. The personal fulfillment employees feel here is unparalleled. In addition to the altruistic nature of our jobs, the organizational structure is extremely flat and welcoming. Women-owned and operated, Deque CEO Preety Kumar is internationally revered for her down-to-earth personality and work ethic. Deque’s core values are central to our culture of customer satisfaction. Do you share them?\n\nInnovation with results that matter\nDeliver what you promise\nCan-do attitude\nOpen, direct & respectful communications\nWe care deeply\nWe practice humility\n\nAt Deque, you’ll work with the best and brightest minds in the industry, sharing best practices, tackling new issues and uncovering new approaches. Accessibility Consultants at Deque also love their jobs because of the support systems in place.\n\nDeque experts regularly contribute to W3C Accessibility Working Groups and collectively hold more CPACC, WAS, & CPWA certifications issued by the IAAP than any accessibility testing company in the world.\n\nPosition Description\n\nWe are looking for an enthusiastic developer to join our team building for the axe DevTools Mobile platform. You’ll be working closely with our diverse, fully US remote team to implement innovative solutions used by development teams around the world. Your code will help teams build accessible mobile apps and make technology more inclusive for all.\nThe position is flexible for the right candidate. Upon joining the team, you’ll become an accessibility expert in your field and continue building with and supporting the latest technologies available. The ideal person will be able to independently propose and implement changes across web applications and have a sense of ownership of where the product is going\n\nPrimary Responsibilities\nBuild and maintain an Electron App for Mac & Windows deployment\nTake ownership and contribute to the axe DevTools for Mobile backend REST API service\nContribute to:\n axe DevTools for Mobile web dashboard\n an Appium Plugin (NodeJS package)\nDevelop new features, with unit and integration tests\nUpdate existing code, fix reported bugs\nOwn DevOps scripts for CI/CD and automated deployment\nWrite and review technical proposals\nReview pull requests and offer feedback, including security topics\nAid in creating and maintaining tickets for planning\nRequirements\nHave a drive to learn\nAbility to mentor team members in best practices as relates to development or accessibility\nRESTful API use, design, and implementation\nExperience in NodeJS with MySQL 8\nAmazon Web Services (AWS)\nElastic Container Service (ECS)\nFargate\nLambdas\nAmplify\nCloudformation\nJavaScript, React\nExperience building & deploying NodeJS packages\nHTML and CSS\nBasic secure web programming knowledge and experience\nCommon web application architectures such as n-tier, micro-services etc.\nVersion control (Github)\nAgile\nBe a part of a team environment (remotely)\nAbout Deque\n\nDeque (pronounced dee-cue) is a web accessibility software and services company, and our mission is Digital Equality.  We believe everyone, regardless of their ability, should have equal access to the information, services, applications, and everything else on the web.\nWe work with enterprise-level businesses and organizations to ensure that their sites and mobile apps are accessible. With over 475,000 extensions installed and over 5,000 audit projects completed, Deque is the industry standard. Join our growing family as we work to make the web a better place for everyone.\n\nJob Location\nRemote\nHow to Apply\nApply by submitting your resume and a cover letter. Applications without a cover letter will not be considered.\nIn your cover letter\nExplain your interest in joining Deque and how you align with our Core Values\nDepict key attributes that differentiate you as a candidate\n\nDeque is committed to providing Equal Employment Opportunities. Reference and background checks will be required. The expected salary range is 120K – 150K but is subject to change based on the skills, abilities, and experience of each candidate. The values listed are not intended to guarantee a salary for candidates or current employees.\n\nThank you for your interest in joining our exciting company!",
    "stack": []
  },
  {
    "title": "Senior Software Engineer - Web Video Players",
    "company": "Crunchyroll",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2023/10/03081849/Crunchyroll-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-software-engineer-web-video-players-23/",
    "description": "Title: Senior Software Engineer – Web Video Players\n\nLocation: San Francisco, CA, United States\n\nAbout Crunchyroll\n\nWE HELP EVERYONE BELONG. IT’S OUR PURPOSE.\n\nFounded by fans, Crunchyroll delivers the art and culture of anime to a passionate community. We super-serve over 100 million anime and manga fans across 200+ countries and territories, and help them connect with the stories and characters they crave. Whether that experience is online or in-person, streaming video, theatrical, games, merchandise, events and more, it’s powered by the anime content we all love.\n\nJoin our team, and help us shape the future of anime!\n\nAbout the role\n\nAs a Software Engineer on our web video player team, you will contribute to the development, and optimization of our web video player library. You will take ownership of key features and improvements, ensuring high-quality code and performance. You’ll collaborate with Engineering, Program Management, Product, and QA teams to help shape our technology roadmap and achieve our goals. You’ll be a part of an international team of 100+ client engineers, where your contributions will help maintain Crunchyroll’s position as the premiere Anime streaming service.\n\nContribute to the design and implementation of software solutions for web-based video player development\nCollaborate on the definition and development of technical solutions that improve existing features or enhance architectural quality, such as optimizing performance, scalability, and user experience for Crunchyroll’s web video player.\nIdentify performance bottlenecks and areas of improvement in the codebase that impact user experience or development efficiency, and work with senior engineers to propose and implement solutions.\nMaintain high coding standards and follow best practices in web development, contributing to a culture of engineering excellence within the team.\nParticipate in design and code reviews, providing feedback to ensure web product delivery and agreement on architectural strategies across the team.\nSupport a culture of operational excellence by focusing on efficient and maintainable engineering practices in your daily work.\nStay updated on industry trends and web development technologies by researching and comparing new tools and frameworks to help keep our web platform competitive.\n\nIn the role of Senior Software Engineer, you will report to the Manager, Software Engineering – Web Video Player.\n\nWe are considering applicants for the location(s) of San Francisco, CA, Culver City, CA, US-Remote\n\nAbout You\n\nYou are passionate about web development and the streaming space, with 8+ years of industry experience developing in JavaScript/TypeScript.\nYou are committed to upholding excellence in operations, delivery, and engineering practices.\nYou have experience building consumer-facing web applications.\nYou have contributed to web solutions that serve millions of global users.\nYou have worked with product and program management to support technology roadmaps and project goals.\nYou can demonstrate experience collaborating with senior engineers and team leads to lead web development initiatives.\nYou balance trade-offs between performance, scalability, and user experience.\nYou have familiarity with multimedia frameworks and protocols like MPEG-DASH, HLS, and video streaming technologies.\n\nAbout the Team\n\nThe “Video Player” team is a growing team of international engineers and technology leaders passionate about providing a world class streaming experience for our millions of Anime fans across the world. We provide and maintain solutions on all major device platforms. Your contributions on this team are front and center to our millions of fans, affecting the daily success of our company.\n\nWhy you will love working at Crunchyroll\n\nIn addition to getting to work with fun, passionate and inspired colleagues, you will also enjoy the following benefits and perks:\n\nReceive a great compensation package including salary plus performance bonus earning potential, paid annually.\nFlexible time off policies allowing you to take the time you need to be your whole self.\nGenerous medical, dental, vision, STD, LTD, and life insurance\nHealth Saving Account HSA program\nHealth care and dependent care FSA\n401(k) plan, with employer match\nEmployer paid commuter benefit\nSupport program for new parents\nPet insurance and some of our offices are pet friendly!\n\n#LifeAtCrunchyroll #LI-remote\n\nThe Pay Range for this position is listed. Actual pay will vary based on factors including, but not limited to location, experience, and performance. The range listed is just one component of Crunchyroll’s Total Rewards offerings for employees. Other rewards may include performance bonuses, employer matched retirement savings, time-off programs, and progressive health benefits and perks.\n\nPay Transparency – San Francisco, CA\n\n$185,440—$231,800 USD\n\nAbout our Values\n\nWe want to be everything for someone rather than something for everyone and we do this by living and modeling our values in all that we do. We value\n\nCourage. We believe that when we overcome fear, we enable our best selves.\nCuriosity. We are curious, which is the gateway to empathy, inclusion, and understanding.\nService. We serve our community with humility, enabling joy and belonging for others.\nKaizen. We have a growth mindset committed to constant forward progress.\n\nOur commitment to diversity and inclusion\n\nOur mission of helping people belong reflects our commitment to diversity & inclusion. It’s just the way we do business.\n\nWe are an equal opportunity employer and value diversity at Crunchyroll. Pursuant to applicable law, we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nCrunchyroll, LLC is an independently operated joint venture between US-based Sony Pictures Entertainment, and Japan’s Aniplex, a subsidiary of Sony Music Entertainment (Japan) Inc., both subsidiaries of Tokyo-based Sony Group Corporation.\n\nQuestions about Crunchyroll’s hiring process? Please check out our Hiring FAQs: https://help.crunchyroll.com/hc/en-us/articles/360040471712-Crunchyroll-Hiring-FAQs\n\nPlease refer to our Candidate Privacy Policy for more information about how we process your personal information, and your data protection rights: https://tbcdn.talentbrew.com/company/22978/v1_0/docs/spe-jobs-privacy-policy-update-for-crpa-dec-21-22.pdf\n\nPlease beware of recent scams to online job seekers. Those applying to our job openings will only be contacted directly from @crunchyroll.com email account.",
    "stack": []
  },
  {
    "title": "Front End Developer",
    "company": "LMI",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/02/21231526/LMI-Logo-150x150.jpeg",
    "descriptionLink": "https://remote.co/job/front-end-developer-21-3/",
    "description": "Front End Developer\n\nLocation: Remote United States\n\nJob Description:\n\nJob ID\n\n2024-1217\n\nCategory\n\nInformation Technology\n\nOverview\n\nLMI is seeking an experienced Front-End Developer to join a high performing team supporting a government healthcare client. This position may be remote.\n\nLMI: Innovation at the Pace of Need™\n\nAt LMI, we’re reimagining the path from insight to outcome at the new speed of possible. Combining a legacy of over 60 years of federal expertise with our innovation ecosystem, we minimize time to value and accelerate mission success. We energize the brightest minds with emerging technologies to inspire creative solutioning and push the boundaries of capability. LMI advances the pace of progress, enabling our customers to thrive while adapting to evolving mission needs.\n\nResponsibilities\nCollaborate with designers and backend developers to implement front-end features and user interfaces.\nWrite clean, maintainable, and efficient code using Javascript, HTML, and CSS.\nEnsure cross-browser compatibility and optimize for desktop and mobile.\nImplement responsive design principles to ensure seamless user experience across various screen sizes.\nConduct thorough testing and debugging.\nParticipate in code reviews and provide constructive feedback to maintain code quality and best practices.\nWork closely with stakeholders to understand requirements and contribute to project planning and estimation.\nCreate technical documentation for reference and reporting.\nQualifications\n\nRequired:\n\nMinimum of 5 years’ relevant experience and a STEM BS degree (or equivalent experience).\nProven experience as a Front-End Developer or similar role.\nProficiency in Javascript, HTML, and CSS.\nExperience with modern front-end frameworks/libraries such as Vue, React, and/or Angular.\nExperience with responsive design techniques and cross-browser compatibility testing.\nExperience with version control systems such as Git and/or Bitbucket.\nExperience with Agile development methodologies.\nStrong problem-solving skills and attention to detail.\nExcellent communication and collaboration abilities.\nAbility to work effectively in a fast-paced environment and manage multiple priorities.\n\nDesired:\n\nAgile, Lean, DevOps, Cloud, Security+ or other professional certification\nFamiliar with federal security standards\nExperience with C# .NET, and/or NodeJS.\nExperience with Cloud infrastructure such as Amazon Web Services or equivalent.\nAbility to manipulate and analyze data.\nExperience working in a consultant/client environment.\n\nApply for this job online\n\nEmail this job to a friend\n\nShare on your newsfeed\n\nLMI is an Equal Opportunity Employer. LMI is committed to the fair treatment of all and to our policy of providing applicants and employees with equal employment opportunities. LMI recruits, hires, trains, and promotes people without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, pregnancy, disability, age, protected veteran status, citizenship status, genetic information, or any other characteristic protected by applicable federal, state, or local law. If you are a person with a disability needing assistance with the application process, please contact accommodations@lmi.org\nColorado Residents: In any materials you submit, you may redact or remove age-identifying information such as age, date of birth, or dates of school attendance or graduation. You will not be penalized for redacting or removing this information.",
    "stack": []
  },
  {
    "title": "Staff Backend Engineer, Enterprise Workflows",
    "company": "Webflow",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/01/17093139/webflow_inc__logo.jpeg",
    "descriptionLink": "https://remote.co/job/staff-backend-engineer-enterprise-workflows-21/",
    "description": "Title: Staff Backend Engineer, Enterprise Workflows\n\nLocation: U.S. Remote\n\nJob Description:\n\nWebflow is a visual web development platform that empowers non-coders to create incredible experiences for the web. By combining modern web development technologies into one platform, Webflow enables people to build websites visually, saving engineering time, while clean code seamlessly generates in the background. From independent designers and creative agencies to Fortune 500 companies, millions worldwide use Webflow to be more nimble, creative, and collaborative. It’s the web, made better.\n\nThe Enterprise Workflows team at Webflow builds and maintains collaboration features that support the needs of larger teams. We work to ensure teams can build and launch sites swiftly without compromising on quality or security. We’re looking for a Staff Backend Engineer who has empathy for customers and a desire to empower our customers’ teams to work together with confidence.\n\nAbout the role\n\nLocation: San Francisco HQ, US Remote, or ON/BC, Canada\nFull-time\nPermanent\nExempt\nThe cash compensation for this role is tailored to align with the cost of labor in different geographic markets. We’ve structured the base pay ranges for this role into zones for our geographic markets, and the specific base pay within the range will be determined by the candidate’s geographic location, job-related experience, knowledge, qualifications, and skills.\nCanada (All figures cited below in CAD and pertain to workers in ON & BC, Canada)\nZone A: $187,000 – $263,500\nZone B: $175,000 – $247,000\nZone C: $164,000 – $231,500\nCAD 212,000 – CAD 299,000\nUnited States (all figures cited below in USD and pertain to workers in the United States)\n\nAs Staff Backend Engineer, you’ll:\n\nArchitect, design, and implement scalable multi-tenant backend services and APIs.\nWork on technologies such as Node.js, Javascript/Typescript, MongoDB, GraphQL, Apollo, Amazon Web Services EC2, S3, Lambdas, Kafka, and more.\nDemonstrable solid experience and deep expertise in multiple technical domains.\nContribute to building and executing on functional strategy.\nLead projects that directly contribute to team and engineering organization’s deliverables.\nProduce and elevate the quality of maintainable, tested, performant, and scalable code.\nAuthor, collaborate on, and evaluate design documents.\nInfluence technical designs and team-level prioritization as well as participate in technical solutions.\nMotivate and empower teammates to achieve a higher level of performance.\nCollaborate product managers and designers in an autonomous, supportive team environment.\nMentor junior engineering in technical skills and Webflow culture.\nParticipate in engineering citizenship activities such as co-authoring engineering blogs, strengthening and improving our hiring processes, and leading internal hackathon teams.\n\nIn addition to the responsibilities outlined above, at Webflow we will support you in identifying where your interests and development opportunities lie and we’ll help you incorporate them into your role.\n\nAbout you\n\nYou’ll thrive in this role if you:\n\nHave 7+ years developing and deploying web applications, with a proven track record of shipping code.\nAre familiar with Node.js and TypeScript and can write scalable services and APIs using Express.js and MongoDB.\nHave led and mentored other software engineers and helped them achieve their career goals.\nCan debug production issues across services and multiple levels of the stack.\nProven experience building complex web systems.\nExperience with testing frameworks (e.g. Jest, Mocha, Playwright, Cypress).\nAre comfortable working in an agile, safe-to-fail, environment.\n\nOur Core Behaviors:\n\nObsess over customer experience. We deeply understand what we’re building and who we’re building for and serving. We define the leading edge of what’s possible in our industry and deliver the future for our customers\nMove with heartfelt urgency. We have a healthy relationship with impatience, channeling it thoughtfully to show up better and faster for our customers and for each other. Time is the most limited thing we have, and we make the most of every moment\nSay the hard thing with care. Our best work often comes from intelligent debate, critique, and even difficult conversations. We speak our minds and don’t sugarcoat things – and we do so with respect, maturity, and care\nMake your mark. We seek out new and unique ways to create meaningful impact, and we champion the same from our colleagues. We work as a team to get the job done, and we go out of our way to celebrate and reward those going above and beyond for our customers and our teammates\n\nBenefits & wellness\n\nEquity ownership (RSUs) in a growing, privately-owned company.\n100% employer-paid healthcare, vision, and dental insurance coverage for employees and dependents (full-time employees working 30+ hours per week), as well as Health Savings Account/Health Reimbursement Account, dependent care Flexible Spending Account (US only), dependent on insurance plan selection where applicable in the respective country of employment; Employees may also have voluntary insurance options, such as life, disability, hospital protection, accident, and critical illness where applicable in the respective country of employment\n12 weeks of paid parental leave for both birthing and non-birthing caregivers, as well as an additional 6-8 weeks of pregnancy disability for birthing parents to be used before child bonding leave (where local requirements are more generous employees receive the greater benefit); Employees also have access to family planning care and reimbursement\nFlexible PTO with a mandatory annual minimum of 10 days paid time off for all locations (where local requirements are more generous employees receive the greater benefit), and sabbatical program\nAccess to mental wellness and professional coaching, therapy, and Employee Assistance Program\nMonthly stipends to support health and wellness, smart work, and professional growth\nProfessional career coaching, internal learning & development programs\n401k plan and pension schemes (in countries where statutorily required) financial wellness benefits, like CPA or financial advisor coverage\nDiscounted Pet Insurance offering (US only)\nCommuter benefits for in-office employees\n\nTemporary employees are not eligible for paid holiday time off, accrued paid time off, paid leaves of absence, or company-sponsored perks unless otherwise required by law.\n\nRemote, together\n\nAt Webflow, equality is a core tenet of our culture. We are an Equal Opportunity (EEO)/Veterans/Disabled Employer and are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law. Pursuant to the San Francisco Fair Chance Ordinance, Webflow will consider for employment qualified applicants with arrest and conviction records.\n\nStay connected\n\nNot ready to apply, but want to be part of the Webflow community? Consider following our story on our Webflow Blog, LinkedIn, X (Twitter), and/or Glassdoor.\n\nPlease note:\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Upon interview scheduling, instructions for confidential accommodation requests will be administered.\n\nTo join Webflow, you’ll need a valid right to work authorization depending on the country of employment.\n\nIf you are extended an offer, that offer may be contingent upon your successful completion of a background check, which will be conducted in accordance with applicable laws. We may obtain one or more background screening reports about you, solely for employment purposes.\n\nFor information about how Webflow processes your personal information, please review Webflow’s Applicant Privacy Notice.",
    "stack": []
  },
  {
    "title": "Ruby Developer",
    "company": "IntelliBridge",
    "dateCreated": "2024-11-25",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/21193315/intellibridge_logo.jpeg",
    "descriptionLink": "https://remote.co/job/ruby-developer-21/",
    "description": "Ruby Developer\n\nFull Time-Regular\n\nRemote, US\n\nClearance: Public Trust (preferred)\n\nLocation: Remote \n\nOverview:\n\nIntelliBridge is looking for a Ruby on Rails Developer to be part of a growing team in the federal sector.\n\nThis candidate must have excellent written and oral communication skills and be adaptive to the changing needs of the organization. This candidate must have experience with building and maintaining highly effective relationships with team members and multiple stakeholders across multiple projects.\n\nThe Developer shall be responsible for the development, testing, and maintenance of applications utilizing Ruby on Rails and related technologies.\n\nAs a direct employee of IntelliBridge, you would receive a benefit package that includes health/dental/vision insurance coverage, 401K with company match, PTO & paid holidays, and annual tuition/training assistance.\n\nClearance:  \n\nPublic Trust\n\nResponsibilities/Duties: \n\nProvide support for the full life cycle of software product development\nDesign, create and maintain efficient, reusable, and reliable Ruby code\nIntegrate user-facing elements developed by front-end developers with server-side logic\nIdentify bottlenecks and bugs, and devise solutions to these problems\nHelp maintain code quality, organization, and configuration management activities\nConduct software testing to ensure the satisfaction of application development requirements\nEvaluate new software products and technologies, and provide recommendations to enhance existing systems\nDocument software procedures and develop software reports, plans, and products, such as software development plans, software requirements specifications, software design documents, software development files, source code, version description documents, and test plans\nSupports technical team as needed\nDevelops and provides training as needed\nDevelops technical documentation as needed\n\nRequired Qualifications:\n\nBachelor’s Degree with 5+ years of experience in software development\n5 years of experience with Ruby as a programming platform to develop multi-tier web-based applications\nUnderstanding of Ruby on Rails Best Practices\nExperience with consumption and creation of REST based APIs in Rails.\nCommitment to solid test coverage using tools like Cucumber, RSpec, Cypress, Capybara, Watir, or MiniTest\nParticipate in software development to support enhancements of front-end user interfaces using React as a programming language.\nExperience working within proper Software Configuration Management processes, utilizing source code control, and change management software\nExperience with front-end web development (Bootstrap, HTML5, CSS3, JavaScript, jQuery)\nExperience working in Agile environments\nJavaScript/TypeScript\nReact\nuseMemo/useCallback\nHigher order components (HOC) / custom hooks\nContext provider patterns\nReact Router\nRedux/RTK Query\nMust be a US Citizen and be able to pass an extensive background investigation for a security clearance.\n\nPreferred Qualifications: \n\nUSCIS or DHS Experience\n\nAbout Us: \n\nIntelliBridge delivers IT strategy, cloud, cybersecurity, application, data and analytics, enterprise IT, intelligence analysis, and mission operation support services to accelerate technical performance and efficiency for Defense, Civilian, and National Security & Federal Law Enforcement clients.",
    "stack": []
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "Nethermind",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/02/15211234/nethermind_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-full-stack-developer-18-2/",
    "description": "Title: Senior Full Stack Developer\n\nRemote, Worldwide\n\nWhat are we all about?\n\nWe are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.\n\nOur expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.\n\nWorking to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.\n\nToday, we are a 350+ strong team working remotely across 66+ countries.\n\nView all our open positions here: https://www.nethermind.io/open-roles\n\nRole Overview:\n\nAs a Senior Full Stack Engineer, you will be responsible for designing, developing, and maintaining both frontend and backend components. You will work closely with product managers, designers, and other engineers to deliver high-quality, secure, and scalable solutions that meet the needs of our clients. This role requires a deep understanding of both frontend technologies like React and backend systems.\n\nWe are looking for candidates located in the EMEA region.\n\nWhy You’ll Love This Role\n\nImpactful Work: Your contributions will directly influence the way stakeholders interact with and perceive the security of blockchain networks through both the dashboard and the Insights API.\nCollaborative Environment: Join a team of passionate professionals who are committed to innovation, quality, and making a tangible impact in the blockchain space.\nProfessional Growth: Enjoy opportunities for professional development and career progression in a rapidly evolving industry.\n\nAbout You\n\nAn ideal candidate has 5+ years of Full-Stack Development experience and contributed to blockchain-related projects. We are looking for candidates who have worked on complex projects in a distributed team.\n\nProblem-Solving Attitude: Creative thinker with a knack for solving intricate technical challenges.\nCommunication: Excellent communication skills, with the ability to convey technical concepts to non-technical stakeholders.\nAutonomous: The ability to work independently, make informed decisions, and take initiative without needing constant supervision, ensuring high productivity and effective problem-solving.\nMentorship and Leadership: Provide technical guidance and mentorship to team members, fostering a culture of continuous learning and improvement.\n\nResponsibilities:\n\nCollaborate with cross-functional teams, including product managers, designers, and other developers, to deliver high-quality projects on time.\nWriting clean, efficient, and maintainable code: Writing code that is easy to understand and modify is crucial.\nDebugging and testing: Ensuring that the frontend code is error-free and performs optimally through debugging tools and testing methodologies.\nStaying up-to-date with emerging trends and technologies: The web development industry is constantly evolving, and it is essential to stay current with the latest technologies, trends, and best practices.\nDocumenting code and maintaining code repositories: To ensure that the development team can easily understand and modify the codebase, it is crucial to document your code and maintain code repositories.\nParticipating in code reviews: Code reviews help identify potential issues and ensure that the codebase meets quality standards. You should be prepared to participate in code reviews and provide feedback on other team members’ code.\nAssisting with deployment: You may be involved in the deployment process, which includes configuring web servers, managing version control systems, and resolving any issues that arise during deployment.\nProvide guidance and mentorship to more junior developers, promoting continuous learning and improvement within the team.\n\nSkills:\n\nExcellent skills in modern JavaScript/Typescript, Go, Rust, Python or Java\nA deep understanding of the architecture of modern client- and server-side React applications\nExperienced in designing scalable APIs\nExperienced in testing backend and frontend\nExperienced in modern database design and interaction (SQL and/or NoSQL)\nExpertise in architecture principles, design patterns, and the ability to analyze and address trade-offs in business requirements, system performance, reliability, and maintainability\nExperience in working closely with a DevOps team to design and deploy cloud-native infrastructure, to ensure scalability and reliability\n\nNice to have:\n\nBlockchain application experience (e.g. DeFi Protocols, Wallets, DEXs, block explorers, blockchain user-facing applications)\nExperience with smart contract development and interaction (e.g., Solidity, Web3.js, ethers.js)\nSmall team leadership experience\nFinancial Services and Markets understanding\n\nDisclaimer: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.\nYour consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io\n\nKeep up to date on what we are working on by following us on our social channels",
    "stack": []
  },
  {
    "title": "Software Engineer, Full Stack (Portfolio Management)",
    "company": "Human Interest",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2021/01/26171329/human_interest-150x150.jpg",
    "descriptionLink": "https://remote.co/job/software-engineer-full-stack-portfolio-management-17/",
    "description": "Title: Software Engineer, Full Stack (Portfolio Management)\n\nLocation: United States, Remote\n\nJob Description:\n\nHuman Interest is on a mission to ensure that people in all lines of work have access to retirement benefits.\n\nNearly half of all working Americans are not saving enough for their future. Too often it’s because they are employed by a company that doesn’t offer a retirement plan. Human Interest is changing that by making it affordable and accessible for small and medium-sized businesses to offer employees a path to financial independence through retirement savings.\n\nWe’re a high-growth tech company changing the retirement industry. We’ve raised $500M and are backed by leading investors. Most recently, by funding from BlackRock as well as many other top investors: TPG (The Rise Fund) with SoftBank led our Series D, Glynn Capital, NewView Capital, USVP, Wing, Uncork, and others.\n\nOur engineering organization aims to redefine the retirement services space with software that provides an effortless, efficient, scalable, and reliable user experience.\n\nWe value continuous improvement, emphasizing documentation, security, consistency, and scalability.\nWe help each other be better engineers, ensuring we leave things better than we found them.\nWe are customer-focused, ensuring our software improves the customer experience.\n\nAbout the Team\n\nThe Portfolio Management team is responsible for the software system that manages each participant’s retirement strategy. We seek to offer participants a wide set of investment options while building an effortless experience. Our offerings will enable participants to balance market risk versus reward with the ultimate goal of reaching their target savings and financial security at the time of retirement. Our products and solutions provide an investment experience that is accurate, timely, secure, auditable, scalable, and allows HIA and Plan Admins to maintain their fiduciary duty. Our team regularly undertakes projects that are critical to the company’s success, often ranking as a top company goal. We are excited to be growing our team in 2024 to seize new and exciting business opportunities. In 2024 and beyond we will develop new products, features, and services from scratch that cater to a new set of partners and unlock new business opportunities. We are one of the teams contributing to offerings that will provide significant new growth for the company.\n\nWhat you get to do every day\n\nCollaborate with product managers and engineers to define technical requirements on the new user experience workflows\nDesign, build, and maintain our user experiences for both external and internal customers.\nImplement front end User Interfaces in ReactJS\nImplement changes in back end Rest and GraphQL APIs in Node.js\nMake changes to existing backend services, workflows and front end User Interfaces to create a seamless experience\nWrite clean, high-quality code and tests to keep our system fast, reliable, and easy to maintain\nCreate adequate test cases, write tests to ensure full functionality\nCollaborate with other engineers and stakeholders to share knowledge and build expertise.\nContribute to our evolving engineering standards, tooling, and processes\n\nWhat you bring to the role\n\n5+ years of software engineering experience.\nStrong technical skills and are an excellent collaborator.\nYou like solving for ambiguity – we’ll look to you for ideas on how to solve problems.\nYou implement systems large or small that are clear, maintainable, and correct.\nYou are excited by opportunities to both break ground on new projects and provide fresh perspective onto past implementations.\nYou want to build and own your work end-to-end.\nYou are eager to move fast, but recognize when to build for the future.\nTop notch communication skills. You can communicate well with engineers as well as non-engineers.\nIndustry experience developing scalable, production quality backend systems.\nA desire to work with JavaScript or TypeScript\n\nNice to hav\n\nExperience architecting complex SaaS products with Service Oriented Architecture (SOA) and microservices.\nFamiliarity with our tech stack – Node.js, React.js, GraphQL, PostgreSQL, AWS</li>\nStrong knowledge of TypeScript.\nPast experience working with cloud technologies such as AWS or Microsoft Azure.\n401k or finance tech background.\nSelf-driven and willing to learn.\nProficiency with Git as a version control system.\n\nWhy you will love working at Human Interest\n\nMission – Highly collaborative startup dedicated to supporting employee engagement and growth. It’s an opportunity to help solve one of the biggest unsolved problems in America: saving for retirement.\n\nCulture – Our operating principles define how we come together as a team to do our work. They reflect Human Interest’s unique view on what’s important and what’s right. Documenting this core aspect of our culture helps employees make good decisions on their own. It also helps candidates considering career opportunities critically evaluate whether they will thrive at Human Interest.\n\nCustomer obsession\nLong-term orientation\nAutonomous and accountable teams\nAn escalating bar for talent and performance\nFundamental optimism\n\nCompensation – At Human Interest, there are a number of factors that are used to determine the appropriate pay range for each position. We take into account the cost of labor for each position in various markets across the US. The base salary for this position spans $160,000 – $185,000 and represents the minimum in our lowest geographic region to a maximum in our highest geographic region. The salary that we offer to a new employee within this range is based on their location within the US, their relevant job-related skills, and experience. At Human Interest, base salary is one component of the overall Total Rewards package. Depending on the position, additional compensation components such as bonus, commission, and equity may be offered. All of our employees are offered a robust suite of physical, financial and mental wellness benefits.\n\nBenefits –\n\nA great 401(k) plan: Our own! Our 401(k) includes a dollar-for-dollar employer match up to 4% of compensation (immediately vested) and $0 plan fees\nTop-of-the-line health plans, as well as dental and vision insurance\nGenerous PTO and parental leave policies\nAddition Wealth – Unlimited access to digital tools, financial professionals, and a knowledge center to help you understand your equity and support your financial wellness\nLyra – Enhanced Mental Health Support for Employees and dependents\nCarrot – Fertility healthcare and family forming benefits\nCandidly – Student loan resource to help you and your family plan, borrow, and repay student debt\nMonthly work-from-home stipend; quarterly lifestyle stipend\nEmployee Resource Groups including Veterans, Lift Ev’ry Voice, Pride, LatinX, Families, and Women in Tech\nFun online and regional events and celebrations and department and company offsites\nThe vast majority of our positions can be 100% remote\n\nWe’re a great place to work (but don’t take our word for it)\n\nHere’s a list of our awards and accolades:\n\nCertified as a Great Place To Work (2023-2024)\nFortune Best Place to Work in the Bay Area (2024)\nBest Places to Work by Built In (2023-2024)\nAmerica’s Best Startup Employers by Forbes (2020-2022, 2024)\nA Top Company by Y Combinator (2020-2023)\nInc. Fastest Growing Companies (2021)\n\nHuman Interest is an equal opportunity employer. All applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran or military status, pregnancy, or any other characteristics protected under federal, state, or local laws.\n\nd resumes from any source other than directly from candidates. We will not consider resumes from vendors including and without limitation search firms, staffing agencies, fee-based referral services, and recruiting agencies.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider employment-qualified applicants with arrest and conviction records. We comply with CCPA guidelines.\n\nSee more: https://humaninterest.com/disclosures",
    "stack": []
  },
  {
    "title": "Senior Staff Full Stack Engineer (GrowthTech)",
    "company": "Honor",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/09/25202948/joinhonor_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-staff-full-stack-engineer-growthtech-17/",
    "description": "Title: Senior Staff Full Stack Engineer (GrowthTech)\n\nLocation: Remote\n\nJob Description:\n\nHonor exists to expand the world’s capacity to care.\n\nWe’re combining high tech with high-touch to deliver better home care for aging adults, better jobs for Care Professionals, and entirely new offerings to support the aging journey, at scale.\n\nFounded in 2014, and now a Series E funded “Unicorn” valued at over $1B, Honor leads the world’s largest home care network with the most advanced care platform. Our August 2021 acquisition of Home Instead has created a global company that’s revolutionizing how society cares for older adults, their families, and Care Professionals.\n\nThe Honor Care Platform combines local care and the most advanced technology to bring the highest quality care to more aging adults.\n\nGrow at Honor as part of a united team where everyone shows up authentically, shares ideas bravely, and solves complex problems!\n\nAbout the Work:\n\nWe’re seeking a Senior Staff Engineer to join our team and work on the product that powers our operations team in delivering high-quality home care. As a Senior Staff Full-Stack Engineer, you’ll collaborate with product managers and stakeholders to define, design, and implement solutions that address both immediate needs and long-term goals. This role requires someone who thrives in ambiguity, can tackle technical debt, and delivers innovative products that make an impact.\n\nThe ideal candidate is motivated by delivering business value and thrives in environments where systems may vary in maturity. They are comfortable navigating and making thoughtful tradeoffs in complex technical decisions. You will join a small, talented team of passionate engineers, where your contributions will play a key role in shaping the future evolution of our home care operations platform.\n\nResponsibilities:\n\nOwn the end-to-end design and development of features in a full-stack environment.\nCollaborate closely with product management and cross-functional teams to translate business needs into technical solutions.\nIdentify opportunities for unlocking insights and data driven actions for our franchise owners.\nDrive continuous improvement and innovation within the product space, with cross functional input.\nMentor and guide other engineers, contributing to a culture of technical excellence.\n\nQualifications:\n\nStrong proficiency in Python, React, and AWS.\nProven ability to work through ambiguity and solve complex problems.\nExperience managing technical debt while delivering new features.\nExcellent communication and collaboration skills, with a deep understanding of how to work effectively in a remote environment.\nA commitment to owning work from end to end.\nPrior experience on data products or interest in foundational data analytics is a plus.\n\nThe tech stack you’ll work with includes: Python, Thrift, MySQL, AWS, JavaScript, Looker, GitHub, DataDog\n\nAbout you:\n\nYou thrive in a diverse, cross-functional team, collaborating with people throughout the company\nYou enjoy building clean interfaces and connecting them to backend services\nYou’ve built and maintained production-grade features in Python, or have transferable experience in common languages like Node.js and are willing to learn Python\nYou know how to design relational database models, and have used a relational database at scale\nYou’ve been a key contributor to the design and implementation of large, complex projects\nYou are comfortable working in and refactoring legacy, monolithic code\nYou are a strong communicator, both verbally and in writing\nYou have experience building distributed systems and cloud services like AWS, GCP\nYou are willing to participate in an on-call rotation in collaboration with our tier 1 support team (about 7 days per quarter)\n\nYour skills and experience include:\n\nExperience working at a technology startup\nExperience working with an RPC architecture\nYou are knowledgeable about microservice architecture and best practices\nYou are comfortable with frontend development and have experience with JavaScript frameworks like React\nExperience leveraging observability and monitoring tools like DataDog\nYou enjoy mentoring and spreading knowledge to other engineers\n\nPerks & benefits:\n\nRemote-first work model lets you work from anywhere in the U.S. and occasionally pop into a satellite office\nCompetitive salary\nEquity in the company\nComprehensive medical, mental health, dental, vision, and life insurance\nEmployer-matched 401(k)\nFlexible PTO (manager approval)\nDiverse environment\nMonthly stipend to offset home office expenses\n\nOur range reflects the hiring range for this position. We use national average to determine pay as we are a remote first company. Individual pay is based on a number of factors including qualifications, skills, experience, education, and training.\n\nBase pay is just a part of our total rewards program. Honor offers generous equity packages that increase with position level and responsibilities, and a 401K with up to a 4% employer match.\nWe provide medical, dental and vision coverage including zero cost plans for employees. Short Term Disability, Long Term Disability and Life Insurance are fully employer paid with a voluntary additional Life Insurance option. We offer a generous time off program, mental health benefits, wellness program, and discount program.\n\nHiring Salary Range\n\n$219,800 – $250,000 USD\n\nWhat’s next?\n\nHonor is remote friendly! We’re hiring across the U.S., with an entirely virtual interview and onboarding process. Most of our positions are remote/work from home and do not require permanent relocation. As conditions allow, we have office space for in-person collaboration in our San Francisco Bay Area, CA, Austin, TX, and Omaha, NE hubs. If you’re looking for a great job that offers you the opportunity to work from home, we’d love to talk to you.\n\nWant to know more about why Honor is a great place to work? Check out our perks!\n\nWe value people! These four people-centric values guide the ways we work and decisions we make every day.\n\nThis role doesn’t sound quite right? Send this application to a friend who may be a fit and check out our other available roles!\n\nHonor is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), national origin, age, disability, genetic information, political affiliation or belief.\n\nHonor is an E-Verify company. For more information please review our Participation and your Right to Work\n\n#LI-Remote",
    "stack": []
  },
  {
    "title": "Frontend Engineer - Payments, Optimized Checkout and Link",
    "company": "Stripe, Inc.",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/23212607/stripe_logo.jpeg",
    "descriptionLink": "https://remote.co/job/frontend-engineer-payments-optimized-checkout-and-link-17/",
    "description": "Title: Frontend Engineer – Payments, Optimized Checkout and Link\n\nLocation:\n\nRemote locations: Remote in United States\n\nTeam: Payments\n\nJob type: Full time\n\nJob Description:\n\nWho we are\n\nAbout Stripe\n\nStripe is a financial infrastructure platform for businesses. Millions of companies-from the world’s largest enterprises to the most ambitious startups-use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\n\nAbout the organization\n\nStripe’s Payments and Risk organizations are at the heart of Stripe’s business. They are responsible for enabling our users to accept payments worldwide, in a secure and reliable fashion.\n\nYou may work on a wide variety of critical business areas including:\n\nPayins: The Payins organization oversees the fundamental primitives of collecting payments across the Stripe ecosystem. Custodians of mission-critical foundations, and stewards of essential administrative payment workflows, merchants rely on us to innovate on the fundamentals. We act as catalysts towards realizing Stripe’s flexible and extensible multi-product platform.\nOptimized Checkout & Link: The Optimized Checkout and Link teams focus on building best-in-class checkout experiences that provide delightful checkout experiences for customers, while driving higher purchase conversion for merchants. As an organization, we work on Checkout, Payment Links, Elements, Payment Methods, and Link – each playing a crucial part in augmenting the economic landscape of the internet.\n\nWithin this organization, we are looking for frontend engineers across a few different areas:\n\nProduct: You’ll join a payments team building high-quality UIs for merchants’ checkout pages or the Stripe Dashboard working with experienced frontend and full-stack engineers to deliver world-class checkout experiences. You’ll work with engineers, product managers, designers, and stakeholders across the organization to build new features and products across Elements, Checkout, and Link.\nFrontend Platform: As a platform engineer you will be building tools and systems to enable a 100+ engineering organization to deliver delightful frontend features for millions of Stripe merchants. Our team places a heavy emphasis on being domain experts on how to develop reliably and safely for the web platform at a very high scale.\nExperimentation/Growth: As part of a growth-focused engineering team, you will improve our buyer-facing experiences, experimentation foundations, and systems that power intelligence to improve a consumer’s experience and checkout conversion. This is a new, exciting area of focus for our organization, and we are looking for frontend engineers with growth or experimentation expertise to help us deliver more experiments than we’ve ever run before, and help us improve our foundations. You’ll work closely with data science, product managers, and designers to create, build, and execute buyer experiments efficiently.\n\nAs a frontend engineer at Stripe, you’ll join fast-moving teams building consumer-focused UIs and full-stack products. You’ll work with experienced engineers, product, design, and data science to conceive of and deliver world-class solutions to end-users problems.\n\nResponsibilities\n\nWork with a wide range of systems, processes, and technologies to own and solve problems from end-to-end.\nBuild elegant APIs and user experiences that enable merchants to run and scale their businesses on top of Stripe.\nCraft new products and features that impact millions of people and businesses around the world such as building the fastest and most seamless checkout flow.\nExplore creative opportunities for next-gen payments experiences that leverage the depth of Stripe’s payment technology.\nCollaborate with stakeholders across the organization such as product, design, infrastructure, marketing and operations.\nDevelop and execute against both short- and long-term roadmaps. Make effective tradeoffs that consider business priorities, user experience, and a sustainable technical foundation.\nUphold our high engineering standards and bring consistency to the many codebases and processes you will encounter.\n\nWho you are\n\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\n\nMinimum requirements\n\n2+ years of software development experience, with an emphasis on modern frontend technologies (HTML/CSS/TypeScript/React) and building delightful user interfaces.\nComfort operating as a frontend developer and owning projects end-to-end.\nAre motivated by solving hard problems, and measure your success in terms of impact doing so.\nThrive in a highly collaborative environment involving different stakeholders and subject matter experts.\nEnjoy working with a diverse group of people with different areas of expertise.\n\nPreferred qualifications\n\nExperience working in high-growth teams similar to Stripe.\nExperience building financial systems or tools for financial experts.\n\nHybrid work at Stripe\n\nThis role is available either in an office or a remote location (typically, 35+ miles or 56+ km from a Stripe office).\n\nOffice-assigned Stripes spend at least 50% of the time in a given month in their local office or with users. This hits a balance between bringing people together for in-person collaboration and learning from each other, while supporting flexibility about how to do this in a way that makes sense for individuals and their teams.\n\nA remote location, in most cases, is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on-sites, meet-ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently or plan to live.\n\nPay and benefits\n\nThe annual US base salary range for this role is $150,500 – $269,200. For sales roles, the range provided is the role’s On Target Earnings (“OTE”) range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process.\n\nAdditional benefits for this role may include: equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends.",
    "stack": []
  },
  {
    "title": "Backend Software Engineer II - Terraform Ecosystem",
    "company": "HashiCorp",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/06/12200742/hashicorp_logo.jpeg",
    "descriptionLink": "https://remote.co/job/backend-software-engineer-ii-terraform-ecosystem-17/",
    "description": "Title: Backend Software Engineer II – Terraform Ecosystem\n\nLocation: USA\n\nRemote United States\n\nReq ID: JR103753\n\nJob Description:\n\nAbout the team:\n\nHashiCorp’s Terraform is an open-source project that enables you to safely and predictably create, change, and improve production infrastructure via the command line. It codifies APIs into declarative configuration files that can be shared among team members, treated as code, edited, reviewed, and versioned. Terraform Providers are plugins that provide the interface and interactions between Terraform and the APIs that interact with infrastructure. Terraform Providers are responsible for understanding APIs and exposing resources for use with Terraform.\n\nThe Terraform Ecosystem Hybrid Cloud team manages a number of products, to include the Terraform provider for Google Cloud, the Kubernetes provider, the Helm provider, the vSphere provider, as well as the Terraform ServiceNow Integrations and HCP Terraform Operator for Kubernetes. In this role, you’re primarily responsible for development and maintenance of the officially supported Terraform Google Cloud Platform providers (google, google-beta) in close collaboration with the Google Terraform community, our Google partner team, and HashiCorp’s customers. These providers act as the interface between Terraform and Google Cloud Platform, requiring provider maintainers to have a high level of experience or knowledge of Google Cloud Platform.\n\nWhat you’ll do (responsibilities):\n\nYou will work with nearly every part of Google Cloud in the process of extending, maintaining and enhancing the Terraform Google Cloud providers\nYou will be responsible for stewardship of the Terraform Google Cloud providers by supporting internal, community and partner contributors with guidance, supportive and constructive code reviews, documentation improvements, mentorship, and changes required to make our users successful\nYou will advocate for and support improvements to Terraform Core and the Terraform plugin SDK\nYou will work closely with our Google partner team to support a strategic relationship\nYou will conduct solution discovery as it relates to the Terraform Google provider. Identifying options to both technical and business challenges, conducting experimentation of Proof of Concepts, capturing findings in written form (RFCs) to be shared with cross-functional and Google partner teams.\n\nWhat you’ll need (basic qualifications):\n\nYou have operated and maintained production systems in Google Cloud, or have extensive experience with the Google Cloud Platform Ecosystem\nYou have a strong Software Engineering or DevOps background\nYou have used Terraform & enjoy working with Go (previous Go experience is not required, Google Cloud experience is more important)\nYou have experience in education, customer support, or OSS community support applicable to the Terraform community\nYou are familiar with infrastructure management concepts and tools (infrastructure as code, software defined networking, virtualization, and the tools used to operate and maintain related systems)\n\n#LI-Remote\n\nIndividual pay within the range will be determined based on job related-factors such as skills, experience, and education or training.\n\nThe base pay range for this role in the SF Bay Area / NYC area is:\n\n$151,300—$178,000 USD\n\nThe base pay range for this role in Seattle Metro, Denver / Boulder Metro, New York (excluding NYC), Washington D.C., or California (excluding SF Bay Area) is:\n\n$138,600—$163,100 USD\n\nThe base pay range for this role in Colorado (excluding Denver / Boulder Metro) and Washington (excluding Seattle Metro) is:\n\n$126,100—$148,300 USD",
    "stack": []
  },
  {
    "title": "Senior Backend Engineer- Ruby on Rails",
    "company": "Cast & Crew",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2022/11/17093345/Cast-Crew-Logo-150x150.jpeg",
    "descriptionLink": "https://remote.co/job/senior-backend-engineer-ruby-on-rails-15/",
    "description": "Senior Backend Engineer- Ruby on Rails\n\nat Cast & Crew\n\nRemote – USA\n\nAt Cast & Crew, we’ve empowered creativity and supported the global entertainment industry for decades. Together with our family of brands – Backstage, CAPS, Checks & Balances, Final Draft, Media Services, Sargent-Disc, and The TEAM Companies – we operate as a combined entertainment technology and services provider offering industry standard screenwriting accounting software, digital payroll products, data & reporting, and a host of creative tools. The industry continues to move faster than ever, and the need for our expertise, our technology, and our people has never been greater. We are a production’s best ally every step of the way. #OneCastOneCrew\n\nAbout FilmFreeway\n\nFilmFreeway is the home of the Film Industry’s top festivals and filmmakers. Trusted by brands including HBO, The Oscars®, ESPN, NBC-Universal, Lionsgate, PBS, NPR and more, FilmFreeway is the world’s leading film festival marketplace. Every day, thousands of filmmakers, writers and artists use FilmFreeway to submit to over 12,000 of the world’s best film festivals and contests (including 150+ Oscar and BAFTA qualifying festivals). FilmFreeway is setting the industry standard for how filmmakers and fans discover, submit, and get tickets to thousands of film festivals and creative contests worldwide.\n\nAbout TCS\n\nTCS’ mission is to empower creative talent and streamline the content creation process for projects in film, television, commercials/branded content, social media, theater, music video, video games, and more. We provide solutions that manage the entire project lifecycle, including talent discovery and staffing, production, post production, and distribution. Our brands include Backstage, Coverfly, FilmFreeway, Final Draft, ShareGrid, and Voice123.\n\nTCS is the creative services division of Cast & Crew, a family of individually innovative companies modernizing the ways in which content is created.\n\nThe Role:\n\nFilmFreeway is seeking a Senior Ruby Engineer to build and optimize the best user-focused product serving the film industry. Our small but mighty engineering team of two. We are a team that values independence and autonomy, and trust our engineers to pick the best tools suited for their tasks, while working collaboratively towards mutual goals.\n\nWe adhere to agile principles with a modified Kanban process, where we collectively contribute to several projects at a time, leveraging Jira to create tickets. From there, we brainstorm issues, assign and manage work, and deploy changes. We create WIP PRs and communicate on code changes as they’re happening, and use PRs to help indicate when work is ready to be reviewed and deployed.\n\nAs Senior Ruby Engineer, you will be working on the entire system, including feature development, production reliability, infrastructure, maintenance, upgrades, tooling, bugs, and troubleshooting. You will be partnering with our product and customer support teams to design and architect new features that will solve the pain points of our customers. While this is an individual contributor role, you will also be guiding technical decisions, and providing code reviews. Your work will have a direct impact on our very fast-growing community and will be seen and used by millions of people around the world!\n\nThe Senior Ruby Engineer will report to FilmFreeeway’s General Manager.\n\nWhat You’ll Do:\n\nLead feature development while managing timelines and stakeholder expectations\nCollaborate with designers and product developers to conceptualize and build new features end-to-end\nDesign, write and maintain efficient, reusable, and reliable Ruby and JavaScript code\nEstablish processes to ensure maintainability of new code; upgrade old code to new standards via refactor and replacement\nWrite automated tests to ensure proper code coverage for new features\nPlan, develop, upgrade, and maintain current and future infrastructure and frameworks\nTroubleshoot and resolve technical issues while coordinating with the Support team to deliver the best possible user experience\nMonitor system instrumentation to optimize performance\nInvestigate and implement new web development technologies and best practices, as applicable\nIdentify any bottlenecks or bugs in the system and devise solutions\nWork in a collaborative environment where you will need to coordinate with and mentor other team members and department\n\nWhat we’re looking for from you:\n\nDemonstrated prior experience leading feature development (delegating, code reviews, overseeing projects to completion) and shipping software in a professional team setting\nStrong project management skills; ability to create timelines, prioritize tasks, and communicate with stakeholders\nFamiliarity with project management software such as JIRA to manage tasks and coordinate with others\n8+ years of experience working with Ruby on Rails\nDemonstrated ability to create and improve well-architected, readable code that conforms to established best practices and RESTful principles\nDeep knowledge of the standard Ruby library\nExperience upgrading Ruby on Rails (RoR) between major versions\n4+ years of experience using ReactJS or a comparable frontend framework for building user forms and interactions\nKnowledge of responsive styling using CSS and preprocessors like SCSS and SASS</li>\nExperience with ElasticSearch and full-text indexing of content\nExperience with caching solutions such as Memcached and Redis\nExperience integrating with third-party payment solutions such as Stripe, PayPal, and Dwolla\nFamiliarity with Amazon Web Services, including security and deployment best practices, EC2, S3, RDS, Elasticache, Elastic Transcoder, and OpenSearch\nExperience managing Linux servers from “fresh install” to “running production stable”; ability to provision systems using Ansible and comfortable with command-line tools\nExperience monitoring and managing the WAF firewall and network optimization through Cloudflare\nExperience creating small utilities through AWS lambda or Cloudflare workers\nAbility to implement automated testing of your code, particularly integration testing via Selenium / Capybara\nCompetency working with relational databases (e.g. MySQL, PostgreSQL) and experience designing database schema, particularly in relation to Ruby on Rails / ActiveRecord.\nFamiliarity working with mass email systems such as Sendgrid\nExperience writing both client and server side (Node.js) Javascript\n\nCompensation is commensurate with various factors including, but not limited to, relevant experience, qualifications, skills, training, licensure, certifications, geographic cost of labor, and other business and organizational needs. Compensation range for candidates in other locations may differ based on the cost of labor in that location.\n\nThe compensation range for this position is:\n\n$150,000—$180,000 USD\n\nBenefits\n\nCast & Crew provides a comprehensive package of employee benefits including: Medical, Dental, Vision, PTO, health and wellness programs, employee discounts, and more! Note: Cast & Crew benefits are subject to eligibility requirements.\n\nDue to the high volume of applicants, it is likely that only shortlisted candidates will be contacted.\n\nCA residents: Your personal information may be collected in connection with certain services provided by Cast & Crew or its affiliated companies. A summary of your California privacy rights can be found at: https://www.castandcrew.com/privacy-policy/\n\nCast & Crew is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. It is our policy to provide equal employment opportunities to all individuals based on job-related qualifications and ability to perform a job, without regard to age, gender, gender identity, sexual orientation, race, color, religion, creed, national origin, disability, genetic information, veteran status, citizenship or marital status, and to maintain a non-discriminatory environment free from intimidation, harassment or bias based upon these grounds.",
    "stack": []
  },
  {
    "title": "Frontend Sr Staff Software Engineer",
    "company": "Cribl",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/05/10084943/cribl_logo.jpeg",
    "descriptionLink": "https://remote.co/job/frontend-sr-staff-software-engineer-15/",
    "description": "Title: Frontend Sr Staff Software Engineer, Cribl Copilot\n\nLocation: USA Remote\n\nJob Description:\n\nCribl does differently.\n\nWhat does that mean? It means we are a serious company that doesn’t take itself too seriously; and we’re looking for people who love to get stuff done, and laugh a bit along the way. We’re growing rapidly – looking for collaborative, curious, and motivated team members who are passionate about putting customers first. As a remote-first company we believe in empowering our employees to do their best work, wherever they are.\n\nAs the data engine for IT and Security many of the biggest names in the most demanding industries trust Cribl to solve their most pressing data needs. Ready to do the best work of your career? Join the herd and unlock your opportunity.\n\nWhy You’ll Love This Role\n\nWe are looking for a front-end focused Sr Staff Software Engineer to collaborate on a high-performance team of software developers as we build the Cribl Copilot user experience. You will play a central role in designing and developing delightful user interfaces and visualizations by integrating cutting-edge AI technologies with the Cribl Product suite to help solve real customer problems.\n\nThis role is ideal for someone who is passionate about building engaging web applications in a dynamic, collaborative environment.\n\nOn top of it all, you will have fun! Cribl strives to be a great place to work for everyone.\n\nAs An Active Member Of Our Team, You Will …\n\nBachelor’s degree in Computer Science or similar field with 8+ years of industry experience\nAbility to problem solve from first principles and maintain focus on overarching objectives\nAbility to write clean, maintainable, and testable code\nExperience building AI powered products\nExperience with JavaScript, TypeScript, and React\nExperience using assertion frameworks and tools to automate regression tests (e.g. Playwright, CodeceptJS, Mocha, Cypress, Jest)\nExperience with advanced software development in large-scale, highly available, distributed systems\nExcellent communication skills, both verbal and written; able to explain complex technical topics to both internal and external stakeholders with ease and in remote/distributed environments\n\nPreferred Qualifications\n\nFamiliar with how state of the art conversational chat based products are built\nExperience with Next.js and Vercel\nExperience building backend REST APIs\nA good eye for design and good product taste\nGood jokes, or maybe better, bad jokes\n\nSalary Range ($200,000 – $265,000)\n\nThe salary for this role is dependent on geographic location. The salary offered within the range described will be based on the individual candidate’s job-related knowledge, skills, and experience. In addition to a competitive salary, Cribl also offers a generous benefits package which includes health, dental, vision, short-term disability, and life insurance, paid holidays and paid time off, a fertility treatment benefit, 401(k), equity, and eligibility for a discretionary company-wide bonus\n\n#LI-JB1 #LI-Remote\n\nBring Your Whole Self\nDiversity drives innovation, enables better decisions to support our customers, and inspires change for the better. We’re building a culture where differences are valued and welcomed, and we work together to bring out the best in each other. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.",
    "stack": []
  },
  {
    "title": "Frontend Engineer (React)",
    "company": "Nacelle",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/02/16125524/Nacelle_logo.jpeg",
    "descriptionLink": "https://remote.co/job/frontend-engineer-react-15/",
    "description": "Title: Frontend Engineer (React)\n\nLocation: Remote US\n\nType: Full-Time\n\nCategory: Software Development\n\nRemote\nFull-Time\nEngineering\n$150k – $180k\n\nJob Description:\n\nAbout Nacelle:\n\nNacelle is revolutionizing eCommerce by combining cutting-edge AI technologies with unparalleled data integration to deliver personalized experiences for merchants. Our flagship product, Genesis, pulls data from various sources—product catalogs, brand voice documents, customer feedback, and marketing transcripts—to create deep context for AI models, generating highly relevant, real-time outputs. We’re committed to creating reliable, maintainable, and scalable software by following proven design principles and embracing test-driven development (TDD) as a core practice.\n\nThe role:\n\nWe’re looking for a frontend wizard who loves diving deep into React and TypeScript, someone who’s not afraid to explore every corner of what modern web technologies can do. This is a role for an engineer who gets excited about high quality code and crafting beautiful experiences.\n\nYou’ll be joining us at an exciting time where you’ll help shape our product from the ground up. We’re in that thrilling 0 → 1 phase, where your code will have immediate impact and your architectural decisions will set the foundation for our future growth. If you’re the kind of person who thrives on turning ambitious ideas into reality and gets energized by startup momentum, we want to talk to you.\n\nWe’re especially keen to meet developers who:\n\nLove pushing the boundaries of what’s possible with React, TypeScript, and modern web APIs\nHave that startup DNA: you move fast, adapt quickly, and think on your feet\nAre curious about AI and eager to apply it to real problems\nTake ownership of your projects and drive them from whiteboard to production\nWrite clean, tested code\nKey Responsibilities:\nRapidly build and ship exceptional frontend experiences that leverage our AI capabilities\nDesign and implement scalable React architectures that set the standard for our frontend development\nDrive technical decisions around frontend tooling, testing approaches, and development workflows\nCollaborate closely with product, design, and engineering teams to deliver features that the world has never seen before at startup speed\nBalance quick iteration with maintainable patterns and documented best practices\nRequirements:\n6+ years of shipping code with a strong frontend focus\nDeep expertise in React, TypeScript- you know the React specs inside and out\nLive and breathe Test-Driven Development – it’s just how you work\nProven experience implementing and managing real-time, bidirectional communication in React applications using WebSockets or similar protocols, including designing, optimizing, and troubleshooting WebSocket connections to support real-time data streams, notifications, or other interactive features\nTrack record of making smart architectural decisions while shipping at startup speed\nHistory of building complex applications that scale\nNice to have:\nA developer who loves both architecting elegant solutions and getting their hands dirty building them\nExperience in early-stage environments where you’ve turned bold ideas into working products\nStrong product instincts and an eye for what makes great user experiences\nExcitement about applying AI to solve real business problems\nThe ability to thrive in our fast-paced world where priorities shift as we learn\nA quality-first mindset, balancing pragmatism with maintainable patterns\nBenefits & Perks:\nThe opportunity to work at the intersection of AI, data, and eCommerce, helping shape the future of personalized online experience\nCompetitive compensation packages\nRemote-first work environment.\nThe opportunity to work at the intersection of AI, data, and eCommerce, helping shape the future of personalized online experiences.\nStock options\nRobust benefits packages which include medical, dental, vision, HSA/FSA, as well as employer-paid life insurance, and short/long-term disability\n401(k) with an employer match\nUnlimited Mental Health Teledoc appointments\n2 weeks PTO / 5 Sick days for the 1st year, then unlimited thereafter\nMonthly wifi stipend\nHome office setup budget and yearly refresher\n\nNacelle is committed to paying fairly and competitively which is why we partner with a salary and equity database company to ensure we are aligned with market rates. The salary estimate for this role is $150,000-$180,000, actual compensation will vary depending on candidates’ location and experience level.\n\nIf you meet most of the criteria for this position, we would still love to hear from you! We believe in fostering talent, growing and providing training to our team as we believe great human beings come first and building skillsets can happen over time.\n\nAuthorization to work in the U.S. is a precondition of employment at Nacelle. We unfortunately are not able to provide employment sponsorship at this time.\n\nNacelle is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics.\n\nNacelle is committed to providing reasonable accommodations for qualified individuals with disabilities who may require additional assistance in engaging in our application and interview process. Please feel free to reach out to Nacelle’s Talent Acquisition Team if you need any assistance completing our application or need accommodations during your interview process.",
    "stack": []
  },
  {
    "title": "Senior Developer (Front-End)",
    "company": "General Dynamics",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/09/12073448/general_dynamics_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-developer-front-end-15/",
    "description": "Title: Senior Developer (Front-End)\n\nJob Description:\n\nResponsibilities for this Position\n\nLocation: USA VA Home Office (VAHOME)\n\nFull Part/Time: Full time\n\nJob Req: RQ184669\n\nType of Requisition:\n\nPipeline\n\nClearance Level Must Currently Possess:\n\nNone\n\nClearance Level Must Be Able to Obtain:\n\nNone\n\nPublic Trust/Other Required:\n\nOther\n\nJob Family:\n\nSoftware Development\n\nJob Qualifications:\n\nSkills:\n\nAgile Scrum Development, Design, User Experience (UX) Design, Web Applications\n\nCertifications:\n\nNone\n\nExperience:\n\n7 + years of related experience\n\nUS Citizenship Required:\n\nNo\n\nJob Description:\n\nOverview: We are seeking a highly skilled Senior Developer with over 7 years of experience in ReactJS and JavaScript to join our dynamic team. The ideal candidate should have a strong background in UI/UX design, particularly with a focus on Human-Centered Design (HCD), and must possess deep expertise in dynamic form building. This position offers an exciting opportunity to work on cutting-edge projects in a collaborative environment.\n\nWe are excited to welcome a motivated Senior Developer who is passionate about creating exceptional user experiences and driving innovation in web development. Join us in shaping the future of our products and services through cutting-edge technology!\n\nKey Responsibilities:\n\nDevelop responsive web applications using ReactJS, ensuring high performance and responsiveness.\nCollaborate with UI/UX designers to implement designs into functional user interfaces, adhering to best practices and design principles.\nBuild reusable components and front-end libraries for future use.\nOptimize applications for performance, scalability, and cost-efficiency in cloud environments.\nEnsure adherence to security and compliance best practices throughout the development lifecycle.\nProvide technical leadership, mentorship, and code reviews to junior developers.\nWrite clean, maintainable, and testable code.\nMentor and coach junior developers, providing technical guidance and code reviews.\n\nQualifications:\n\nBachelor’s degree in Computer Science, Computer Programming, Computer Engineering, UI/UX Design or relevant computer-based major.\n10+ years of experience in developing IT solutions and cloud infrastructures.\nExperience in software engineering and design architectures.\nExperience and understanding of best practices regarding system security measures.\nExperience with building and migration software and IT services to align to strategic business needs and goals.\nExperience in conducting research for advanced technologies to determining how IT can support business needs leveraging software, hardware, or infrastructure.\nExcellent problem-solving skills and ability to troubleshoot complex issues.\nStrong communication and interpersonal skills, with a collaborative mindset.\nAbility to work effectively in a fast-paced environment.\nProven track record of delivering scalable and reliable software solutions.\nA portfolio demonstrating expertise in UI/UX design and relevant projects.\n\nMust Have:\n\nMinimum of 7 years of strong experience in UX Design, including a deep understanding of UX Design Thinking and Principles.\nAt least 7 years of experience with ReactJS and JavaScript.\nExperience working with TypeScript.\nExperience with Data Structures and Algorithms.\nProficiency with CSS, Tailwind, and related technologies.\nExtensive experience in creating cards and implementing drag & drop functionality.\nProven experience in developing dynamic forms with emphasis on intuitive user experience and efficient design.\nExperience developing Component-based Architecture in React, Event Driven Architecture and Microservice framework.\nProficiency working with UX frameworks and templates.\nAbility to lead user testing and analysis sessions.\nExpertise in dynamic form building, with a strong background and extensive practical experience.\nSolid background in maintaining design standards.\nExperience with state management libraries such as Redux or Context API.\nFamiliarity with modern front-end build pipelines and tools.\nExperience with version control systems (e.g., Git) and CI/CD pipelines.\nExperience working in an Agile development environment using DevSecOps principles and tools.\n\nNice to Have:\n\nAssociate or Professional level certifications in cloud platforms (e.g., Azure, AWS).\nExperience in UI/UX design, with a focus on Human-Centered Design principles.\nExperience in developing and testing wireframes and prototypes\nExperience with server-side Node.js development.\nKnowledge of creating NPM packages.\nKnowledge of server-side rendering framework such as Next.js.\nExperience writing Unit Tests for JavaScript frameworks.\nFamiliarity with GraphQL and RESTful APIs.\n\nCommunication and Organizational\n\nExcellent presentation and communication (oral and written) skills.\nConsultant mindset with the ability to work with high level customer stakeholders and build excellent customer relationship.\nExperience identifying and applying industry tools, solutions, methods best practices, and emerging technologies.\nStrong analytical skills and problem-solving skills with the ability to formulate and communicate recommendations for improvement.\nExperience with process design and documentation methodologies, and design and production of quality deliverables.\nDemonstrated ability to work effectively, independently, and as part of a team.\nStrong project management, leadership & meeting facilitation skill with knowledge of Project Life Cycle\n\nThe likely salary range for this position is $123,716 – $167,380. This is not, however, a guarantee of compensation or salary. Rather, salary will be set based on experience, geographic location and possibly contractual requirements and could fall outside of this range.\n\nScheduled Weekly Hours:\n\n40\n\nTravel Required:\n\nNone\n\nTelecommuting Options:\n\nRemote\n\nWork Location:\n\nAny Location / Remote\n\nAdditional Work Locations:\n\nTotal Rewards at GDIT:\n\nOur benefits package for all US-based employees includes a variety of medical plan options, some with Health Savings Accounts, dental plan options, a vision plan, and a 401(k) plan offering the ability to contribute both pre and post-tax dollars up to the IRS annual limits and receive a company match. To encourage work/life balance, GDIT offers employees full flex work weeks where possible and a variety of paid time off plans, including vacation, sick and personal time, holidays, paid parental, military, bereavement and jury duty leave. GDIT typically provides new employees with 15 days of paid leave per calendar year to be used for vacations, personal business, and illness and an additional 10 paid holidays per year. Paid leave and paid holidays are prorated based on the employee’s date of hire. The GDIT Paid Family Leave program provides a total of up to 160 hours of paid leave in a rolling 12 month period for eligible employees. To ensure our employees are able to protect their income, other offerings such as short and long-term disability benefits, life, accidental death and dismemberment, personal accident, critical illness and business travel and accident insurance are provided or available. We regularly review our Total Rewards package to ensure our offerings are competitive and reflect what our employees have told us they value most.\n\nWe are GDIT. A global technology and professional services company that delivers consulting, technology and mission services to every major agency across the U.S. government, defense and intelligence community. Our 30,000 experts extract the power of technology to create immediate value and deliver solutions at the edge of innovation. We operate across 30 countries worldwide, offering leading capabilities in digital modernization, AI/ML, Cloud, Cyber and application development. Together with our clients, we strive to create a safer, smarter world by harnessing the power of deep expertise and advanced technology.\n\nWe connect people with the most impactful client missions, creating an unparalleled work experience that allows them to see their impact every day. We create opportunities for our people to lead and learn simultaneously. From securing our nation’s most sensitive systems, to enabling digital transformation and cloud adoption, our people are the ones who make change real.\n\nGDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.",
    "stack": []
  },
  {
    "title": "Manager, Engineering - Frontend Platfrom",
    "company": "Vimeo",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/15094429/vimeo_logo-150x150.jpeg",
    "descriptionLink": "https://remote.co/job/manager-engineering-frontend-platfrom-15/",
    "description": "Title: Manager, Engineering – Frontend Platfrom\n\nLocation: US-Remote\n\nJob Description:\n\nAt Vimeo, we love designing and engineering tools that combine power with ease of use. Our engineers work on professional-grade video tools for creators and have the opportunity to do way more than write code.\n\nThe Frontend Platform team builds tools and libraries that make it easy for Vimeo engineers to write high quality frontend code that delivers an exceptional experience for our users.\n\nWe’re a small team that cares about collaboration, encourages curiosity, celebrates technical excellence, and is driven by careful attention to detail and planning for the future. We believe diversity of perspective and experience are key to building great technology and believe that the best way to iterate towards success is by taking care of ourselves, our families, our users, and one another.\n\nWhat you’ll do\n\nLead a team of experienced engineers working on the foundation of Vimeo’s frontend infrastructure and UI tooling\nCollaborate with designers to improve Vimeo’s UI component library, focusing on accessibility, performance and scalability\nWork with the team to create a roadmap for the future of the Vimeo frontend, balancing short-term impact with long-term vision and tying it into larger company goals\nProvide technical guidance as the team works to adopt server-side Next.js\nWork cross functionally with internal engineering teams to improve the developer experience of the frontend tools\nAdvocate for frontend best practices and champion the team’s work across the engineering org\nBalance competing priorities and clearly set and communicate deliverables to the team\n\nSkills and knowledge that you have:\n\n5+ years of experience leading high-performing UI engineering teams, specifically focused on internal developer tools and libraries\nA solid understanding of modern JavaScript, TypeScript, semantic HTML, and the DOM\nStrong knowledge of React conventions and best practices, with an emphasis on composable component patterns\nHands-on experience running Next.js in a production environment is a must\nExperience working with component libraries, design systems and design tools like Figma and Storybook\nExperience with common CSS tooling like CSS-in-JS and SCSS\nAn understanding of performance optimization for web applications\nA strong eye for product design with a focus on interactivity, usability and accessibility\nKnowledge of WCAG and WAI-ARIA accessibility standards\n\nBase Salary Range:\n\nNYC Metro, Bay Area, Seattle, & Los Angeles: $150,000 – $205,500\nAll other US cities outside above metro areas: $135,000 – $184,950\n\nAt Vimeo, we strive to hire and nurture amazing talent across the globe. Actual salaries will vary depending on factors including but not limited to experience, specialized skills, internal alignment, and location.\n\nBase salary is just one component of Vimeo’s total rewards philosophy. We offer a wide range of benefits and perks that appeal to the variety of needs across our diverse employee base! Other rewards may include variable compensation and Restricted Stock Units (RSUs).\n\nWe also offer paid time off, generous 401k match, commuter benefits, Health Savings Account (HSA), Flexible Spending Account (FSA), fertility reimbursement, group term life insurances, wellbeing resources, and more.\n\nAbout Us:\n\nVimeo (NASDAQ: VMEO) is the world’s most innovative video experience platform. We enable anyone to create high-quality video experiences to better connect and bring ideas to life. We proudly serve our community of millions of users – from creative storytellers to globally distributed teams at the world’s largest companies – whose videos receive billions of views each month.\n\nVimeo is headquartered in New York City with offices around the world. At Vimeo, we believe our impact is greatest when our workforce of passionate, dedicated people, represents our diverse and global community. We’re proud to be an equal opportunity employer where diversity, equity, and inclusion is championed in how we build our products, develop our leaders, and strengthen our culture.",
    "stack": []
  },
  {
    "title": "Senior Software Engineer, Frontend",
    "company": "Virtru",
    "dateCreated": "2024-11-18",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/15094015/virtru_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-software-engineer-frontend-15-3/",
    "description": "Title: Senior Software Engineer, Frontend\n\nLocation: USA, Remote\n\nJob Description:\n\nAbout Virtru:\n\nVirtru is a leading data protection provider backed by some of the foremost venture capital firms in Silicon Valley and the Mid-Atlantic region, including Iconiq Capital, Bessemer Venture Partners, Foundry Capital, and Tiger Global. Today, more than ever, data demands respect, and that’s why Virtru is committed to changing the rules for data privacy. At Virtru, we equip our customers to take granular control of their data-everywhere it’s shared-through end-to-end encryption for Google, Microsoft, and other data sharing platforms. Our market-leading portfolio of data encryption and privacy enhancing applications are remarkably easy to use, fast to implement, affordable for all, and built on the Trusted Data Format (TDF) open standard.\n\nAt Virtru, our motto is “Respect the people. Respect the data.” Respecting data to us means keeping it secure and protected at all times across its entire lifecycle. We firmly believe that when you respect data, you’re demonstrating respect for the people who own that data.\n\nWorking at Virtru, you’ll be inspired by colleagues who are passionate about the work they do. We are dedicated to creating an atmosphere that sparks creativity, connection, and professional growth while empowering each other to do our best work. We’re building something special at Virtru. We hope you consider joining our team and helping us create a brighter future for data privacy.\n\nSenior Software Engineer, Frontend\n\nCompensation: $130,000 – 170,000\n\nAbout Virtru:\n\nVirtru is a leading data protection provider backed by some of the foremost venture capital firms in Silicon Valley and the Mid-Atlantic region, including Iconiq Capital, Bessemer Venture Partners, Foundry Capital, and Tiger Global. Today, more than ever, data demands respect, and that’s why Virtru is committed to changing the rules for data privacy. At Virtru, we equip our customers to take granular control of their data-everywhere it’s shared-through end-to-end encryption for Google, Microsoft, and other data sharing platforms. Our market-leading portfolio of data encryption and privacy enhancing applications are remarkably easy to use, fast to implement, affordable for all, and built on the Trusted Data Format (TDF) open standard.\n\nAt Virtru, our motto is “Respect the people. Respect the data.” Respecting data to us means keeping it secure and protected at all times across its entire lifecycle. We firmly believe that when you respect data, you’re demonstrating respect for the people who own that data.\n\nWorking at Virtru, you’ll be inspired by colleagues who are passionate about the work they do. We are dedicated to creating an atmosphere that sparks creativity, connection, and professional growth while empowering each other to do our best work. We’re building something special at Virtru. We hope you consider joining our team and helping us create a brighter future for data privacy.\n\nLocation: This is a remote position. We are considering candidates in the ET to PT timezones.\n\nWhat You Will Be Doing\n\nIdeate with Design and Product to craft customer problems and engineer solutions.\nDevelop well-defined written design documents, prototypes, and collaborative feedback loops.\nShip innovative features that delight customers (more than CRUD).\nMentor fellow engineers continuously – code reviews, pair programming, design discussions, knowledge sharing.\n\nWho You Are\n\nYou thrive in a startup environment and interested in exploring the bleeding edge.\nYou are curious and have a deep passion for learning new technologies.\nYou value communication and want to collaborate with others to solve problems.\nYou like mentoring others and have empathy for the diverse ways people learn.\n\nWhat You Should Have\n\n5+ years of experience with client-side Javascript and component based architecture.\n2+ years of experience with Typescript and React.\nExperience with complex html + css site layouts.\nExperience with using and developing component based design systems.\nExperience with modern browser technologies and web architectures.\nExperience with a variety of frontend build tooling and testing frameworks.\nStrong UX and design intuition, and a passion for excellence.\nStrong knowledge of browser security and best practices.\n\nHow You Will Stand Out\n\nExperience building Enterprise software with on-premise deployments.\nExperience contributing to open source software or technical blogs.\nExperience driving elegant and creative solutions to complex problems.\nExperience in small startups and bringing greenfield, 0 to 1 products to market.\nExperience with working in small cross-functional squads.\nExperience with PWAs, Websockets, WebRTC, Monorepos, or Microfrontends.\nExperience with CSS libraries like Styled Components, Emotion, or Open Props.\nExperience in a variety of SDLC methodologies – you get the job done whatever the process.\nPERKS & BENEFITS\n\nAt Virtru, we believe people do their best work when their wellbeing is put first. This is why we make your wellbeing our priority with a thoughtful and holistic program that encompasses Occupational, Mental, Social, Physical, and Environmental Wellness by offering benefits such as.\n\nA Remote-First Approach – Virtru is committed to being forever flexible when it comes to where, how, and when you get your work done. You have the option to work from home if that suits you best, or work from our DC Headquarters if you prefer being in person!\nA Flexible PTO policy – we strongly encourage you to take a minimum of 25 days off annually (in addition to 12 federal holidays) to ensure that you are getting the proper time needed to unplug and recharge.\nA $1,500 annual Learning & Development Stipend focused on providing you the resources to continually learn and professionally grow.\nA $350 Work-From-Home Stipend to help make your office space more comfortable and productive.\nInternal mobility options for those interested in exploring their skills in other areas of the business\nFrequent company-sponsored Team Celebrations that provide ample opportunities to connect with teammates and be social!\nAccess to an Employee Assistance Program.\nAccess to Headspace, a mental health app tailored to your specific needs.\nA high degree of flexibility – Have an appointment, errand, or family emergency to take care of? Hop to it! We give you the time and space to take care of you and your own first.\n\nIn addition to wellbeing, Virtru places a strong emphasis on diversity, equity, inclusion, and belonging. Our DE&I Council is dedicated to fostering an inclusive workplace and making the psychological safety of each and every one of our teammates a top priority. The Council also hosts a range of events throughout the year focused on the continual education of our teammates on social justice issues, current events, and marginalized cultures and communities.\n\nAdditional perks include:\n\nCompetitive compensation\nGenerous parental, medical, and bereavement policies\n401K and stock options\nFull medical, dental, and vision benefits\nAnnual Winter Hackathons and Summer “InnoVation Weeks” (in-person optional)\nNew Hire Swag and IT Welcome boxes\nStructured semi-annual 360 performance reviews\nTransparency is at the core of how we operate and everything we do!\n\nVirtru is currently operating in a remote-first capacity; however, there are plenty of opportunities to connect with the team in person throughout the year, both in and out of the office, whether they be team-specific or company-wide celebrations and events.\n\nVirtru is committed to building an inclusive environment for people of all backgrounds and everyone is encouraged to apply. Virtru is an Equal Opportunity Employer and does not discriminate on the basis of race, color, gender, sexual orientation, gender identity or expression, religion, disability, national origin, protected veteran status, age, or any other status protected by applicable national, federal, state, or local law.\n\nVirtruvian qualities that will set you up for success:\n\nThinking outside of the box to respectfully challenge your teammates and managers in the pursuit of excellence\nStrong sense of urgency with an action-oriented mindset\nAble to collaborate and adapt to shifting priorities as business needs evolve\nComfortable with asynchronous communication including slack, email, zoom, etc.\n\nPerks & Benefits:\n\nAt Virtru, we believe people do their best work when their wellbeing is put first. This is why we make your wellbeing our priority with a thoughtful and holistic program that encompasses Occupational, Mental, Social, Physical, and Environmental Wellness by offering benefits such as.\n\nA Remote-First Approach – Virtru is committed to being forever flexible when it comes to where, how, and when you get your work done. You have the option to work from home if that suits you best, or work from our DC Headquarters if you prefer being in person!\nA Flexible PTO policy – we strongly encourage you to take a minimum of 25 days off annually (in addition to 12 federal holidays) to ensure that you are getting the proper time needed to unplug and recharge.\nA $1,500 annual Learning & Development Stipend focused on providing you the resources to continually learn and professionally grow.\nA $250 Work-From-Home Stipend to help make your office space more comfortable and productive.\nInternal mobility options for those interested in exploring their skills in other areas of the business\nFrequent company-sponsored Team Celebrations that provide ample opportunities to connect with teammates and be social!\nAccess to an Employee Assistance Program.\nAccess to Headspace, a mental health app tailored to your specific needs.\nA high degree of flexibility – Have an appointment, errand, or family emergency to take care of? Hop to it! We give you the time and space to take care of you and your own first.\n\nIn addition to wellbeing, Virtru places a strong emphasis on diversity, equity, inclusion, and belonging. Our DE&I Council is dedicated to fostering an inclusive workplace and making the psychological safety of each and every one of our teammates a top priority. The Council also hosts a range of events throughout the year focused on the continual education of our teammates on social justice issues, current events, and marginalized cultures and communities.\n\nAdditional perks include:\n\nCompetitive compensation\nGenerous parental, medical, and bereavement policies\nUncapped commissions for Sales roles\n401K and stock options\nFull medical, dental, and vision benefits\nAnnual Winter Hackathons and Summer “InnoVation Weeks” (in-person optional)\nNew Hire Swag and IT Welcome boxes\nStructured semi-annual 360 performance reviews\nTransparency is at the core of how we operate and everything we do!\n\nVirtru is currently operating in a remote-first capacity; however, there are plenty of opportunities to connect with the team in person throughout the year, both in and out of the office, whether they be team-specific or company-wide celebrations and events.\n\nVirtru is committed to building an inclusive environment for people of all backgrounds and everyone is encouraged to apply. Virtru is an Equal Opportunity Employer and does not discriminate on the basis of race, color, gender, sexual orientation, gender identity or expression, religion, disability, national origin, protected veteran status, age, or any other status protected by applicable national, federal, state, or local law.",
    "stack": []
  },
  {
    "title": "Staff Full Stack Engineer, Data Products",
    "company": "Stripe, Inc.",
    "dateCreated": "2024-11-11",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2021/09/28143830/Taxjar-Logo-150x150.jpg",
    "descriptionLink": "https://remote.co/job/staff-full-stack-engineer-data-products-13/",
    "description": "Title: Staff Full Stack Engineer, Data Products\n\nLocation: New York United States\n\nOffice locations\n\nNew York, Toronto, South San Francisco HQ, or Chicago\n\nRemote locations\n\nRemote in United States\n\nTeam\n\nData Platform\n\nJob type\n\nFull time\n\nJob Description:\n\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\n\nAbout the team\n\nAt Stripe, we are building a powerful suite of Data Products that enable all Stripes to understand, analyze, and take action based on data and metrics. As a Full Stack Engineer in our Data Products Workbench Team, you will play a crucial role in developing high leverage tooling and user interfaces for data visualization and analysis, all of which are critical to driving data literacy, empowering decision-making, and improving ML model performance across the organization. The team is part of the Data Platform Products organization and our long-term vision is to build a unified data product development experience at Stripe.",
    "stack": []
  },
  {
    "title": "Senior Software Engineer - Ruby",
    "company": "Experian",
    "dateCreated": "2024-11-11",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/01/21142258/experian_logo-150x150.jpeg",
    "descriptionLink": "https://remote.co/job/senior-software-engineer-ruby-11-2/",
    "description": "Title: Senior Software Engineer – Ruby\n\nEmployees can work remotely\n\nFull-time\n\nEmployee Status: Regular\n\nRole Type: Home\n\nJob Posting – Salary Range: $97,718 – $169,377\n\nDepartment: Product Development\n\nSchedule: Full Time\n\nCompany Description\n\nExperian is a global data and technology company, powering opportunities for people and businesses around the world. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, create marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics and software. We also assist millions of people to realize their financial goals and help them save time and money.\n\nWe operate across a range of markets, from financial services to healthcare, automotive, agribusiness, insurance, and many more industry segments.\n\nWe invest in people and new advanced technologies to unlock the power of data. As a FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 22,500 people across 32 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com.\n\nJob Description\nYou will design, implement, and test code to enhance and cultivate several of the company solutions for new API, Batch and Data product offerings.\nResponsibilities include building new products, automation support, tooling support, and tests.\nOur environment: Systems running on latest Ruby, Rails, and Elixir.\nPrivate Git/GitHub repository, Jira for ticket tracking/scrum sprints and GitHub for code reviews\n1:1 test coverage for most of codebase and 2:1 for prime areas\nMac laptops provided for development\nJenkins used for continuous integration, deploy to AWS Agile teams comprised of Software Developers and Software Test Engineers\nYou will report directly to the Sr. Software Development Manager\nQualifications\nExperienced developer in full stack web development, able to build complete data-backed products\nFull MVC (model-view-controller) development experience with Ruby on Rails or equivalent\nAbility to sit with business or technical SMEs to listen, learn and propose technical solutions to business problems\nCollaborate with project managers and stakeholders to make sure that all aspects of the project are delivered as planned\nInvolved at all stages of the development life cycle: initial analysis, implementation, integration, testing, debugging, and support\nExperience with TDD (test driven development) or at least commitment to full test coverage using modern test methods\nAdditional Information\n\nPerks and Benefits\n\n20 daysof vacation accrued annually, five sick days, and two volunteer days (plus twelve paid holidays)\nGreat compensation package and comprehensive benefits package\n401(K) with employer match\nHealth care, dental, and vision benefits along with short and long-term disability insurance and paid family leave\nThis role can be 100% remote\nPeople-focused culture where personal and professional growth is prioritized\nRecognition and celebration of performance and achievements\nPower to bring your whole self to work – where your differences and values will be respected and celebrated\n\nOur uniqueness is that we truly celebrate yours. Experian’s culture and people are key differentiators. We take our people agenda very seriously and focus on what truly matters; DEI, work/life balance, development, authenticity, engagement, collaboration, wellness, reward & recognition, volunteering… the list goes on. Experian’s strong people first approach is award winning; Great Place To Work™ in 24 countries, FORTUNE Best Companies to work and Glassdoor Best Places to Work (globally 4.4 Stars) to name a few. Check out Experian Life on social or our Careers Site to understand why.\n\nExperian is proud to be an Equal Opportunity and Affirmative Action employer. Innovation is a critical part of Experian’s DNA and practices, and our diverse workforce drives our success. Everyone can succeed at Experian and bring their whole self to work, irrespective of their gender, ethnicity, religion, color, sexuality, physical ability or age. If you have a disability or special need that requires accommodation, please let us know at the earliest opportunity.\n\n#LI-REMOTE",
    "stack": []
  },
  {
    "title": "SaaS Front End Developer",
    "company": "WhatConverts",
    "dateCreated": "2024-11-11",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/08/05185056/whatconverts_logo.jpeg",
    "descriptionLink": "https://remote.co/job/saas-front-end-developer-10/",
    "description": "Title: SaaS Front End Developer (FULLY REMOTE)\n\nLocation: US\n\nType: Full-Time\n\nJob Description:\n\nAre you a reliable coding guru looking for the next big thing?\n\nWhatConverts is a fully-remote SaaS company who offers a comprehensive lead tracking solution for marketers – one place to track ALL leads. As a Front End Developer at WhatConverts, you will work closely with the Marketing team to implement and maintain the user interface of our Marketing website. This is an excellent opportunity for a driven candidate who aims to understand the end user and improve their experience.\n\nIn this role you’ll get to:\n\nBuild new web pages, optimize existing ones, maintain the backend health of the site, and maintain/update themes, plugins, and security updates.\nCollaborate with UX designers to translate wireframes and mock-ups into functional and visually appealing web pages.\nEnsure that our website is responsive and optimized for search engines.\nContinually improve standard web metrics and SEO (i.e., time to paint, page load speed, etc.)\nDevelop, maintain, and optimize modern user interfaces for our application using HTML, CSS, JavaScript, and other front-end technologies.\nImplement, use and maintain WhatConverts Website Design System and Components Library.\nMaintain up-to-date knowledge of new front-end web development technologies and apply them to enhance the usability and efficiency of the website.\n\nOther duties as assigned; job duties may expand based upon aptitude and ability\n\nWhat we’re looking for:\n\nHighly proficient in HTML, CSS, HTML5 and and JavaScript\nAbility to construct modern and clean designs that focus on content\nExpert knowledge of responsive websites using CSS preprocessors like Less, Sass.\nExperience with architectural work involving performance optimization with SEO.\nAwareness of cross-browser compatibility issues, client-side performance considerations, and CDN caching strategies.\nDemonstrated ability to handle multiple projects simultaneously while meeting deadlines and maintaining excellent attention to detail\n2-5 years of experience in WordPress web development manipulating and fully customizing CMS themes\nExperience in implementing and maintaining Design Systems is a plus\n\nCompany Benefits/Perks:\n\nRemote-First: Empowered to work agilely in a fully remote environment with no risk of office return.\nImmediate Impact: From day one, take ownership of projects and make a direct impact.\nHealth & Wellness: 100% employer-paid premium medical, dental, vision, and life insurance.\n401k with 5% Match: Secure your future with immediate vesting.\nEmployee Support: Access counseling, legal, and debt management services through our EAP.\nGenerous PTO & Flexible Time Off: Accrue PTO with additional days for tenure, plus up to 4 hours of flex time per week for personal matters.\nParental & Bereavement Leave: Paid leave for life’s important moments.\nVolunteer Day: Give back with an annual volunteer day.\nDiversity & Inclusion: Join a positive, supportive, and inclusive workplace.\nRemote Work Perks: $100 monthly stipend to ensure your home office needs are met and company-provided devices.\n\nBefore you apply you should:\n\nLearn about our team\nWatch a product overview or read about our culture\nRead our reviews on G2\n\nIf you’re passionate about working in a dynamic, fast growing company with smart colleagues and opportunities for development, come grow with WhatConverts.\n\nWhatConverts is an equal opportunity employer. We recruit, hire, pay, and promote without regard to gender, race, sexual orientation, age, religion, veteran status, physical/mental abilities, or any other identities protected by law.",
    "stack": []
  },
  {
    "title": "Senior Front End Engineer - React",
    "company": "Facet Wealth",
    "dateCreated": "2024-11-11",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2023/09/29084153/Facet-Wealth-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-front-end-engineer-react-10/",
    "description": "Title: Senior Front End Engineer – React\n\nLocation: Remote Remote US\n\nType: Full-time\n\nWorkplace: Fully remote\n\nEngineering\n\nJob Description:\n\nFacet is a fully remote FinTech company with a mission to empower people to live more enriched lives by delivering a new standard of financial advice that elevates expectations across consumers and the industry.\n\nWe believe that unbiased, personalized financial advice that integrates into every facet of life is essential to living well. People’s financial lives are dynamic and ever-evolving, so we cover everything money touches-from starting a business to buying real estate to your investments and much more. Facet believes financial advice should be delivered with a fresh, human-plus-tech approach, that includes a CFP professional-the highest certification possible.\n\nThe Role:\n\nAs a Senior Front End Engineer at Facet Wealth, you will work with our Engineering & Product teams, playing a critical role in developing world class commercial software used by our lead planners & clients. Our goals are focused on developing a product to improve the financial lives of millions.\n\nA successful candidate would be proficient in modern front and back end tools and development methodologies. As well as being interested in learning new languages, technology stacks, tackling large and complex problems, and the ability to work both independently and in a peer programming environment.\n\nTremendous growth potential exists at Facet – your growth opportunities are virtually unlimited. We are truly passionate about helping realize our team members’ potential through active mentorship. We value drive, ownership, and commitment as we grow our company.\n\nDay-To-Day Responsibilities:\n\nCollaborate with Product and Planners to define solutions to problems\nDesign, develop, and test code written in Golang and React and deployed to AWS</li>\nEstimate tickets in a ScrumBan process\nCommit code constantly to Git/Bitbucket in a mainline development environment\nWrite all the tests. Frustrated about never having time for tests? Not at Facet\nPair program with other developers as desired\nParticipate in daily standups\nParticipate in weekly “Tech Stack Tuesdays” to learn new development skills and techniques\nParticipate in bi-weekly “Fast Fridays” focused on performance improvements in the app\nParticipate in in bi-annual 3 day Hackathons and win fun prizes\nConstant learning and personal growth\n\nRequirements\n\nBasic Qualifications:\n\nExcited about learning new skills and working in a startup environment where change is normal\n5-10+ years of full stack web development or related experience\n3+ years of experience in React 16+\nRelational databases experience, MySQL is preferred\n\nPreferred Qualifications:\n\nExperience with React\nExperience with AWS: ECS, EC2, RDS, S3\nExperience with the REST Architectural style\nExperience with The Clean Architecture\nExperience with Git, Bitbucket\nExperience with frontend toolchains such as Webpack, Gulp, or Grunt\nExperience with frontend testing tools and frameworks such as Mocha/Chai, BrowserStack, Puppeteer\nExperience with automated testing (unit, integration, regression, performance)\nExperience with responsive design and PWAs\nFamiliarity with Linux\nFamiliarity with Docker\nFamiliarity with FinTech APIs such as Plaid, Finicity, Yodlee, APEX, Orion\n\nBenefits\n\n$150,000-$170,000 base salary + bonus determined by the experience, knowledge, skills, and abilities of the applicant – Please note, our salary ranges are based on current market data. Should you feel strongly that we are not in line, we highly recommend you to reach out and let us know. We are always looking to improve on building the best place for employees.\nEquity\nFlexible PTO\nAll the benefits: medical, dental, and vision insurance, 401(k) with employer match, short- and long-term disability coverage (paid by Facet), life insurance options and paid parental leave\nCertification reimbursement program\nWork from anywhere in the US",
    "stack": []
  },
  {
    "title": "Senior Associate Application Engineer (Backend)",
    "company": "Discover Financial Services",
    "dateCreated": "2024-11-11",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/15182821/Discover-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-associate-application-engineer-backend-10/",
    "description": "Title: Senior Associate Application Engineer (Backend)\n\nLocation: Riverwoods United States\n\nJob Description:\n\nDiscover. A brighter future.\n\nWith us, you’ll do meaningful work from Day 1. Our collaborative culture is built on three core behaviors: We Play to Win, We Get Better Every Day & We Succeed Together. And we mean it — we want you to grow and make a difference at one of the world’s leading digital banking and payments companies. We value what makes you unique so that you have an opportunity to shine.\n\nCome build your future, while being the reason millions of people find a brighter financial future with Discover.\n\nJob Description:\n\nWhat You’ll Do\n\nResponsible for the ability to program most features and test cases unattended, but lacks a complete overview of product development and operations. As a result, handovers to other team members limits productivity.\nActively manages and escalates risk and customer-impacting issues within the day-to-day role to management.\n\nHow You’ll Do It\n\nCompletes most features and user stories including test cases and automation unattended.\nLearns more complex software engineering practices such as domain driven design, test driven development, operations, and security.\nContributes to agile ceremonies, leads demos and presentations, helps new engineers learn established norms, and participates in technology communities.\nParticipates in system design decisions and learns how these decisions impact the product as a whole.\nLearns to support production systems and understands how observed events and failures impact the product.\n\nQualifications You’ll Need\nThe Basics\n\nBachelors Degree in Computer Science, Engineering, Informatics, Information Security, Information Technology, or related.\n1+ year experience Information Technology, (Software) Engineering, or related.\nTechnical proficiency rating of Advanced Beginner on the Dreyfus engineering scale.\n\nPhysical and Cognitive Requirements\nThe physical requirements described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable a qualified individual with disabilities to perform the essential functions of the position as required by federal, state, and local laws:\n\nPrimarily remain in a stationary position.\nNo required movement about the work environment to complete the major responsibilities of the job.\nPrimarily performed indoors in an office setting.\nAbility to operate office equipment such as but not limited to computer, telephone, printer, and calculator.\nAbility to communicate verbally.; Ability to communicate in written form.\n\nBonus Points If You Have\n\nBuilding backend applications using Java, JavaScript, Spring Boot, cloud/container technologies\nKnowledge of CI/CD pipelines with Jenkins or similar.\nExperience as part of an Agile engineering or development team.\n\nDiscover will not sponsor or transfer employment work visas for this position. Applicants must be currently authorized to work in the United States on a full-time basis.\n\n#LI-AS1\n\n#REMOTE\n\nApplication Deadline:\n\nThe application window for this position is anticipated to close on Nov-11-2024. We encourage you to apply as soon as possible. The posting may be available past this date, but it is not guaranteed.\n\nCompensation:\n\nThe base pay for this position generally ranges between to . Additional incentives may be provided as part of a market competitive total compensation package. Factors, such as but not limited to, geographical location, relevant experience, education, and skill level may impact the pay for this position.\n\nBenefits:\n\nWe also offer a range of benefits and programs based on eligibility. These benefits include:\n\nPaid Parental Leave\nPaid Time Off\n401(k) Plan\nMedical, Dental, Vision, & Health Savings Account\nSTD, Life, LTD and AD&D\nRecognition Program\nEducation Assistance\nCommuter Benefits\nFamily Support Programs\nEmployee Stock Purchase Plan\n\nLearn more at mydiscoverbenefits.com.\n\nWhat are you waiting for? Apply today!\n\nAll Discover employees place our customers at the very center of our work. To deliver on our promises to our customers, each of us contribute every day to a culture that values compliance and risk management.\n\nDiscover is committed to a diverse and inclusive workplace. Discover is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or other legally protected status. (Know Your Rights & Pay Transparency Nondiscrimination Provision)\n\nDiscover complies with federal, state, and local laws applicable to qualified individuals with disabilities and is committed to providing reasonable accommodations. If you require a reasonable accommodation to search for a position, to complete an application, and/or to participate in an interview, please email HireAccommodation@discover.com. Any information you provide regarding your accommodation needs will be kept confidential and will only be used to determine and provide necessary accommodation.",
    "stack": []
  },
  {
    "title": "Backend Engineer",
    "company": "Code Metal, Inc.",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/06222837/code_metal_logo.jpeg",
    "descriptionLink": "https://remote.co/job/backend-engineer-6-3/",
    "description": "Title: Backend Engineer\n\nLocation: Remote US\n\nWorkplace: Fully remote\n\nJob Description:\n\nYour role\n\nYour be building a unique AI-driven flow framework designed to speed up hardware development by running production-ready code at the Edge. The product supports hardware emulation, simulations, and next-gen AI workflows for GPUs, FPGAs, IoT, and more.\n\nAs a Senior Backend Engineer, you will be responsible for:\n\nBuilding the Core Flow Mechanism: This will serve as the backbone of the AI-driven workflow, responsible for running compilers, simulations, and LLM operators across various hardware systems.\nDeveloping and Extending Flow Frameworks: You’ll start by working with existing tools like Airflow and Promptflow, but will quickly move to building customized frameworks that meet the product’s unique needs, extending functionality to integrate with different hardware toolchains.\nCollaborating with Experts: You’ll work closely with researchers and engineers specializing in LLMs, Deep Learning, Formal Verification, and Compilers to push the boundaries of Edge AI.\n\nMust-Have Skills:\n\nHands-on experience with one of the following frameworks: Airflow, Kubeflow, MLFlow, Promptflow, Langchain, Dagster.\nProven experience building or contributing to flow frameworks (open source or commercial) at the infrastructure level.\nStrong Python skills, particularly in the context of AI/ML development (experience with PyTorch or TensorFlow is a plus).\n\nNice-to-Have Skills:\n\nExposure to ML, especially Large Language Models (LLMs).\nFamiliarity with Kubernetes (K8s) for deploying workloads.\nCloud experience, particularly in optimizing AI workflows on various platforms.\n\nIf you are someone who thrives in a fast-paced, startup environment where requirements can change, this is the right environment for you.\n\nWhy You Should Join:\n\nFull ownership over how the core flow mechanism is built, working directly with the CTO\nWork remotely, or relocate to Boston with assistance.\nCompetitive salary with stock options\nHealthcare coverage\n401k with 5% matching.\nUnlimited PTO, relocation assistance, and a flexible work schedule.",
    "stack": []
  },
  {
    "title": "Backend Developer",
    "company": "Prescient Edge",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/06222321/prescient_edge_corp_logo.jpeg",
    "descriptionLink": "https://remote.co/job/backend-developer-6-2/",
    "description": "Title: Backend Developer\n\nLocation: United States\n\nJob Description:\n\nCategory\n\nResearch, Development, and Engineering\n\nJob Type\n\nFull-Time\n\nCareer Level\n\nStaff\n\nEducation\n\nBachelor’s Degree\n\nTravel\n\nNone\n\nSecurity Clearance Required\n\nNone\n\nJob Description\n\nPrescient Edge is seeking a Backend Developer to support a government client.\n\nBenefits:\n\nAt Prescient Edge we believe that acting with integrity and serving our employees is the key to everyone’s success. To that end, we provide employees with a best-in-class benefits package that includes:\n\nA competitive salary with performance bonus opportunities.\nComprehensive healthcare benefits, including medical, vision, dental, and orthodontia coverage.\nA substantial retirement plan with no vesting schedule.\nCareer development opportunities including on-the-job training, tuition reimbursement, and networking.\nA positive work environment where employees are respected, supported, and engaged.\n\nResponsibilities:\n\nExpertise in Machine Learning, Computer Vision, and scalable statistical techniques (e.g., unsupervised machine learning, logistic regressions, random forest, SVMs).\nExperience with C++, Linux, Open GL and QT\nExpertise in utilizing scalable data insight platforms and tools. Representative examples would include programming skills (e.g., Python, TensorFlow, PyTorch) and cloud platforms (e.g., GCP, AWS, etc).\nExposure to machine-learning model lifecycle, including training, evaluation, and serving.\nAn interest in deploying machine-learning models as scalable services.\nAn interest in “tool-making” (i.e., building features for developers that empower them and increase productivity).\nCuriosity about attacker incentives and how malicious behavior can be identified in data.\nStrong communication skills with the ability to build meaningful customer relationships.\nA strong willingness to contribute within a team environment, support highly cross-functional efforts, and step in and lead a technical project.\nEnthusiasm for innovating in fast-growing privacy and artificial intelligence space.\nA natural inclination to work in a fast-paced startup culture and a readiness to take up multiple responsibilities.\n\nSecurity Clearance:\n\nSecret or the ability to obtain secret (Must be a U.S. citizen).\n\nJob Requirements\n\nMinimum Qualifications:\n\n5 year’s experience within the industry performing development work.\nBachelor’s degree in Computer Science or related technical field or equivalent practical experience.\nExperience developing scalable low-latency, distributed data processing solutions.\nExperience in running large scalable distributed services following micro service architecture.\nMinimum of 5 years of work or educational experience in Machine Learning or Artificial Intelligence.\nMinimum of 5year of relevant work experience, including software development.\nExperience with one or more general-purpose programming languages, including but not limited to: Python, Java, C++.\nExperience in cloud native development preferred.\nExperience in Nodejs preferred.\n\nLocation:\n\nMclean, VA or remote position.\n\nPrescient Edge is a Veteran-Owned Small Business (VOSB) founded as a counterintelligence (CI) and Human Intelligence (HUMINT) company in 2008. We are a global operations and solutions integrator delivering full-spectrum intelligence analysis support, training, security, and RD&E support solutions to the Department of Defense and throughout the intelligence community. Prescient Edge is an Equal Opportunity Employer (EEO). All applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic that is protected by law. We strive to foster equity and inclusion throughout our organization because we believe that diversity of thought is critical for creating a safe and engaging work environment while also enabling the organization’s success.",
    "stack": []
  },
  {
    "title": "Software Engineer - Backend",
    "company": "Pie Insurance",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/23073629/pieinsurance_logo.jpeg",
    "descriptionLink": "https://remote.co/job/software-engineer-backend-6-2/",
    "description": "Title: Software Engineer – Backend\n\nUnited States\n\nPie’s mission is to empower small businesses to thrive by making commercial insurance affordable and as easy as pie. We leverage technology to transform how small businesses buy and experience commercial insurance.\n\nLike our small business customers, we are a diverse team of builders, dreamers, and entrepreneurs who are driven by core values and operating principles that guide every decision we make.\n\nPie Insurance’s Technology team builds and operates a suite of applications and services that allow direct consumers, partners, and agents to manage commercial insurance policies. The team collaborates closely with our business partners to design and implement new features to help the company scale with increasing demand.\n\nWe are seeking a highly motivated and accomplished Senior Backend Engineer who encourage an environment where engineers are thought leaders and foster a culture of diversity and inclusion. Acting as leaders across the organization on design, architecture, and best practice, they elevate those around them and push the company forward.\n\nHow You’ll Do It\nYou’ll write clean, maintainable, and efficient code primarily in Typescript (with some C# preferred).\nYou’ll participate in peer code reviews, ensuring the delivery of high-quality code and adherence to coding standards.\nYou’ll collaborate transparently with product management, designers, stakeholders, and fellow engineers throughout the development process.\nYou’ll help shape the design and architecture of scalable, secure, and robust systems and applications.\nYou’ll deliver software using continuous delivery pipelines, contributing to enhancing and optimizing these pipelines.\nYou’ll assist our support and operations teams by triaging and resolving production issues in a timely manner.\nYou’ll build highly modular and reusable code while adhering to industry standards and best practices.\nYou’ll participate in on-call rotations, consistently seeking opportunities to improve operational stability and system visibility.\nYou’ll continuously learn and stay up-to-date on software engineering best practices and new technologies to improve our systems.\nThe Right Stuff\n2+ years of software development experience with proficiency in languages like TypeScript and/or JavaScript (C# is a plus).\nContributed to at least one product leveraging TypeScript and/or JavaScript for frontend development with React and/or MobX and server-side rendering (SSR)\nUnderstanding of cloud services, particularly AWS.\nExperience with SQL and/or NoSQL databases.\nFamiliarity with Agile methodologies like Scrum, focusing on code quality, secure development, and performance.\nExperience working in complex team environments with the ability to deliver high-quality results under pressure.\nAn agile mindset with a focus on delivering small, incremental improvements that benefit the customer.\nProficiency in crafting technical solutions with ambiguous requirements, demonstrating adaptability, independence, and autonomy.\nUnderstanding of CI/CD best practices and experience in continuous integration/delivery.\nFamiliarity with microservices and service-oriented architecture.\n\nBase Compensation Range\n\n$125,000 – $155,000 USD\n\nCompensation & Benefits\nCompetitive cash compensation\nA piece of the pie (in the form of equity)\nComprehensive health plans\nGenerous PTO\nFuture focused 401k match\nGenerous parental and caregiver leave\nOur core values are more than just a poster on the wall; they’re tangibly reflected in our work\n\nOur goal is to make all aspects of working with us as easy as pie. That includes our offer process. When we’ve identified a talented individual who we’d like to be a Pie-oneer , we work hard to present an equitable and fair offer. We look at the candidate’s knowledge, skills, and experience, along with their compensation expectations and align that with our company equity processes to determine our offer ranges.\n\nEach year Pie reviews company performance and may grant discretionary bonuses to eligible team members.\n\nLocation Information\n\nUnless otherwise specified, this role has the option to be hybrid or remote. Hybrid work locations provide team members with the flexibility of working partially from our Denver office and from home. Remote team members must live and work in the United States* (*territories excluded), and have access to reliable, high-speed internet.\n\nAdditional Information\n\nPie Insurance is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, marital status, age, disability, national or ethnic origin, military service status, citizenship, or other protected characteristic.\n\nPie Insurance participates in the E-Verify program. Please click here, here and here for more information.\n\nPie Insurance is committed to protecting your personal data. Please review our Privacy Policy.\n\nPie Insurance Announces $315 Million Series D Round of Funding\n\nBuilt In honors Pie in its 2024 Best Places to Work Awards\n\nPie Insurance Named a Leading Place to Work in Colorado\n\n#LI-REMOTE\n\n#BI-REMOTE",
    "stack": []
  },
  {
    "title": "Senior Software Engineer, Backend",
    "company": "Flex - Flexible Finance, Inc.",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/05204241/getflex_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-software-engineer-backend-6-3/",
    "description": "Senior Software Engineer, Backend\n\nRemote (U.S.)\n\nFlex is looking for a Senior Software Engineer who will be responsible for implementing the platforms and APIs that support all business features.\n\nIn this role, you will be part of the partner growth engineering team, responsible for building, maintaining, and improving core services that drives Flex’s network growth, implementing new partner integrations, and working on projects to increase customer net adoption rate. You’ll be designing, developing, testing, and scaling the services needed to deliver great partner experiences and a reliable end-to-end bill payment process.\n\nYou’ll work closely with your product, design and engineering peers to solve our users’ most pressing problems around rent payment. You’ll roll out changes to our customers in an agile manner with a delivery cadence that favors small, frequent iterations. The ideal candidate will be comfortable leading scoping, design and implementation for APIs they build and can drive their production rollouts to completion with minimum oversight.\n\nA minimum of 4 years of experience with Java is required for this position.\n\nWho you are\nYou have strong computer science fundamentals\nYou have experience to translate the feature requirements into technical specifications.\nYou have experience leveling up the entire team’s bar by introducing best practices, mentoring junior people, etc.\nYou have experience with the Java frameworks and tools we use at Flex such as Spring (core/web/boot), Gradle and JUnit\nYou have experience implementing and operating services in distributed services environments at scale\nYou have experience with observability and monitoring tools such as DataDog for maintaining high availability\nYou write high quality code that is testable, maintainable, scalable and secure\nYou have a good understanding of REST and mobile API best practices\nYou have great communication skills and are comfortable working with a distributed team\nCore competencies\nPrior experience working on cross functional teams\nExperience with leading the project in its entire lifecycle, from requirements gathering to delivery.\nProficient with Java and Spring (Bonus: AWS, Containers, Kubernetes, MySql)\nExperience with CI/CD to improve code stability and code quality\n\nThe salary compensation range for this role will be commensurate with the candidate’s experience and Flex’s internal leveling guidelines and benchmarks.\n\nFor working locations in NY/NJ/CA, the base salary pay range will be $197,000-$213,000\nFor all other states, the base salary pay range will be $177,000-$192,000\n\n#LI-Remote\n\nLife at Flex:\n\nWe understand that it takes a diverse team of highly intelligent, curious, determined, empathetic, and self aware people to grow a successful company. Our HQ is located in New York City, but we have employees located throughout the US, Australia, Canada and South America. We are growing quickly, but deliberately, with a focus on building an inclusive culture. Our dynamic team has incredible perspectives to share, just as we know you do, and we take great pride in being an equal opportunity workplace.\n\nWe offer many employee benefits. For full time, U.S. based employees we offer:\n\nCompetitive pay\n100% company-paid medical, dental, and vision\n401(k) + company equity\nUnlimited paid time off with a PTO minimum + 13 company paid holidays\nParental leave\nFlex Cares Program: Non-profit company match + pet adoption coverage\nFree Flex subscription\n\nFor full time non-US employees, we offer\n\nCompetitive Pay\nCompany Equity\nUnlimited PTO",
    "stack": []
  },
  {
    "title": "Staff Software Engineer, Backend - Growth",
    "company": "brightwheel",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/16212838/Brightwheel-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/staff-software-engineer-backend-growth-6/",
    "description": "Title: Staff Software Engineer, Backend – Growth\n\nLocation: Remote (US Only)\n\nType: Full-time\n\nWorkplace: remote\n\nCategory: Engineering\n\nRemote (US Only)\n\nEngineering – Engineering\n\nFull-time\n\nRemote\n\nJob Description:\n\nOur Mission and Opportunity\n\nEarly education is one of the greatest determinants of childhood outcomes, is a must for working families, and has a lasting social and economic impact. Brightwheel’s vision is to enable high quality early education for every child – by giving teachers meaningfully more time with students each day, engaging parents in the development of their kids, and supporting the small businesses that make up the backbone of the $175 billion early education market. Brightwheel is the most loved technology brand in early education globally, trusted by thousands of educators and millions of families.\n\nOur Team\n\nWe are a fully remote team with employees across every time zone in the US. Our team is passionate, talented, and customer-focused. Our exceptional investor group includes Addition, Bessemer Venture Partners, Chan Zuckerberg Initiative, GGV Capital, Lowercase Capital, Emerson Collective, and Mark Cuban.\n\nWe believe that everyone-from our employees to the students, teachers, and administrators we serve- should be given the opportunity to learn and thrive, whatever their background may be. We celebrate diversity in all forms because it allows our team and the communities we serve to reach their full potential and do their best work. From decision making, to how we operate, we ground ourselves in our Leadership Principles every day.\n\nWho you are\n\nWe are seeking a staff software engineer who is well-rounded technically and passionate about the positive impact their code can make in people’s lives. Our School Operations team is focused on enabling the best day-to-day product experience possible. Early childhood educators are terribly short on time: the easier it is for them to take care of routine tasks, like tracking student attendance, logging activities, and communicating with parents, the more time they have to focus on engaging directly with the children they care for. At brightwheel, product engineers work closely with product and design, as well as with other areas of the business, to define and deliver an experience that meets our customers’ biggest needs.\n\nEvery engineer at brightwheel is afforded a high degree of ownership and autonomy. We are a lean, fast-moving team and value individuals who can optimize for being impactful while considering both technical and business drivers. You’ll bring a high degree of ownership and ability to execute.\n\nWhat you’ll do\nLead projects on our School Operations team – helping ensure brightwheel works exceptionally well for our customers.\nWork alongside product and design to scope and implement new features or product lines\nProvide input to both delivery and discovery-providing new ideas, proposals, and constructive criticism to the team\nBe a steward of quality, scalability, security, and performance. You’ll work with other engineers to ensure that we have a solid foundation that serves our customers and enables the team to continue building a great product\nDesign and architect new software systems or introduce new technologies, as appropriate, to support brightwheel’s growth\nShare knowledge and expertise across the engineering team.\nMentor and help to grow the engineering team\nQualifications, Skills, & Abilities:\n5+ years of professional experience, preferably in fast-paced early- or mid-stage startups\nProficiency in both contributing to and designing APIs using Ruby on Rails or similar technologies\nExpertise in writing automated tests (unit/integration/functional)\nExpertise in using Git (or VC equivalent)\nExperience with 3rd party integrations\nExperience with variation testing\nExperience with a variety of codebase sizes and ages\nProficiency with AWS or other cloud platforms\nExperience with architecting distributed systems for scalability and reliability\nStrong verbal and written communication skills for both technical and non-technical audiences\nExperience with microservice or service-oriented architectures preferred\nExperience with modern webapps like React.js preferred\nExperience with Infrastructure as Code (IaC) preferred\n\nCandidates with varying backgrounds are encouraged to apply. We do not require prior knowledge of technologies in our stack; we only need a desire to learn them. At brightwheel, you will encounter:\n\nRuby on Rails\nPostgreSQL\nRedis\nReact.js\nCircleCI\nGitHub Actions\nKubernetes\nAWS-managed services, like Redshift and ECS\n\nBrightwheel is committed to internal pay equity and offers a competitive compensation package, including base salary, equity, and benefits. Our benefits package includes premium medical, dental, and vision benefits, generous paid parental leave, a flexible paid time off policy, a monthly wellness and productivity stipend, and a Learning & Development stipend.\n\nFor cash compensation, brightwheel sets standard ranges for all roles based on function, level, and geographic location, benchmarked against similar-stage growth companies. Multiple factors determine final offer amounts, including geographic location, candidate experience, and expertise. If you have questions about the compensation band for your region, please ask your recruiter.\n\nBrightwheel is committed to creating a diverse and inclusive work environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "stack": []
  },
  {
    "title": "Senior Manager, Data Science",
    "company": "Atlassian",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/08/13182637/atlassian_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-manager-data-science-5/",
    "description": "Senior Manager, Data Science\n\nAnalytics & Data Science | Remote, Americas | Remote, Remote | Washington DC, United States | Full-Time\n\nWorking at Atlassian\n\nAs a Senior Manager,Data Science in CSS, you will lead a team of data scientists to drive transformative changes through ML / AI solutions for Customer Support. You will be a strategic partner to senior business leaders, identifying opportunities and solving complex business problems. Your role will involve building AI/ ML strategies, providing insights, and ensuring the delivery of high-quality outcomes.\n\nThe perfect candidate will be a seasoned people leader with a background in applied AI, data science or a related quantitative field. You have strong business acumen, you are comfortable with ambiguity and complexity, and you have experience working with senior leaders and cross functional teams. You are a self-starter, a strategic thinker, a data-driven problem solver, and a humble learner. You have demonstrated success in using data science to drive understanding, progression, and decision making for large organizations.\n\nResponsibilities:\nTeam Leadership: Lead, and develop a team of data scientists, ML Engineers and Software Engineers with strong technical skills and business acumen.\nStrategic Partnership: Collaborate with senior leaders to identify business opportunities and bring innovation to these opportunities through the lens of AI / ML.\nCross-Functional Collaboration: Work with cross-functional teams to drive initiatives and ensure impactful results. Be comfortable with ambiguity and ready to jump in to help drive initiatives to completion.\nAI / ML Strategy: Be a thought leader in building AI/ML strategies, thinking of scalable and iterable solutions.\nData Science Solutions: Develop data science solutions and work with peer teams to measure their impact on business outcomes, define metrics that measure success and communicate the outcome to the business.\nCommunication: Effectively communicate complex ideas in simple terms and advocate for the team’s work, working with many stakeholders that may not have technical backgrounds.\nQualifications:\nExperience: 10+ years in data science, with 5+ years in people management.\nLeadership: Proven success in hiring, managing, and growing a global team, working with business partners and leading and developing a technical strategy. Manager of managers.\nBusiness Acumen: Strong strategic thinking and ability to navigate complexity and ambiguity.\nTechnical Skills: Expertise in statistics, modeling, SQL, R/Python, and data instrumentation.\nCommunication: Strong skills in data storytelling for non-technical audiences.\nProject Management: Experience in roadmap planning, sprint planning, and stakeholder engagement.\n\nIt’s great, but not required, if you have:\n\nExperience in B2B, customer support, customer success\nExperience managing of managers\nExperience with large data sets and distributed computing\nExperience in using Jira, Confluence to manage and share team’s work\n\nCompensation\n\nAt Atlassian, we strive to design equitable, explainable, and competitive compensation programs. To support this goal, the baseline of our range is higher than that of the typical market range, but in turn we expect to hire most candidates near this baseline. Base pay within the range is ultimately determined by a candidate’s skills, expertise, or experience. In the United States, we have three geographic pay zones. For this role, our current base pay ranges for new hires in each zone are:\n\nZone A: $201,300 – $268,400\n\nZone B: $181,200 – $241,600\n\nZone C: $167,100 – $222,800\n\nThis role may also be eligible for benefits, bonuses, commissions, and equity.\n\nPlease visit go.atlassian.com/payzones for more information on which locations are included in each of our geographic pay zones. However, please confirm the zone for your specific location with your recruiter.\n\nOur perks & benefits\n\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit go.atlassian.com/perksandbenefits to learn more.\n\nAbout Atlassian\n\nAt Atlassian, we’re motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.\n\nWe believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone’s perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.\n\nTo provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.",
    "stack": []
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "MetaLab",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/03/06050942/metalab_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-full-stack-developer-2-2/",
    "description": "Title: Senior Full Stack Developer\n\nLocation: Remote\n\nJob Description:\n\nWe are open to remote candidates located within CST to BRT time zones.\n\nAt Metalab, we design some truly groundbreaking products, and our engineers help turn those designs into reality. Our engineering team needs your help in getting projects up and running and helping our teams release new products into the wild. To thrive in this role, you’ll provide technical expertise and guidance on projects, deliver beautiful code, develop new skills to adapt to project needs, work with cutting-edge web and mobile technologies, and show up ready for anything.\n\nWe believe the magic happens when you combine thoughtful collaboration, strong processes, and the freedom for people to be themselves. When you’re comfortable being yourself, you do your best work and inspire others to do the same.\n\nWhat you’ll do\n\nCollaborate closely with your project team to develop new features and functionality for the products that we deliver across both frontend and backend technologies\nWork with our Product Management team to regularly refine the definition of the work in the product backlog, contributing expertise and gaining clarity when needed\nProvide feedback on designs for completeness, implementation effort, and feasibility\nCollaborate with Product to plan future sprints by contributing to story definition, providing work estimates, and regularly identifying technical dependencies and blockers\nUnderstand and advocate for ongoing sprint goals and help motivate our teams to finish sprints on time and with minimal technical debt\nReview your team members’ code submissions to ensure our work meets the needs of the project in terms of quality, correctness, consistency, and performance\nParticipate in regular shares with client stakeholders on project progress and delivered features and functionality\nSupport the engineering department by sharing the technical knowledge you learn with your project teams\nIdentify when your project team members are stuck on a technical challenge and offer support\nProduce documentation on methods, decisions, technical approaches, and other contexts to improve the developer experience on our projects\n\nRequirements\n\n5+ years of Full Stack experience with expertise in Node.js and Python\nDeep appreciation of the design practice and can protect the integrity of design intent without compromising fidelity\nResponds positively to both professional and project-based feedback and can help the team adapt to changing priorities within fast-paced projects\nOrganized, self-motivated, and comfortable advocating for your needs and the needs of the project\n\nYou have experience building full-stack applications across both the frontend and service layer using modern Typescript frameworks (ie. React, React Native, Nest)\n\nYou have experience creating both REST and GraphQL APIs that enable client applications to persist, process, and retrieve data from various types of databases (ie. PostgreSQL, MySQL, MongoDB, DynamoDB)\nYou are excited to learn new technologies and adopt new solutions to deliver amazing products and further your depth of knowledge as an engineer and technologist\nYou have contributed to technical design discussions and helped evaluate different technical solutions to influence architectural decision-making\nYou are comfortable following general Agile delivery methodologies and participating in regularly scheduled standups and ceremonies (we do our best to prioritize progress over process)\n\nNice to haves\n\nExperience using ML models and AI services to power real-live products (ie. Google Cloud AI, Azure AI, AWS AI or Bedrock, GPT, Dialogflow, Claude, LangChain)\nExperience implementing ML algorithms with common frameworks in end-to-end applications (ie. TensorFlow, Synaptic, ML5.js, Spark ML)\nExperience in an agency setting\nEqual opportunity employer\n\nResearch shows that women and other marginalized groups tend to only apply for a job when they meet every single criteria. Does this role sound like it was made for you, yet you don’t check every box? Reach out anyways! We’re an equal opportunity employer and are dedicated to fostering an inclusive and diverse environment for employees from all walks of life. We hire based on talent, and we’re proud of our global perspective.",
    "stack": []
  },
  {
    "title": "Senior Python - Full Stack Developer - Django-focused",
    "company": "CloudLinux",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/02145911/cloudlinux_logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-python-full-stack-developer-django-focused-2/",
    "description": "Title: Senior Python – Full Stack Developer – Django-focused\n\nLocation: Warsaw Masovian Voivodeship PL\n\nType: Full-time\n\nWorkplace: Fully remote\n\nJob Description:\n\nCloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. We are truly a great place to work.\n\nIn this role, you will have two main focuses. Firstly, you will work on the development of web-facing applications that our employees, customers, and their end-users rely on. Secondly, you will handle the internal back-end services responsible for processing, analyzing, and acting upon the scan data submitted by our agent software on customers’ web hosting servers.\n\nThe component you will take responsibility for is offered as SaaS and is delivered from our own centralized infrastructure. This role is incredibly demanding and intriguing, given the scalability challenges and sensitive nature of the data we deal with. A thorough understanding of Python, message queues, large data sets, and security is crucial.\n\nYour work directly impacts the safety and functionality of millions of websites worldwide, so attention to detail and a high-quality standard are paramount.\n\nKey Responsibilities:\n\nDesign, develop, test, and deliver web applications using Django and related technologies.\nTechnical ownership of the created application.\nImplement user interfaces using front-end technologies (HTML, CSS, JavaScript frameworks).\nWork with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).\nBuild pipelines for code testing and delivery.\nEnsure application security and data protection.\nTroubleshoot and debug code across the stack.\nVersion control using Git, including branching, merging, and pull requests.\nReview your colleagues’ code.\nPlan your work forward.\n\nRequirements\n\nTo thrive in this role, we are looking for someone who has:\n\nMinimum of 5 years of experience in Python (Django) or full-stack development.\nProficiency in Django and Python for backend development.\nStrong experience with Linux as a development and deployment environment.\nExperience with front-end technologies like React, Vue.js, or Angular (at least 1 year).\nProven experience in building web applications and scalable systems.\nHands-on experience with containers, such as Docker, for development and production.\nProficiency with Git for version control.\nSolid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).\nExperience with libraries for managing background tasks like Celery or similar.\nExperience with tools for managing task queues like RabbitMQ or Kafka.\nStrong experience with building CI pipelines in tools like Gitlab or Jenkins.\nStrong problem-solving skills and attention to detail.\nAn intermediate level of English language proficiency.\nAbility to work with vague requirements.\nYou are a team player who can collaborate effectively.\n\nIt would be great if you also have:\n\nExperience with test automation frameworks.\nExperience with Kubernetes, helm charts, and ArgoCD or similar.\n\nBenefits\n\nWhat’s in it for you?\n\nA focus on professional development\nInteresting and challenging projects\nFully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide\nPaid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves\nCompensation for private medical insurance\nCo-working and gym/sports reimbursement\nBudget for education\nThe opportunity to receive a reward for the most innovative idea that the company can patent\n\nBy applying for this position, you agree with the Cloudlinux Privacy Policy – https://cloudlinux.com/privacy-policy – and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.",
    "stack": []
  },
  {
    "title": "Full-stack Developer, Web & Mobile",
    "company": "Springboard Collaborative",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/02145210/springboard_collaborative_logo.jpeg",
    "descriptionLink": "https://remote.co/job/full-stack-developer-web-amp-mobile-2/",
    "description": "Title: Full-stack Developer, Web & Mobile\n\nLocation: Remote Remote US\n\nType: Full-time\n\nWorkplace: Fully remote\n\nProduct, Engineering, Automation, & Quality team (PEAQ)\n\nDescription\n\nSpringboard Collaborative invites talented and passionate candidates to apply for the position of Full-stack Developer, Web & Mobile. The Full-stack Developer, Web & Mobile will be responsible for delivering seamless, high-quality mobile and web experiences, ensuring software products meet user needs and exceed expectations. A successful candidate will be an experienced mobile app developer and web developer with great attention to detail, strong teamwork and problem-solving skills, and expertise in React Native, React, and Ruby on Rails.\n\nSpringboard Collaborative closes the literacy gap by closing the gap between home and school. We coach educators and family members to help kids learn to read by 4th grade. Springboard envisions a world in which parents and teachers work together—rather than in isolation—to accelerate student learning. The Full-stack Developer, Web & Mobile supports this goal by creating software that makes our programs run smoothly, efficiently, and impactfully.\n\nThe Full-stack Developer, Web & Mobile will report to the Senior Director, Engineering & Quality Assurance and work as part of the Products & Services Team. This is a great opportunity to support an entrepreneurial team to maximize the impact of a rapidly growing organization.\n\nYou can read more about the requirements, competencies, goals, and responsibilities below. We’d love to have you join us!\n\nThis is important\n\nWe are an equal opportunity employer. Diversity is more than a commitment at Springboard Collaborative—it’s at the core of what we do and how we do it. No one can solve a problem better than those who experience it firsthand. That’s why Springboard aspires to hire a diverse team that is representative of the marginalized communities we serve.\n\nWe also know that having a diverse workforce makes for a better workplace. Springboard’s hiring process seeks individuals who value diversity of race, gender, sexual orientation, religion, ethnicity, national origin, etc.\n\nFinally, if you’re passionate about an open role, we encourage you to apply— even if you don’t meet 100% of the qualifications listed on the job description!\n\nHere are your priorities in the first year:\nYou will increase automated test coverage to 90% for critical parts of the application, focusing on areas that are prone to bugs.\nYou will integrate crash and performance monitoring tools to track and minimize unexpected mobile app behavior in real-time to ensure stability for users through robust error handling, fallback mechanisms, and graceful recovery from failures.\nYou will lead strategy development on at least one significant feature for the mobile application.\nYou will work with the team to build, test, and release three core features that involve both backend (Ruby on Rails) and frontend for React (web) and React Native (mobile).\nYou will develop an initial baseline and improve performance by 15% in key areas, like reducing application load times and backend request efficiency.\nHere are your responsibilities within and beyond the first year:\nYou translate requirements into technical specifications and work to plan, design, develop, and maintain new web and mobile requirements.\nDesign, develop, and maintain mobile features and UI components using React Native for both iOS and Android platforms.\nImplement and maintain web features using React and Ruby on Rails for seamless user experiences across devices.\nWrite clean, maintainable, and efficient code that adheres to coding standards and best practices\nDocument changes and updates made to the codebase to maintain a clear and organized code repository\nEnsure smooth and error-free deployment, contribute to the development of deployment scripts, and monitor application health after deployments\nYou design, develop, and maintain code integrations and API functionality.\nCollaborate with the Engineering team to design and implement code integrations with external systems, services, and APIs\nDevelop and maintain robust and scalable API endpoints and functionality\nImplement data validation, authentication, and authorization mechanisms to ensure the security and integrity of API interactions\nPerform thorough testing and debugging of API endpoints to ensure their correctness, performance, and adherence to specifications\nMonitor and optimize API performance, including response times and error handling, to ensure efficient and reliable operation\nDocument API endpoints, functionalities, and usage guidelines to facilitate integration by other developers or third-party services\nYou conduct thorough unit testing of features and bug fixes on both mobile and web platforms to ensure cross-platform consistency and reliability.\nWrite and execute unit tests to ensure the correctness and functionality of individual components and modules\nParticipate in error handling dispatcher rotations, identifying and reproducing bugs by closely monitoring, analyzing, and understanding reported issues, bugs, vulnerabilities, error logs\nDebug code using debugging tools and techniques to locate and fix the root causes of bugs\nCollaborate with team members to investigate and resolve complex technical and critical issues\nUtilize logging and monitoring tools to gather and analyze data for troubleshooting and bug fixing purposes\nActively participate in knowledge-sharing sessions to exchange insights, tips, and strategies related to unit testing, bug discovery, and debugging\nYou collaborate with internal and external product, engineering, and quality assurance team members to ensure software products meet the highest standards of quality.\nAttend all scrum events and Engineering Team meetings\nParticipate in requirement reviews to develop context for current and upcoming feature development\nProvide technical input and engage in discussions to ensure the proposed solutions meet the highest quality standards\nActively communicate progress, challenges, and risks to the team and stakeholders to maintain transparency and foster collaboration\nParticipate in code reviews and provide constructive feedback to improve code quality and maintainability\nContinuously learn and grow as a software engineer by staying updated with the latest technologies, frameworks, and industry best practices and actively seeking opportunities to enhance skills and knowledge through training, courses, and self-study\nYou support and mentor junior team members in mobile development and full-stack technologies.\nProvide guidance and support to other engineers in their learning and development efforts\nConduct regular knowledge-sharing sessions to disseminate best practices in mobile and full-stack development\nReview and provide feedback on other engineers’ code to help foster a culture of continuous improvement across the team\nWhat you offer us\n\nHere are the competencies and requirements we expect the right candidate to have:\n\nAnalysis & Reasoning: You actively collect and examine data to grasp issues with our products or methodologies, draw data-driven conclusions, make strong recommendations for improvement, and resolve bugs and obstacles.\nAttention to Detail: You diligently pursue completion, thoroughness, and accuracy in your work and pursue the highest quality in our software products through your coding and testing.\nTeamwork: You communicate and cooperate within and across teams effectively and proactively, sharing a commitment to achieve product goals and follow through on team deliverables.\nValuing Diversity, Equity, and Inclusion: You actively create and support a work environment and technical products that embrace and appreciate diversity, equity, and inclusion.\nProblem-Solving: You proactively work to resolve difficult and complicated technical challenges with diligence, creativity, innovation, and persistence, moving forward with initiative and focus.\nYou have 4+ years of experience in full-stack development, including mobile and web technologies.\nYou have 3+ years of experience with React Native for mobile development, alongside React and Ruby on Rails for web.\nYou have proficiency in mobile app development (iOS/Android) with a focus on performance optimization, debugging, and cross-platform consistency.\nYou have an understanding of software development principles, methodologies, and best practices, with a focus on mobile-first design.\nYou have knowledge of relational databases and the ability to write complex queries for data manipulation and retrieval.\n\nIt would also be nice if you had:\n\nYou have a degree in computer science or a related field\nYou have an understanding of mobile security practices, especially related to mobile data storage, authentication, and API interactions\nYou have experience with mobile-specific continuous integration and deployment practices\nYou have experience collaborating with off-shore development teams, demonstrating strong communication and coordination skills\n\nWhile this description is meant to provide an overview of the goals and responsibilities of the Full-stack Developer, Web & Mobile, we are seeking candidates who demonstrate flexibility and can adapt to evolving needs in an entrepreneurial environment.\n\nWhat we offer you\n\nCompensation\nOur compensation values: At Springboard, compensation equity is integral to the way we operate and our commitment to competitiveness, pay equity, performance-based rewards, transparent & equitable career growth, and progressive benefits.\n\nCompensation for this role: Each role at Springboard is placed in a compensation band with 5 levels. Generally, we expect candidates that meet all the hiring criteria to be offered the midpoint of the band. This role sits within Band 5. The midpoint of this band is $122,193. The actual level of the successful candidate (and corresponding salary) will be based on compensable factors such as job-relevant education, job-relevant experience, training, licensure, demonstrated competencies, and other factors. You may also be eligible for Springboard’s bonus program.\n\nOur process to determine compensation: Springboard does not negotiate the offered salary during the offer conversation. Throughout the interview process, we will evaluate your alignment with the compensable factors listed in the job description. From there, we will determine your starting salary on a level within the job band.\n\nBenefits\n\nAt Springboard, we feel it is important to take care of our employees, which is why we offer a competitive benefits package. These benefits include the following:\n\nThe usual stuff – Medical insurance with a cash stipend for those who waive Springboard coverage. Options include PPO, High Deductible/HSA, and EPO.\nWe’ll take care of it – We fully cover your vision & dental insurance premiums, plus your short & long-term disability coverage.\nSecuring your future – We match up to 6% of your salary in 403(b) retirement contributions after your first twelve months at Springboard.\nPaid Time Off (PTO) is important – Four weeks (20 days) annually. At Springboard, time off isn’t earned. Everyone gets access to their time at the start of the calendar year.\nHolidays! – All 11 federal holidays, two extra floating holidays, weekdays between Christmas and New Year’s Day, Election Day, and your birthday!\nUnder the weather? – We don’t cap the number of sick days available to employees.\nPaid Leave – Parental Leave (12 weeks after the first 6 months of employment). Marriage Leave (five days).\nTechnology – All employees receive a Springboard laptop and optional monitor. Springboard uses Google Workspace and Asana.\nWe are committed to your development – We provide personal & professional development funding of $2000/year.\nYour wellness is a priority – Our Employee Assistance Program (EAP) provides support for stress/anxiety, finance, law, family, substance abuse, grief, and more.\nTransparency is key – We ensure regular opportunities to discuss individual and organizational development and our commitment to equity. Consistent and structured real-time feedback is foundational to Springboard’s culture.\nLocation and travel\n\nApplications are welcome from any location within the United States. This role can be performed remotely, with quarterly travel to participate in team and org-wide retreats. Springboard Collaborative’s headquarters office is in Philadelphia, PA.\n\nSpringboard requires in-person employees at a Springboard facility or participating in in-person programming or events to be fully vaccinated against COVID-19 unless a medical or religious exemption is approved. Being fully vaccinated means an individual is at least two weeks past their final dose of a CDC-authorized COVID-19 vaccine regimen. As a condition of employment, newly hired employees will be asked to provide their COVID-19 vaccination status and proof of vaccination, as required.\n\nAbout Springboard\n\nSince our founding in 2012, we have grown Springboard’s reach from 40 to more than 100,000 students in over 300 Title 1 schools. Amidst rapid growth, Springboard consistently delivers best-in-class results. In schools that often struggle to get 20% of parents to show up for report card conferences, Springboard’s weekly family workshops average 88% attendance. Students average a 3-4-month reading gain during each program cycle, closing the gap to grade-level performance by about half in just five or ten weeks. Springboard’s work has been featured by Forbes, NPR, and the New York Times (twice). Nationally, Springboard Collaborative is the only organization to have cracked the code on equipping marginalized families to teach reading at home. You can learn more by watching our CEO on the main stage of ASU GSV.\n\nOur org chart & mission\n\nClick here to view Springboard’s structure at a glance, and here to browse our incredible staff. You can read more about how we engage teachers and families to accelerate student learning in this op-ed.",
    "stack": []
  },
  {
    "title": "Senior Fullstack Software Engineer (Remote US Only)",
    "company": "Solace Health - Find Solace, Inc.",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/10/31075111/Solace-Health-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-fullstack-software-engineer-remote-us-only-2/",
    "description": "Senior Fullstack Software Engineer (Remote US Only)\n\nLocation\n\nRemote\n\nType\n\nFull time\n\nDepartment\n\nEngineering\n\nAs a Full Stack Engineer, you’ll join a spectacularly talented team of fellow engineersbut you will also be expected to independently own your product workflow from initial design requirements through deployment. You will be expected to move aggressively, and you will commit code daily, but youll get that rush of seeing your work in the wild with live users on a regular basis as you build a revolutionary product from scratch.\n\nYou are an experienced engineer who can identify problems and architect the highest-quality solutions on timelines that would be unrealistic for most others. You are curious and enjoy working on ambiguous problems where the solutions are not (yet) well-defined. You take pride in your craft, have impeccable communication skills, and you absorb feedback exceptionally well. You arent afraid to make mistakes and learn from them. Above all, you enjoy taking ownership and are stifled by large organizations.\n\nWhat Youll Do\nAnalyze product requirements and produce high-quality, production-ready code while creating a best-in-class user experience.\nBuild and maintain new user-facing features with everything from database models to UI components.\nBe autonomous. Youll take full ownership of your work, and you take responsibility and accountability for every last detail, every step of the way.\nBe a collaborator. Youll work with other engineers and cross-functional partners in product and design to build a world-class product and lead new initiatives to improve our user experience.\nCreate services and APIs to drive existing and new features for web apps.\nMaintain the health of our systems and codebase, refactor and make improvements, and keep our systems robust and resilient.\nWrite clear specs to ensure product/code quality for stress-free deployment.\nDrive large releases to production on a continuous deployment cadence.\nWhat You Bring to the Table\nExperience working in a start-up environment.\n5+ years of relevant experience on both frontend and backend development.\nStrong React fundamentals and a background working with Typescript/Node.\nAn intuitive understanding of what it takes to create delightful, consumer-oriented experiences.\nStrong communication skills that help you influence product direction and help collaborative visions come to life.\nExtreme bias toward action and execution. You get antsy if youre not writing code, improving the codebase, and vigilantly enhancing the systems that represent the big-thinking work.\nLive in the United States\nOur Tech Stack\nTypescript across all our applications\nNestJS API with TypeORM\nPostgres\nRedis\nReact/NextJs\nCustom UI library built on Ant design\nHeroku",
    "stack": []
  },
  {
    "title": "Senior Full Stack Engineer",
    "company": "Chartbeat",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/02143829/Chartbeat-Logo.jpeg",
    "descriptionLink": "https://remote.co/job/senior-full-stack-engineer-2-2/",
    "description": "Title: Senior Full Stack Engineer\n\nLocation: Remote\n\nTubular and Lineup have partnered with Chartbeat to help you grow reach and revenue for your content.\n\nIn 2023, Chartbeat joined forces with Tubular, the leader in global social video intelligence and measurement, and Lineup Systems, the leading global provider of media sales technology. Together, we’re expanding the ecosystem of insights we provide to enterprise content creators who are developing audiences and revenue streams across channels. We now serve more than 1,000 brands globally, including The New York Times, the BBC, ESPN, Gannett, Vox, BuzzFeed, Paramount, WB, Mediahuis, Hearst, McClatchy, and GQ.\n\nYou’ll be joining a diverse group of focused, hard-working people who are passionate about doing work that’s challenging and fun-and who strive to maintain a healthy work/life balance.\n\nThe Team\n\nWe are a full-stack team that uses Angular with TypeScript, GraphQL, and Python daily. We are looking for a senior engineer to help us expand our capacity to deliver amazing web based user experiences while maintaining a high degree of code quality. Our scope includes all the browser code and the APIs necessary to deliver data to the browser. The team works closely with the product team to ideate, develop, and deploy new features. As a member of a full-stack team, you would be responsible for end-to-end implementation of features, advocating for best practices, and providing technical leadership\n\nWhat we are looking for:\n\nHave 5 or more years of industry experience as a full stack software engineer with at least 2 of those years including active development using a JavaScript framework (e.g. Angular, React, Vue, etc).\nProficiency in Python is a requirement for this role\nHave experience working on complex technical initiatives that require collaborating with a cross functional team.\n\nWhat you bring:\n\nExcitement around building good software.\nAn open and inclusive mindset.\nWillingness to work in a fully remote environment and be a self-starter.\nWillingness to participate in on-call duties.\nSkillful communication of ideas that enables collaboration with others with the ultimate goal of building consensus.\nEnthusiasm to mentor more junior engineers.\nAbility to adapt quickly.\n\nWhat we use:\n\nBelow is a non-exhaustive list of some of the tech. we use, experience with these specific technologies is not required, it listed to give a flavor for what the team works with most regularly:\nAngular with TypeScript.\nRxJs for reactivity.\nNgRx for reactive state management.\nGraphQL standalone service built using Graphene-Python.\nApache Thrift for interfaces to backend services.\nApache Spark for data processing jobs and ad-hoc analysis.\n\nDiversity, Equity, and Inclusion Statement\n\nAt Chartbeat we strive to create and continually grow as a company where all employees are able to be their authentic selves. We are committed to recruiting, hiring, and retaining employees from different backgrounds, viewpoints, and experiences. Our strength is our diversity and we are dedicated to continuously reflect upon, and evolve our efforts to maintain a diverse, equitable and inclusive ecosystem.\n\nEqual Opportunity Employment Statement\n\nChartbeat is an Equal Opportunity Employer and does not discriminate on the basis of race, color, gender, sexual orientation, gender identity or expression, religion, disability, national origin, protected veteran status, age, or any other status protected by applicable national, federal, state, or local law.\n\nChartbeat’s CCPA disclosure notice can be found here.",
    "stack": []
  },
  {
    "title": "Lead Frontend Engineer",
    "company": "Movable Ink",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2021/08/27093209/Movable_Ink-150x150.jpg",
    "descriptionLink": "https://remote.co/job/lead-frontend-engineer-1/",
    "description": "Title: Lead Frontend Engineer\n\nLocation: New York City United States\n\nJob Description:\n\nAs a Lead Front End Engineer on our team, you will take ownership of Designer, our creative content editor, a key component of our platform that empowers marketers to design and deliver personalized experiences. Your expertise in modern front-end technologies and the React Web Framework will drive the development and enhancement of this product, ensuring it is intuitive, responsive, and performant. You will collaborate closely with backend engineers, product managers, and designers to deliver features that empower our users and support the company’s growth.\n\nResponsibilities:\n\nLead the design and implementation of scalable, high-performance solutions for Designer.\nCollaborate with Product Management, Design, and other stakeholders to maintain a high standard of quality in a dynamic, fast-paced environment.\nTake ownership of internally developed frameworks and libraries that powers Designer and customer success teams.\nConduct code reviews and provide constructive feedback to team members to ensure code quality and best practices.\nWork closely with backend engineers to integrate front-end components with APIs and backend services.\nContinuously explore and adopt new tools, technologies, and methodologies to enhance the development process and product offerings.\n\nQualifications:\n\nSignificant experience with the React Javascript framework to build technical products\nProven experience in integrating front-end applications with APIs, especially those built with different languages or frameworks like Rails.\nDemonstrated ability to deliver complex projects that span multiple services and tech stacks.\nDemonstrated ability to incorporate work from and collaborate with a team of developers and designers to advance our shared Design System.\nExperience with modernizing legacy systems that are crucial to the business and familiarity with their challenges\nExperience with development and maintenance of internal libraries and tooling for developers and technical personas\nExperience with version control systems like Git and familiarity with collaborative development practices in a Remote-first environment.\nStrong problem-solving skills, with experience in performance optimization and debugging.\nExcellent communication skills, with the ability to work effectively with cross-functional teams including product managers, designers, and other engineers.\nA passion for learning and adopting new technologies, tools, and best practices.\n\nThe base pay range for this position is $185,000-$210,000 USD/year. The base pay offered may vary depending on job-related knowledge, skills, and experience. Stock options and other incentive pay may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, depending on the position ultimately offered.",
    "stack": []
  },
  {
    "title": "Front End Developer",
    "company": "Acoustic, L.P.",
    "dateCreated": "2024-11-04",
    "linkImage": "https://remoteco.s3.amazonaws.com/wp-content/uploads/2024/11/01185436/goacoustic_logo.jpeg",
    "descriptionLink": "https://remote.co/job/front-end-developer-1/",
    "description": "Title: Front End Developer\n\nLocation: Remote Remote US\n\nType: Full-time\n\nWorkplace: Fully remote\n\nJob Description:\n\nDevelop dynamic UI screens using HTML5, CSS3, JavaScript, AngularJS, ReactJS, Bootstrap, NodeJS, ExpressJS, Dojo, Rappid, JointJS and jQuery. Use AngularJS components like directives, factories and service resources, routing, dependency injection, 2-way data binding, filters and events. Work on Rappid and JointJS framework to create an interactive flowchart, diagrams for programs and enable users to manipulate the data. Develop custom AngularJS directives to build custom reusable components to use across the application pages.\n\nImplement ReactJS custom common components to reuse code. Maintain unit testing coverage using Jest framework. Use SASS (Syntactically awesome style sheets) while styling with CSS3. Develop workflow using task runner Grunt, package management tools BOWER, NodeJS for the server-side run-time environment. Work with Responsive Web Design templates to meet cutting-edge technology requirements. Use bootstrap library to build UI project quickly and efficiently. Use JSON for storing and exchanging information between browsers and servers. Design and develop application using Agile methodology. Use Jenkins for building, deploying, and creating change controls for deploying code into environments. Use GIT (source code management) for version control. Fully remote telecommuting position.\n\nRequirements\n\nRequires, at minimum, a bachelor’s degree in Computer Science, Computer Engineering or closely related field, or foreign equivalent.\nMust have at least 3 years’ experience in the job offered or related.\nBuilding Web User Interfaces utilizing software development tools including HTML5, CSS3, Javascript, Typescript, jQuery, AngularJS, NodeJS, ReactJS, JSP, Dojo, Rappid and JointJS that follow W3C Web Standards, are browser compatible, and create user-friendly web pages.\nCreating reusable AngularJS components and services to minimize code.\nWorking with AngularJS to implement Single page applications (SPAs) using directives, modules, expressions, routers, views, model, and controller, and coordinate with the back-end developer in the process of building RESTful API’s.\nTranslating UI/UX design wireframes to actual code and creating Responsive Web Design using Bootstrap and CSS3 media queries.",
    "stack": []
  }
]